{"id":"10012","name":"Tremend Software Consulting","tagline":"Advanced Software Engineering","profile":"/profile/tremend-software-consulting","website":"https://www.tremend.com","directory":"directory/mobile-application-developers","page":"128","verified":"","description":"Tremend Software Consulting is a software engineering company with over 12 years of experience in developing highly complex solutions for companies around the world. We specialize in delivering enterprise platforms, advanced engineering for car manufacturers, IoT and business solutions based on AI, Machine Learning and Biometrics. \nFounded in 2005, we have successfully developed hundreds of solutions for leading companies in banking, telecom, automotive, commerce, retail and professional services. Ever since, we have been the software engineering partner for companies like ING, Coats, Carrefour, Orange, Wind River and many others, driving agility and technical expertise into each project. \nOur technical consultants are world-class engineers, trained in the best educational institutions in Romania, with internationally recognized results, experimenting with the latest technologies in our Tremend Labs and helping customers overcome technical challenges.\nTremend is featured among the fastest growing software engineering companies in the region by Deloitte and INC. 5000.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"165 Splaiul Unirii, Timpuri Noi Square, TN Office 2, 4th floor, district 3","locality":"Bucharest","region":"","postal_code":"030134","country":"Romania","phone":"+40 (21) 223.77.00"},{"headquarters":false,"address":"15 Brookline","locality":"Aliso Viejo","region":"CA","postal_code":"92656","country":"United States","phone":"+1 949.636.8648"},{"headquarters":false,"address":"2 Nicolae Titulescu street, 1st floor","locality":"Brasov","region":"","postal_code":"500010","country":"Romania","phone":""}]}