{"id":"100966","name":"misija","tagline":"Next-Generation Software Development","profile":"/profile/misija","website":"https://www.misija.io","directory":"directory/mobile-application-developers","page":"174","verified":"","description":"Full-cycle Software Development Services for Web, Mobile and Desktop Applications \nFrom the initial idea to project completion, we handle all aspects of the software development cycle for web, mobile and desktop applications.\nAbout us: Based in Sarajevo, Bosnia, Misija is a next-generation software development company that focuses on the augmentation of business processes through the use of software. Our services are designed to deliver and deploy software solutions using a wide variety of methodologies and technologies. Our approach is based on forming a deep understanding of your business and its operations, in order to generate insights into how software can be used to achieve business objectives. When combined with the latest trends and developments in web, mobile, IoT, blockchain, cloud computing and database technologies, businesses can exponentially improve the value of their assets.\nTeam: Over the years we’ve built an excellent team of 15 members. We work with engineers, project managers, and developers that have a firm grasp of server-side, client-side, and mobile technologies. Due to our approach, we can rapidly expand the size of our team in order to meet project requirements, so that no project is too big, and no deadline is too tough.\nOffice: In our office we place an emphasis on nurturing a positive atmosphere that is highly conducive to performance on the job. Working as a team, we are able to ensure open communication, insightful back and forth, and complete cooperation. We’re always on the lookout for new team members, and we want our office to be one of the main selling points for a potential candidate. By choosing to join our team, you will have the comfort of working at home, with the motivation to perform that you develop when participating in a team effort.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Branislava Nusica 160","locality":"Sarajevo","region":"FSA","postal_code":"71000","country":"Bosnia and Herzegovina","phone":"061803700"}]}