{"id":"101","name":"GSS Infotech","tagline":"one stop partner for IT developmnt & support needs","profile":"/profile/gss-infotech","website":"http://www.gssinfotech.com","directory":"web-developers","page":"200","verified":"","description":"Founded in 1999 GSS Infotech is a pioneer in applying innovative, technology-based solutions to common business problems. We help organizations leverage the power of Virtualization, \"The Cloud\" and outsourced models of technology services delivery. Utilizing these technologies, we help organizations gain competitive advantage, reduce costs, ensure system stability, and improve efficiency.\n\nSpecializing in Remote Infrastructure Management Services, Virtualization solutions and Application Management Services, GSS is a partner of choice for Infrastructure optimization solutions worldwide.\nWith a global headquarters at Hyderabad in India, GSS Infotech has quickly grown through organic growth and strategic acquisitions and has 9 Business centers and 3 Development centers across the globe.\n \nGlobal Presence, Local Delivery\nDuring this period of accelerated growth the company has established itself as a preferred partner for IT services to hundreds of Fortune customers worldwide, spanning Telecom, Banking and Financial Services, Insurance, HealthCare, Retail and Government organizations. GSS Infotech offers world-class services propelled by industry experts and a vast pool of professionally qualified work force operating across the globe. The company has been recognized by international standards a number of times.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"250 - 999","founded":"1999","locations":[{"headquarters":true,"address":"N heights, Ground Floor, Wing-B, Plot No.12, TSIIC Software Units Layout, Madhapur, Serilingampally Mandal, Rangareddy District \nMadhapur","locality":"Hyderabad","region":"AP","postal_code":"500 081","country":"India","phone":"+91.40.44556600"},{"headquarters":false,"address":"2050, Brunswick Plaza - 1, State Highway 27, Suite #201","locality":"North Brunswick","region":"NJ","postal_code":"08902","country":"United States","phone":"+1.732.798.3101"}]}