{"id":"101322","name":"ABM Integrated Solutions","tagline":"We make technology work","profile":"/profile/abm-integrated-solutions","website":"http://www.abmis.ca","directory":"it-services","page":"83","verified":"","description":"OUR SOLUTIONS ARE DESIGNED WITH AN INNOVATIVE APPROACH TO CREATING VALUE FOR YOUR BUSINESS.\nWe will analyze your business needs and make recommendations using only leading innovative technology solutions that we have researched, trained and certified and that we stand behind.\nWhat started as a field services company reselling 3rd party Point of Sale (POS) systems, cash registers, field service repair and help desk support in the early 80’s, has grown to a multimillion dollar service provider delivering innovative solutions across multiple sectors including Retail, Healthcare, Logistics and Transportation, Insurance, Legal, Natural Resources, Public Sector, Communications, Financial Services and Energy. Today we proudly have points of presence and clients across North America providing solutions and offering services from Business & IT Consulting, Cloud Services, Field Operations, Lifecycle Management, Managed Services and Service Desk support.\nABM is a part of Nova Scotia based company Atlantic Corporation Limited (ACL), also owned and founded by Mr. Shannon. ACL has other commercial interests in multiple sectors employing over 6,000 people. We are a financially sound company with the capability to invest and grow quickly to respond to the needs of our clients.\nThe people of ABM are guided by our values: team work, innovation, service excellence and financial responsibility.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"1974","locations":[{"headquarters":true,"address":"98 Williams Avenue","locality":"Dartmouth","region":"","postal_code":"B3B 0A1","country":"Canada","phone":"902.468.9140"},{"headquarters":false,"address":"180 Shirreff Avenue","locality":"North Bay","region":"","postal_code":"P1B 7K9","country":"Canada","phone":"705.474.2528"},{"headquarters":false,"address":"16 forest Road, Suite 304","locality":"St. John's","region":"","postal_code":"A1C 2B9","country":"Canada","phone":""}]}