{"id":"10276","name":"Comentum","tagline":"Integrity. Quality. Success.","profile":"/profile/comentum","website":"http://www.comentum.com","directory":"directory/mobile-application-developers","page":"142","verified":"","description":"Building your Success with these Advantages\nExperience – Since 1996 Comentum has worked with hundreds of clients and engagements from interactive design to complex web database application projects.\nPersonal Attention – Comentum specialized teams provide senior level staff for your project to insure a successful completion and timely delivery.\n\nLong Term Partnership – Your success is important to Comentum and the Comentum Teams enjoy long-term partnerships that result in your success and growth.\nSenior Level Staff – As part of each project, knowledgeable and experienced Comentum Teams deliver the \"open door for success.\" Comentum Teams are specialists in their field, have years of experience, integrity, stay current with the latest and most appropriate web and mobile technology, and deliver beyond expectations.\nIn-house – Comentum Teams work together at the Corporate Office in San Diego, California, and do not contract out any jobs to off-shore or outside contractors.\nQuality – Comentum’s clients receive the best quality available. Web application development, mobile development, creative and usability services and all levels of Internet technology consultation and service are provided using best practices. Comentum's specialized teams guarantee delivery of product quality and accuracy.\nAgile Development and Versatility – With specialized development teams, Comentum is able to provide concurrent development for a faster project timeline and deployment. Because of Comentum's project diversity and working with a large variety of industries, a comprehensive knowledge base and experience is available, and Comentum's Common Libraries that have been developed over 13+ years to insure a faster, more economical project development.\n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1997","locations":[{"headquarters":true,"address":"6222 Ferris Square","locality":"San Diego","region":"CA","postal_code":"92121","country":"United States","phone":"+1.858.410.1500"}]}