{"id":"10288","name":"CrowdTorch","tagline":"Mobile Apps for Events, Concerts, and Festivals","profile":"/profile/crowdtorch","website":"http://www.crowdtorch.com","directory":"directory/mobile-application-developers","page":"100","verified":"","description":"CrowdTorch is the leading provider of mobile applications for consumer and social events, with a goal to translate the experience of your event into a mobile application. We build mobile apps that capture the excitement, shared community, brand and conversation around your event. Whether it's for a music festival, sporting event, culinary event or a community get-together, we can create a mobile app that will engage your attendees and add a little more fun!\n\nTodd Rogers and Rick Solner started CrowdTorch in 2009 because they loved attending festivals and wanted to find a way they could attend more. This passion is what drives the development of our apps, and we always want to build apps that attendees love as much as the festival organizer! CrowdTorch has built apps for ESPN's X Games, the Kentucky Derby, the National Cherry Blossom Festival, and Toyota's Auto Show, to name a few. Its mobile apps have been downloaded by over two million users, average a 4.5 star rating across mobile platforms, and have consistently increased attendee participation and sponsor interest at hundreds of high-profile events.\nCrowdTorch recently joined Cvent—the leading provider of cloud-based event management solutions and mobile applications for event organizers around the world. Now that CrowdTorch is a Cvent product, the solution is backed by over 950 employees spanning multiple continents. With the passion and experience of the CrowdTorch team, the best event apps in the industry will continue to be built by us.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"1715 S. Capital of Texas Highway, Suite 100","locality":"Austin","region":"TX","postal_code":"78746","country":"United States","phone":"866.276.9367"}]}