{"id":"10293","name":"Cyber-Duck","tagline":"We deliver transformation, powered by UX and tech","profile":"/profile/cyber-duck","website":"https://www.cyber-duck.co.uk","directory":"web-developers","page":"4","verified":"","description":"Established in 2005, Cyber-Duck is a leading digital transformation agency that works with global brands such as the Bank of England, Cancer Research and Mitsubishi Electric.\nCyber-Duck delivers transformation, powered by user-centred design, data and technology. Its unique user-centred design process is ISO accredited. Driven by agile and lean project management principles, its experts ensure your brand, website and marketing campaigns perform exceptionally, every time.\nThe team has spoken as industry experts on BBC Watchdog and The Gadget Show alongside notable conferences like SXSWi, UKTI and UX London. The agency is part of Deloitte’s Technology Fast 500 (EMEA) and has won sought after awards including the Webby, Wirehive 100 and UXUK Awards.\nCyber-Duck's services include:\nUser Experience\nDesigning engaging interfaces is at the heart of what we do. Our accredited user-centred design process drives each website, app, brand or product we produce.  \nDigital Transformation\nWith technology as an enabler, we drive user-focused transformation through focusing on your users, data, process and culture.\nDevelopment\nOur agile development process ensures rapid and high quality delivery. We produce everything from websites, apps and ecommerce systems through to CRM and SaaS. These include SilverStripe, Drupal, Magento, Sitecore and PWAs.\nMarketing\nMore than implementing campaigns, we fuse creativity and data-driven design to implement cross-channel marketing strategies that improve your conversion rate and drive consistent growth.\nBrand Strategy\nWe create compelling brands that convey companies’ mission, values and personality. This sets the tone for emotive user experiences that engage with customers in a meaningful way. \nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2005","locations":[{"headquarters":true,"address":"85 Cowcross Street, Farringdon","locality":"London","region":"","postal_code":"EC1M 6PF","country":"United Kingdom","phone":"+44.20.8953.0070"},{"headquarters":false,"address":"Elstree House, 12 High Street","locality":"Elstree","region":"","postal_code":"WD6 3EP","country":"United Kingdom","phone":"+44.20.8953.0070"}]}