{"id":"103038","name":"Bird Marketing Limited","tagline":"Award Winning Digital Agency","profile":"/profile/bird-marketing","website":"https://birdmarketing.co.uk","directory":"web-developers","page":"37","verified":"","description":"Based in the vibrant heart of London & Essex, Bird Marketing have been established for 7 years. We are a small band of rebels, dedicated to bringing our customer’s business visions to life using all of the knowledge and experience that we bring together as a team.\nOur priority is to deliver an exceptional service and we ensure that our staff are always striving to achieve the highest levels of customer satisfaction. Our main focus is on your return on investment and subsequently our success is based upon your success!\nOur operating philosophy is simple, we stick to what we know and what we are good at! By doing this we can offer our customers a service that they can trust, knowing that the team have extensive knowledge in these areas.\nOur three main services of Web Design, Pay per click and Search Engine Optimisation are all delivered using our proven processes to promote efficiency and reach our customer’s objectives. By using our processes we ensure that the best practices are followed by all staff which leads to the end product always being of the best quality.\nThe company policy that is observed by every team member is to be conscious of the environment and this is reflected in the way that we operate. Our hosting infrastructure uses renewable energy sources and our offices are paperless. We are constantly reviewing our suppliers and processes with the bigger picture in mind so that we can play our part!\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"13 Austin Friars","locality":"London","region":"","postal_code":"EC2N 2HE","country":"United Kingdom","phone":"0208 338 1206"},{"headquarters":false,"address":"128a High Street, Billericay","locality":"Essex","region":"","postal_code":"CM129XE","country":"United Kingdom","phone":"01277286565"}]}