{"id":"103130","name":"Zemingo","tagline":"Mobile & Web App Design & Development","profile":"/profile/zemingo","website":"http://www.zemingo.com","directory":"directory/mobile-application-developers","page":"161","verified":"","description":"Zemingo is a premier mobile and web design and development agency leading the emerging field of Consumer IoT (CIoT). We work with enterprises and emerging startups to deliver world-class digital products, turn devices into smart, connected devices and drive digital transformation. \nWe design and develop our products to abide by HIPAA and GDPR compliance regulations.\nCapabilities: UX/UI Design, Swift, Java, AngularJS, Node.js.\n \nOur services / Design\n \nZemingo's digital studio specializes in brand and user experience. Our creative approach is driven by our curiosity. Every project has a unique story and cultural context of its own. We're eager to learn our clients' stories, collaborate with them, and help them share their passion projects in a clear and engaging way, exciting their audience and helping them maintain long-lasting relationships. \nOur services / Development\nZemingo’s main driving force is its software engineering unit, specializing in mobile, web & cloud projects, including development for iOS & Android OS, as well as server-side, web and cloud. Our R&D process includes technical product specification, system architecture, code design, QA, and stabilization. Every project developed by Zemingo is accompanied by an experienced project manager, using agile methodology.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"10 Hasadna'ot St.","locality":"Herzliya","region":"","postal_code":"","country":"Israel","phone":"+972 (9) 950-0605"},{"headquarters":false,"address":"81 Prospect, Brooklyn","locality":"Brooklyn","region":"NY","postal_code":"11201","country":"United States","phone":"+972 9-950-0605"}]}