{"id":"103627","name":"Etched Marketing","tagline":"Connecting SEO, Social Media, & Content Marketing","profile":"/profile/etched-marketing","website":"http://www.etchedmarketing.com","directory":"seo-firms","page":"33","verified":"","description":"Etched Marketing - A Digital Marketing Agency\nEtched Marketing is a digital marketing agency based in Phoenix, AZ. We specialize in SEO, Content Marketing, and Social Media and helping clients leverage the three together to create cohesive cross-channel marketing campaigns that drive results.\nOur Founder, Rachel Lindteigen is a 20-year marketing industry professional who worked for special events, non-profits, franchise organizations, education companies, and for several ad agencies before founding Etched Marketing. She founded Etched Marketing to help brands unite with their customers and have meaningful conversations that drive conversions.\nRachel holds a degree in Broadcast Journalism from the Walter Cronkite School of Journalism and Telecommunications at Arizona State University and an MBA with a special focus on Marketing. Her background in journalism helps craft content strategies for clients that address their customers’ questions and drive sales. The MBA provides the business understanding to make strategic decisions about budgets and ROI with her clients.\nShe’s worked with clients in many industries over the years. Her strategies and tactics have driven clients to the top of Google’s 1 st page for terms including home décor, mirrors, Christmas decorations, backpacks, diaper bags, handbags, purses, winter coats, winter jackets, chocolates, diamond engagement rings, and more. Past clients have driven over $1 million per month from SEO revenue alone. Some have experienced 100% year-over-year growth for several years in a row.\nContact Us\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2014","locations":[{"headquarters":true,"address":"","locality":"Phoenix","region":"AZ","postal_code":"85001","country":"United States","phone":"+1.480.382.9071"}]}