{"id":"103717","name":"Initech Software Services Ltd.","tagline":"Mobile and Web development in Ramat Gan","profile":"/profile/initech-software-services","website":"https://initech.co.il","directory":"directory/mobile-application-developers","page":"387","verified":"","description":"Initech is an innovative software company that develops digital products for startups and online businesses. We are experts in understanding the client’s vision and needs, be it in application development and/or UX/UI design. We know how to listen, analyze and build appealingly clean and highly function-able products. Our systematic and professional approach allows us to create a wide range of digital products.\nInitech is an innovative Israeli-based software powerhouse. We specialize in developing digital products for startups and online businesses. We build high-end client-side and server-side web and mobile applications using best-of-breed open-source technologies.\nProject types and work formats\nProduct - from idea (highly multidisciplinary, managed by Initech), usually performed on time & material basis\nProduct - from spec (focus on software, managed by Initech), can be  performed globally or time & materials (depending on the required level of flexibility / uncertainty in requirements)\nMaintenance / Tech assignments (focus on software layer, managed by customer), retainer or hours-bank based\nConsulting (focus on specific skills, managed by customer), retainer or hours-bank based\nOur Technology\nWe use Python / Django / PostgreSQL / ElasticSearch technology stack for server-side development.\nWe use ReactJS for client-side development (we support Angular as well).\nWe use AWS services for high-scalability operations.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Tuval 15","locality":"Ramat Gan","region":"","postal_code":"5213606","country":"Israel","phone":"+1-646-5008659"}]}