{"id":"105100","name":"Boldr Strategic Consulting","tagline":"Poised to Deliver","profile":"/profile/boldr-strategic-consulting","website":"http://www.boldrstrategy.com","directory":"web-designers","page":"32","verified":"","description":"Business-Minded. Human-Centered. Technically Strong.\nWe are a diverse group of business people, creative technologists, designers and marketing strategists. Our team is uniquely positioned to help mid-market organizations harness the power of digital technology to:\nUnlock your unique value\nCreate new business opportunities\nRealize cost savings through technology\nWe are passionate about creating a new kind of consultancy. One that enables digital transformation through a strategic methodology of business strategy, customer experience, and technology implementation.\nOur highly collaborative process is designed to change our clients for the better, by bringing empathy and human-centered thinking to everything we do.\nWe call ourselves a digital success management consultancy:\nWe offer big consulting firm solutions to mid-market clients.\nOur highly entrepreneurial consultants understand the business landscape, have proven experience in business strategy and are at the forefront of digital trends that can set our clients apart.\nWe practice a Design Thinking framework.\nDesign thinking is an iterative process in which we seek to understand users, challenge assumptions and redefine problems to identify alternative strategies that may not have been readily apparent previously. Design thinking takes empathy!\nWe have proven deep technical expertise.\nWe have worked with thousands of organizations on complex technology products. The majority of our technical work is rooted in large scale website redesign and integration with multiple systems.\nFollow us at:\nFacebook: https://www.facebook.com/boldrstrategy/\nLinkedIn: https://www.linkedin.com/company/boldr-strategic-consulting/\nTwitter: @BoldrStrategy\nInstagram: @we_are_boldr \nREAD MORE...","min_project_size":"$100,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"Undisclosed","locations":[{"headquarters":true,"address":"8136 Old Keene Mill Road Suite A201","locality":"Springfield","region":"VA","postal_code":"22152","country":"United States","phone":"703-451-8675"},{"headquarters":false,"address":"","locality":"Washington","region":"DC","postal_code":"20001","country":"United States","phone":""}]}