{"id":"106058","name":"Rays TechServ Private Limited","tagline":"Redefining IT","profile":"/profile/rays-techserv-private","website":"http://www.raysindia.com","directory":"directory/mobile-application-developers","page":"116","verified":"","description":"Rays Techserv an ISO 9001:2008 certified organization, is a renowned IT Software Solutions provider based in Ahmedabad, India.\nEstablished in 2002, Rays Techserv, with it's dedicated and skilled team of professionals has able to create dynamic and cost effective solutions for it's clients that are based all over the USA, UK, Japan, Canada and other parts of the World. We believe in delivering services without compromising on time or quality.\nRays Techserv is believed to be one of the popular providers of IT services. The professional company is closely structured in such a way to offer more acquirable results and solutions for use in a variety of businesses, encountering problems in information and technology sector.\nWe have a good and proper coordinating partnership between the company's intramural internal environments and emerging external IT surrounding. Driven by commitment and hardwork, Rays Techserv has in very little time, been able to grow into a Mobile App Development service provider with clients spread all over the World as well as India.\nA member of the prestigious GESIA, Rays Techserv Private Limited has been providing Software Development solutions like Android (link is external), Java Development, Asp.Net iPhone (link is external) and Windows (link is external) App Development and Website (link is external)Development, since 2002.\nFor more information connect with us on Skype: raystechserv\nor email @ : rdave@raysindia.com\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2002","locations":[{"headquarters":true,"address":"B - 311, Himalaya Arcade, Opp. Vastrapur Lake","locality":"Ahmedabad","region":"GJ","postal_code":"380 015","country":"India","phone":"+91.79.2676.5056"}]}