{"id":"106756","name":"Youtech","tagline":"We Build Empires","profile":"/profile/youtech","website":"https://www.youtechagency.com","directory":"web-designers","page":"14","verified":"","description":"Birth of an Empire\nBuilding since 2012\nYoutech & Associates (‘Youtech’ for short) CEO Wilbur You incorporated the company in July 2012 with the $600 he had to his name. Times were tough without a consistent revenue stream, but You and his team of two at the time made it work. His goal was to personally call 100 companies every day with an offer to build their websites for $500. Ninety-nine times out of 100 his proposal would be rejected, but as we all know, all it takes is one.\nAfter three to four months, You and his charges finally had enough money to move to downtown Naperville – and they never looked back. Within 6 years, Youtech moved to a 6,000 square foot office at its current address and opened up another 5,000 square foot office in Scottsdale, Arizona.\nFrom the days of going after small mom-and-pop shops to signing quarter-million dollar deals, Youtech has never wavered in its commitment to treating each project like it’s the last. Developing websites will always be our bread and butter, but our programming, mobile app development, and digital marketing strategies have grown more sophisticated as we increase our national footprint. The addition of our Scottsdale office has been a significant milestone in entering new markets and industries. Don’t stop us now.\nWhy We’re The Best\nAs a modern, full-service agency, Youtech combines the best qualities of both digital and traditional marketing and advertising to effectively achieve your goals. In an industry where change is the constant, we’re comfortable being uncomfortable. Taking on new disciplines and projects refines our skills and makes us not just better for ourselves, but our clients.\nYoutech is filled to the brim with the most sharp-witted minds in the all dedicated working together to accomplish one goal: building your empire.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$200 - $300 / hr","num_employees":"10 - 49","founded":"2012","locations":[{"headquarters":true,"address":"387 Shuman Blvd, Suite 310W","locality":"Naperville","region":"IL","postal_code":"60563","country":"United States","phone":"630.857.9545"},{"headquarters":false,"address":"5725 N. Scottsdale Rd, Suite 100","locality":"Scottsdale","region":"AZ","postal_code":"85250","country":"United States","phone":"(480) 525-6250"}]}