{"id":"106828","name":"TechnoGems Inc.","tagline":"Custom Web and Mobile Application Experts","profile":"/profile/technogems","website":"http://www.technogemsinc.com","directory":"directory/mobile-application-developers","page":"183","verified":"","description":"TechnoGems Inc. is a small technology startup business in Northern Virginia. We specialize in providing custom web and mobile application development. We also specialize in responsive Web applications, Android applications, iOS applications, and enterprise solutions. Our clients include several small firms to large Government contractors. Our key personnel has a wealth of experience in the internet and mobile arena.\nWe provide innovative solutions using Agile, Cloud, DevOps and Big data. \nTechnoGems has software engineers who specialize in iPhone Application Development, Google Android Programming, Java, J2EE, PHP, JavaScript, jQuery, MySQL, J2ME and other Web 2.0 technologies. TechnoGems has developed a portfolio of our own products and expertise in building custom software for our customers. \nWe offer design, development, project management, strategy, distribution, and partner closely with our customers to achieve their goals. With our expertise, we have helped our Government customers modernize their cargo processing, risk assessments & EDI data processing systems. Our pragmatic approach to solving problems has helped the Government and the Industry to work together and exchange information in an efficient manner and bring down cost. To learn more and about our capabilities or schedule a meeting, contact us.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"4000 Legato Road/Suite 1100","locality":"Fairfax","region":"VA","postal_code":"22033","country":"United States","phone":"703.828.2335"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"","phone":""}]}