{"id":"108617","name":"Pixel Fusion","tagline":"A fusion of design and development.","profile":"/profile/pixel-fusion","website":"https://pixelfusion.co.nz","directory":"web-developers","page":"371","verified":"","description":"We are a Digital Product Studio\nWe fuse design and technology to create sustainable products and services for the progressive age.\nThe result for our partners are creative and innovative tech products and services which provide strong, definable value that increase commercial growth for businesses in New Zealand.\nSupporting our clients’ successes\nWe are driven by our mission to do everything possible to empower New Zealand businesses to become digitally mature. We do that by teaching innovation strategy; creating tech products that last; building a creative, brilliant and diverse team, and by making a positive impact in the businesses we partner and work with.\n \nHOW DO WE HELP?\nDiscover Services\nWant to understand your users or business better?\nWe’ll provide expert research and facilitation for design sprints, user testing and design thinking exercises to equip you with insights and the answers you need.\nDeliver Services\nNeed to design and build a digital product or website?\nWe’ll combine user-centred design with open-source technologies to create powerful solutions for your company.\nEmpower Services\nAre you looking for more from your digital partner?\nFrom running roadmap workshops, to consulting on digital transformation, we’ll assist you to build capability, define your strategy and enable innovation.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"LEVEL 3, UNIT 12 - TEXTILE CENTRE, 117 ST GEORGES BAY RD, PARNELL","locality":"AUCKLAND","region":"AUK","postal_code":"1052","country":"New Zealand","phone":"64.9.353.1234"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"","phone":""}]}