{"id":"108788","name":"DataGenius Technologies LLC","tagline":"Innovative Mobile Apps and Software Testing","profile":"/profile/datagenius-technologies","website":"https://datageniustech.com","directory":"directory/mobile-application-developers","page":"61","verified":"","description":"DataGenius is an innovation leader in mobile apps, digital branding, voice applications and enterprise applications.\nWe are successful because we deliver for our clients simple, effective, powerful and best mobile apps for their company.\nOur state of the art and leading mobile apps have been driving success for our clients for many years.\nOur team consists of certified solution architects, cloud strategists, mobile app developers, automation testing engineers. And, most importantly we are proud to be surrounded by award winning UX/UI designers whose know how is simply the best in the industry. \nSince 2014, our mobile app development teams have delivered more than 600 mobile apps, web apps, enterprise applications and digital branding for some of the biggest companies out there.\n \nClient testimonials\nDigital marketing specialist, Fairway Independent Mortgage Corporation\n\"DataGenius Software has been a huge asset for our business. We look forward to continue our relationship with them\"\nExecutive VP of Competech Smartcard Solutions. Patient centric health IT solutions\n\"We needed a reliable partner with a track record in building scalable IT solutions. DataGenius since 2010 has been delivering for us.\"\n \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"33 Broad St","locality":"Providence","region":"RI","postal_code":"02903","country":"United States","phone":"7324848634"},{"headquarters":false,"address":"575 Wairakei Rd","locality":"Burnside","region":"","postal_code":"8053","country":"New Zealand","phone":""},{"headquarters":false,"address":"12 Boswell Place, Truganina, Vic-3029","locality":"Melbourne","region":"VIC","postal_code":"3029","country":"Australia","phone":""}]}