{"id":"111025","name":"Devathon","tagline":"Helping Businesses build Modern Software Products","profile":"/profile/devathon","website":"http://devathon.com","directory":"directory/mobile-application-developers","page":"22","verified":"","description":"Devathon delivers great products. We can design and develop products for web, mobile and wearable platforms. We cover all aspects of product building such as design, development and deployment. We work with funded startups, growing businesses and serious entrepreneurs. We have also worked with Enterprise clients on building modern offerings.\nWe promise a high quality, fast-paced and transparent experience. We have a modern engagement style – live dashboard, weekly demos, collaboration platform, etc. Our pricing is competitive. We are perhaps 60th percentile in pricing, but 99th percentile in quality and professionalism. You will enjoy working with us!\nWe have built software for companies backed by the world's leading investors like Betaworks, Greylock, Andreessen Horowitz, Accel, KPCB, Lightspeed and many more.\nThere are many success stories among the startups we have worked as technology partner with. For example:\nWe built Dote Shopping from scratch, took it from 0 to 25k DAUs before it went on to win the prestigious ‘Planet of the Apps’ & raised $7.2 million from Lightspeed Venture Partners.\nWe have worked as technology partners of Ideel, which was USAs top company in the space of flash sales of designer brands It had millions of users and had raised over $100MM before being acquired by Groupon.\nWe built the entire web layer for Bookish.com, which was a joint venture between Penguin, Hachette, Simon & Schuster.\nOur usual technology stacks:\nBackend - Ruby on Rails, NodeJS, AWS\nDatabases - MySQL, DynamoDB, NoSQL, PostgreSQL, MongoDB, Amazon RDS, etc.\nWeb Frontend - AngularJS, VueJS, ReactJS\nMobile apps - React Native, iOS (Swift), Android native\nVisit our website or drop us an email at hello@devathon.com\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"","locality":"Hyderabad","region":"","postal_code":"","country":"India","phone":""}]}