{"id":"111070","name":"Webtown","tagline":"Webtown - Liferay Platinum & eZ Advanced+ Partner","profile":"/profile/webtown","website":"https://www.webtown-group.com","directory":"web-developers","page":"30","verified":"","description":"Our goal is to MAKE DIGITAL EXPERIENCE HAPPEN.We're agile and we love working on agile projects with agile Partners (Yes, we usually have Partners, not simple customers and clients).We focus on developing products for our Partners instead of writing codes as coding monkeys.\nWe provide omni-channel digital experience to help the engagement with the brands and services of our Partners.Webtown is an agile software development company, we're living the agility, not just pretending it.Our crew of more than 60 employees has more than 15 years of professional experience.We deliver online products based on Liferay Digital Experience Platform (DXP) to provide unified customer experience, personalised contents, workflows and business logic.While Liferay DXP facilitates sales and marketing decisions, it remains an easy-to-integrate platform with current business critical systems. Trusted by well-known enterprises like MSCI, K&H Bank (KBC group), or Raiffeisen Bank, we’ve been creating excellent Liferay portals since 2010. We are proud of the fact that in 2015 we became the first Liferay Platinum Partner in the CEE region. Liferay is not only about DXP. It’s about the possibilities of a full-service digital experience, and based on this fact they have the most promising B2B eCommerce solution to serve the continuous flow of the economy and helping the analysis of the digital processes with Liferay Analytics Cloud.For those who manage a huge amount of content on a daily basis and need liable content scheduling & workflow management, we recommend the PHP and Symfony based, worldwide popular eZ Platform Enterprise. Media market players and communication professionals can create pages easily with its page editor, automate the flow of content and deliver content across channels & displays. Headless, or traditional, this CMS gives you the efficiency of content publishing.\nSpecialties:\nLiferay DXP, Liferay Commerce, eZ Platform, Java & PHP custom software development.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"Hauszman Alajos u. 3/b","locality":"Budapest","region":"BU","postal_code":"1117","country":"Hungary","phone":"+36 70 383 2359"},{"headquarters":false,"address":"Square One, Leopold Ungar Platz 2","locality":"Vienna","region":"WIE","postal_code":"1190","country":"Austria","phone":"+43 660 7628280"},{"headquarters":false,"address":"Fryderyka Joliot-Curie 26","locality":"Warsaw","region":"MZ","postal_code":"00-001","country":"Poland","phone":"+48 22 378 48 66"}]}