{"id":"111850","name":"December Labs","tagline":"Where human-centered UX/UI meets agile development","profile":"/profile/december-labs","website":"https://decemberlabs.com","directory":"web-developers","page":"13","verified":"","description":"At December Labs, we identify, design and develop innovative software solutions, applications, services and platforms.\nWith offices in San Francisco, Houston and Montevideo (EST), our team of 50+ top-notch Ph.D.'s, Architects, Researchers, PM’s, Strategists, Developers, and Designers specializes in creating vibrant, game-changing products through Mobile and Web Design & Development and harnessing the most avant-garde emerging technologies.\n \nAt December Labs, we are mission-driven, people-focused, applying startup-style customer development and agile engineering for new products and areas of business from concept to launch. We leverage your existing stack or analyze and recommend the best approach and solution for your needs.\n► Pixel-Perfect Design: From User-Flows, Lo-Fi & Hi-Fi Wireframes and Prototypes to polished slick end-products, we craft high-touch digital experiences that engage through our human-centered UX/UI approach.\n► Mobile Development: We specialize in experience-driven native apps for iOS and Android, coding in Swift, Objective-C, Java or Kotlin, as well as hybrid-platform frameworks such as React Native.\n► Full-Stack Development: From infrastructure to HTML, we develop data-driven Full-Stack applications using React JS, Node JS, Go Lang and Ruby on Rails, among others.\n► Emerging Technologies: We harness a wide array of emerging tech, such as AR/VR, AI technologies & Machine Learning, Blockchain and Computer Vision, pushing the boundaries of user experience across physical and digital.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2014","locations":[{"headquarters":true,"address":"1301 Fannin St #2440","locality":"Houston","region":"TX","postal_code":"77002","country":"United States","phone":"+1 (713) 397-6594"},{"headquarters":false,"address":"Jose Marti 3079","locality":"Montevideo","region":"MO","postal_code":"11300","country":"Uruguay","phone":"+1 (415) 644-5058"},{"headquarters":false,"address":"2 Embarcadero Center","locality":"San Francisco","region":"CA","postal_code":"94111","country":"United States","phone":"+1 (415) 644-5058"}]}