{"id":"112413","name":"Exaalgia","tagline":"#1 Ranked SEO and Web Agency by Best Firms USA","profile":"/profile/exaalgia-0","website":"http://www.exaalgia.com","directory":"web-developers","page":"102","verified":"","description":"Exaalgia is an award winning digital marketing company by Clutch, Goodfirms, Best Firms, 10SEOS, and more. We understand that every business is unique. That’s why our affordable solutions are customized and specific to your business needs. We spare no resources to ensure your website is beautiful and optimized precisely to Google’s known variables(200 different ones and counting!)\nOur experts have been optimizing clients with millions of search volume to the local business who can only handle a couple hundred.  We treat every client as a partnership, because choosing a digital marketing firm is creating a strong relationship that continues to grow with the business.\nBased out of Phoenix, AZ.  Exaalgia currently employs 50+ team members to deliver the award winning service we're known for.  The team was formed in 2009 with a focus of providing results, not traffic.  We want to see your sales numbers increase, not just the volume of people visiting your website.\nWe offer a customized strategy to fit every client we speak to.  We'll use a combination if tools and resources to form a plan to fit your business goals.  Give us a call today and let's talk about how we can help you!\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2009","locations":[{"headquarters":true,"address":"1111 N Gilbert Rd, Suite 212A","locality":"Gilbert","region":"AZ","postal_code":"85234","country":"United States","phone":"+1.480.536.8111"},{"headquarters":false,"address":"1111 N Gilbert Rd, Suite 212A Gilbert","locality":"Gilbert","region":"AZ","postal_code":"85234","country":"United States","phone":"+1-480-536-8111"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"","phone":""}]}