{"id":"112690","name":"AF.agency","tagline":"Creative technology to drive your business growth.","profile":"/profile/afagency","website":"http://af.agency","directory":"directory/mobile-application-developers","page":"76","verified":"","description":"Since 2004 we have successfully pushed the limits of creativity and technology to build highly effective digital products and services for modern brands. \nAF.commerce | AF.training | AF.production | AF.lab\nAF.commerce - We manage e-commerce sales and aftersales processes building consumer-brand relationships at online stores: Customer journey optimization, B2C/B2B platforms, E-merchandising, Content production, Analytics, Aftersales\nAF.training - Highly competitive and qualified employees build effective teams. We grow Your business using responsive learning and training tools: Learning platforms, RWD e-learning, Microlearning, AR, VR and MR, Gamification, Training videos, Webinars\nAF.production - We design and implement innovative dedicated platforms, mobile applications and websites that meet the highest technological requirements while maintaining the unique character of the brand: Strategy for building interactive products, Creation and UX, Implementation and development, Support\nAF.lab - A source of knowledge about motivation. We combine biometric research with neuromarketing and psychophysiological tests to get the best results in preparing marketing communication, sales content and e-learning methods: Emotional and cognitive responses, Research on the UX, A/B testing, Research on the engagement and attractiveness of the layout, Optimization of a conversion paths, Shopping motivation study, Customer’s journey analysis, Testing the effectiveness of a product cards, Research on the UX of e-learning materials\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"Wszystkich Świętych 4A","locality":"Poznań","region":"WP","postal_code":"61-843","country":"Poland","phone":"61 822 11 33"}]}