{"id":"113158","name":"New Moon Creative (formerly Flair Designs)","tagline":"We create websites and brands that empower purpose","profile":"/profile/new-moon-creative-formerly-flair-designs","website":"https://newmooncreative.co","directory":"web-designers","page":"11","verified":"","description":"My name is Leslie Tagorda, owner of New Moon Creative formerly FLAIR-Designs, and I partner with non-profits to transform their unique vision and mission into one-of-a-kind, tech savvy, elegant websites and brands that attracts clients, funders, volunteers, and change makers.\n\nAs an experienced art and creative director in web and brand strategy, I specialize in project management, client relations, and creative direction. My goal is to help effectively and efficiently guide your website and branding project from concept to launch, ensure clear communications between New Moon’s extraordinary development team and your organizations remarkable marketing and communications group, and deliver to your organization a dynamic, innovative, and stunning branding and online presence. \n★NEW MOON CREATIVE -DESIGNS SPECIALIZES IN:\n✰ Online Storytelling and Branding\n✰ Web design and Front-end web development\n✰ WordPress customization and back end development\n✰ Email marketing (audience engagement)\n✰ Social media strategy\n★WHAT DIFFERENTIATES NEW MOON CREATIVE-DESIGNS?\nWe strive for a high level of performance expertise with our dedicated work ethic and unique design philosophy. Our team will continuously strive towards excellence and not give up, until you are completely satisfied. \n★DESIGN PHILOSOPHY\nYour brand is a reflection of the soul of your organization, so through branding and design, NEW MOON CREATIVE will shine the best light on your mission, your clients, and inspire you to go forth and do what you do best. Our team will partner with you on this creative process by bringing fun and joy, and will work with you without limits to achieve the desired result - an effective, customized product that is uniquely you!\n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2004","locations":[{"headquarters":true,"address":"720 York Street","locality":"San Francisco","region":"CA","postal_code":"94110","country":"United States","phone":"415-322-9328"}]}