{"id":"11682","name":"Web Designer Houston","tagline":"Web Designer Houston","profile":"/profile/web-designer-houston","website":"http://www.webdesignerhouston.us","directory":"web-designers","page":"136","verified":"","description":"Houston Web Design (www.webdesignerhouston.us) is a website design company in Houston Texas with well trained and experienced staff to provide any types of designs to Clients in Houston and areas around. Web Design Houston offers award winning custom website design, website development and SEO services in Houston, Texas.\nWeb Design Houston rated as one of the Top 25 web design company in Houston Texas by the Houston Business Journal for the years 2008, 2009, 2010, 2011 and 2012. Web Design Houston is a top web design company in Houston, Texas USA. Our company is a full service web site design company providing all services such as website optimization, search engine submissions and promotion. Our motto is “One Company Many Services”.\nWe provides Custom Web Design, Flash Web Design, Ecommerce Web Design, Logo Web Design, Template Web Design, Blog Web Design, Mobile Web Design, Website Redesign, Graphic Web Design, Brochure Web Design, Catalog Design and 3d Graphics Design, Web Development Services, Custom Web Development, PHP Application Development, ASP Application Development, ASP.Net Development, Software Application Development, Custom Shopping Cart, Joomla Development and Customization, Iphone Application Development, Ipad Application Development, Android Application Development, Mobile Application Development, SAAS Application Development, WordPress Development and Customization, SEO Services, Keyword Analysis, Meta Tag Creation, Content Optimization, Link Building, Search Engine Submission, Email Marketing, Social Media Optimization, Google Ad-words, Online Marketing, Affiliate Marketing, Branding, Brand Building, Corporate Identity, News Letter Branding, CMS, Zen Cart Customization and Development, X-Cart Customization and Development, Drupal Customization and Development,\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"11152 Westheimer Road","locality":"Houston","region":"TX","postal_code":"77042","country":"United States","phone":"281.606.0474"}]}