{"id":"117078","name":"Mavin Apps","tagline":"Android and iOS Mobile app development company","profile":"/profile/mavin-apps","website":"http://www.mavinapps.com","directory":"directory/mobile-application-developers","page":"29","verified":"","description":"We are specialised in Mobile App, Web App and Game development. We have 30+ full time developers, who has worked on 100+ Apps on various technologies that include native apps, cross platform apps, responsive websites and games. \nWe are specialised in iOS and Android mobile app development, mobile game development using unity framework, Responsive websites creation using HTML5 framework, Angular, Web services development using Php/MySQL, Zend framework, ruby on rail, creating cross platform apps in MEAN STACK and Xamarin framework, Graphics design and animation.\nworked on apps with feature like\n-    Live Streaming – Audio & Video using both RTMP (Real Time Media Protocol) & RTSP (Real Time Streaming Protocol) \n-    Real time Chat with XMPP protocols \n-    SQLite and core data \n-    Have worked on APIs both SOAP & XML and REST & JSON \n-    GPS & Location based Services and various Google Apis like Google Places API, Google Maps APIs \n-    Push Notifications  \n-    Have integrated SMS based notifications using Twilio \n-    Social Media Integration with Facebook, Twitter, Tumblr, Flickr, Instagram, Google Plus \n-    Payment Integration with PayPal, Stripe, Apple Wallet and other Payment Gateway Service Providers \n-    Performance optimization \n-    Have integrated flurry Analytics, Google Analytics \n-    Have implemented Localization in Uber like Taxi Apps and Dating Apps \nWe deliver apps with high standards. UI elements will be accurate to pixel and app performance and memory usage will beat market standards.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"2/701, Pillariyar Kovil Street","locality":"Madipakkam, Velachery, Chenni","region":"","postal_code":"600091","country":"India","phone":"+91 909 424 8951"}]}