{"id":"128587","name":"Nilead Digital Marketing Solutions","tagline":"Digital Marketing Solutions That Actually Work","profile":"/profile/nilead-digital-marketing-solutions","website":"https://nilead.com","directory":"web-developers","page":"282","verified":"","description":"Nilead provides complete Digital Marketing solutions ranging from Bespoke Website Design to Sales and Automation tools.\nServices that we offer:\nWebsite design & development. Unlike others, we do offer REAL BESPOKE websites.\nWebsite hosting & maintenance. Everything is managed for you.\nWebsite management. We assist you in keeping your website fresh.\nContent planning and writing. We help you to reach more customers, create connection and trust via useful and personalized contents.\nSearch Engine Optimization & Search Engine Marketing. We help you get in front of the ones that matter.\nSocial Media Management & Social Media Marketing. We assist you in up-keeping your brand image as well as running targeted ads.\n \nOn top of that, Nilead is an advanced platform with:\nContent Management System. You can update your own website via the CMS.\neCommerce System. You can sell and collect payment for your products and services including online booking.\nCRM System. You can manage and connect with your customers easily. We help you to consolidate communication with your clients.\nSales System. Create deals, communicate to your clients, create quotation, sales orders with invoice, payment request, shipment creation.\nMarketing System. Follow up reminder, Newsletter, Email tracking, Canned responses, Email template, SMS, Customer Segmentation.\nAutomation System. automating repetitive tasks such as sending mails to clients that stopped giving work, alerting sales person if a deal is not progressing.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"17E Ho Hao Hon, District 1","locality":"Ho Chi Minh City","region":"","postal_code":"700000","country":"Vietnam","phone":"+84.90.847.89.07"}]}