{"id":"133826","name":"Pixxi Castle Digital Creative Agency","tagline":"We are creating experiences that transform brands,","profile":"/profile/pixxi-castle-digital-creative-agency","website":"http://www.pixxicastle.com","directory":"web-designers","page":"1332","verified":"","description":"AWARDED WORKS\nWe always aim to do the best for you.\nRIGHT TARGET\nPixxi Castle is a global brand strategy, design and experienced digital creative agency. Using facts, intuition and creativity, we blend imagination with art, unlocking the power of simplicity to help customers realize their full potential.\nFAST & STYLISH\nStylish and modern work that you can not find anywhere else. Your brand, in safe hands.\nPixxi Castle treats every single client’s business as if it were our own. We dive into your industry, the data, and own it. You’ll often hear shouts and whoops in the office when our designs finished. The bottom line is we are here because we love digital design world, are passionate about what we do. Our customers values our extraordinary reputation as a top digital marketing agency. If we doesn’t feel we can exceed your expectations; then we don’t take you on as a client. It’s that simple. Pixxi Castle is passionate, and proud to have founded One of the top rated digital creative agencies in the world!\nCREATIVE DESIGN/\nLogo, brochure, products catalogue, flyer, sticker and more..,\n2D-3D DESIGN & ANIMATION/\n2D/3D modelling & animation\nBRANDING & BRAND MANAGEMENT/\nDo you want to develop brands and new concepts? Branding & Brand Management provides you with strategic and creative skills within these fields.\n/INTERACTIVE & NITROPIXX® MEDIA\nInteractive CD/USB, Nitropixx® CD/USB\n/MOBILE APP\nMobile Game Programming & Mobile Business App\n/FILM PRODUCTION & VFX-SFX\nTV Shows, Promotional Film, TV Series, Advertising Film, Worker/ Visitors Safety Training Film...\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2001","locations":[{"headquarters":true,"address":"Nilüfer","locality":"Bursa","region":"","postal_code":"16140","country":"Turkey","phone":"902244522254"}]}