{"id":"13454","name":"TiCON System CO. Ltd","tagline":"Software Development & IT consultancy","profile":"/profile/ticon-system-co","website":"http://www.ticonsys.com","directory":"web-designers","page":"137","verified":"","description":"TiCON is an international software development company based in the South Korea & our R&D center located in Bangladesh. We employ highly qualified software development engineers in several countries; however, as a Korean registered company, we can provide our clients with the security and operational development framework they require.\nThe company was founded at the beginning of the millennium as a branch of TiCON by a team of enthusiastic IT specialists who wanted to overcome the routine and create a company that would act in the market not only for business success but for the sake of Technology itself. Thus, the mission of the company was defined – to contribute to forward-looking transformation of the society through software development.\nTiCON System Co. Ltd has established in the Year 2007 but it has been increasing highly for wide vision & roadmap for management people. TiCON values its integrity on working for the advantage of our clients, employees, and the community. Thus, creating better opportunities, improving excellence and flying high above the rest. TiCON has set very high standards for itself in customer care. Each and every client and project is given personal attention in terms of service quality\nFocusing Industry: Software Development, IT outsourcing, Consultancy\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"Level 6, House of Veritas, 8 Gareeb-e-Nawaz Ave,","locality":"Uttara","region":"DHA","postal_code":"1230","country":"Bangladesh","phone":"+8801713525654"},{"headquarters":false,"address":"#602-101 Sindo 10 CHA, 290 Yonghyeon Dong","locality":"Uijongbu","region":"","postal_code":"010-342","country":"South Korea","phone":"+821096281477"}]}