{"id":"138288","name":"Creatella","tagline":"Your Tech Partner for Web & Mobile App Development","profile":"/profile/creatella","website":"https://createl.la","directory":"directory/mobile-application-developers","page":"11","verified":"","description":"Creatella innovates at the edge between a startup incubator and a tech and marketing agency. Started in Singapore with European roots and remote collaborators from 15+ countries, Creatella is an ambitious, energetic startup aiming to penetrate untapped marketplaces and make the world more open.\nMission: We thrive in the challenging world of startups by imagining, building, and launching fresh products every year, and serving other startups with the tech and marketing skills they need to grow.\nCase Study\niDoo\niDoo allows you to professionally design and decorate a room in under a week. Starting with a personal style quiz, it profiles your tastes, space, and budget. Then, it matches you with a skilled interior designer who draws up a customized concept for your space. Once you agree with a concept, iDoo generates a shopping list and the rest is paint by number.\nTech\niDoo’s tech stack includes HTML, CSS, JavaScript, jQuery, MySQL, PHP, and Laravel. The platform incorporates a sophisticated 1 to 1 messenger system and dashboard for each project.\nResults\nAfter successfully working with Creatella to build the platform, iDoo is now live and available internationally. It's currently in its beta and building market traction.\nKEY FACTS\nCost Saved: 32K USD vs next best offer\nTime: 2.5 months\nGenerated revenue in 2 weeks\nFollowing the success of the tech development, Creatella is now iDoo’s marketing partner bringing both strategic guidance and execution\n1 week delay\n2 out of 20 projects so far have experienced a delay of 1 week or more. We’re transparent and don’t like BS\n\niDoo has been selected to receive extra assistance in raising funds using Creatella’s extensive investment network\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2015","locations":[{"headquarters":true,"address":"10 Anson Road #10-11 International Plaza","locality":"Singapore","region":"","postal_code":"079903","country":"Singapore","phone":"+65 8439 0459"}]}