{"id":"138738","name":"Crossfield Digital","tagline":"NYC's Local Dev Shop","profile":"/profile/crossfield-digital","website":"http://www.crossfield.com","directory":"directory/mobile-application-developers","page":"42","verified":"","description":"Crossfield is a digital agency that provides web and mobile software development, creative and product strategy services.\nCrossfield began as a mobile gaming start-up called PrePlay, which developed web and mobile applications that enabled sports fans to make predictions about every play of every game. PrePlay was the #1 live sports prediction game from 2010-2015 and spanned across professional baseball, football, hockey and tennis. Over that time, our users made over 50 million predictions across all of our applications. JOINING A NEW TEAM PrePlay was acquired by FanVision Entertainment (FVE) in September of 2014. FVE added PrePlay’s management and software expertise to further deliver on its mission to enhance the spectator experience. THE TRANSITION FanVision Entertainment is one of a portfolio of companies within the Related Sports and Entertainment (RSE) Ventures family of companies. When sister company Relevent Sports, the operators of the International Champions Cup, called us about developing their new website, the transition from mobile gaming experts to work-for-hire software development agency began.\nAfter launching the International Champions Cup site and signing Bleacher Report as a partner for its March Madness Bracket Challenge Game, we set out to rebrand the agency to reflect our broader range of capabilities. Prediction gaming (including live prediction, bracket and streak games) remains a core competency, but we built a team that has decades of combined creative, development and digital strategy experience that spans far beyond gaming. PrePlay as a self-published product was shut down, and Crossfield Digital, the agency, was born in October of 2015.\nSpecialties:\nTech, Strategy, Web development, Mobile Development, UI/UX Design, Corporate branding, WordPress, Ruby on Rails, React Native, Elixir, Content Management Systems, Gaming, Ticketing, Sports Data, E-Commerce, and Bracket Games\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"33 W 17th St suite 901","locality":"New York","region":"NY","postal_code":"10011","country":"United States","phone":"212.242.2693"}]}