{"id":"13995","name":"Dito","tagline":"We've Built Our Business on Google Apps","profile":"/profile/dito","website":"http://www.ditoweb.com","directory":"it-services","page":"10","verified":"","description":"Dito is one of the original 30 hand-picked Google Apps Authorized Resellers.  We were selected because of our early expertise with Google Apps.  That was 2008.  Since then, Dito has continued to evolve with Google's cutting-edge cloud solutions, becoming a launch partner for each of Google's expansions into enterprise solutions.  \nWe are currently hold the following partnerships with Google: Google Apps Premier Enterprise Reseller, Google Apps Premier SMB Reseller, Chrome OS Reseller, & Google Cloud Platform Partner. It should come as no surprise that we have developed close relationships with Google's Enterprise teams as a result of our success helping many customers, like Clark Construction, adopt Google Apps.\nAs a result of working with hundreds of organizations, we have developed industry expertise in multiple verticals: Construction & Trades, High-Tech & Internet, Manufacturing, Real Estate, & Retail.  Because of this experience, we have a deep understanding of the benefits of Google Apps in these industries.  \nDito is a fully distributed and mobile team, with \"ditomites\" located across the United States.  While most ditomites are located in the Mid-Atlantic, we have local representation in major metropolitan areas including Washington DC, Philadelphia, Chicago, Atlanta, Dallas, Los Angeles, & San Francisco.  Dito has years of experience with remote and on-site technology deployments.  Our services and teams are flexible to our customers needs regardless of where they are located.  We've helped customers Go Google in over 15 countries.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"9913 Sugarwood Lane","locality":"Manassas","region":"VA","postal_code":"20110","country":"United States","phone":"855.937.3486"},{"headquarters":false,"address":"","locality":"Washington","region":"DC","postal_code":"20001","country":"United States","phone":""}]}