{"id":"141029","name":"Arvaan Technolab","tagline":"Providing customized IT solutions","profile":"/profile/arvaan-technolab","website":"http://www.arvaantechnolab.com","directory":"directory/mobile-application-developers","page":"25","verified":"","description":"Arvaan Technolab is a dynamic mobile and web solutions offering organization. Our vision is to give our worldwide clientele with an unparalleled service through our bespoke Web and Mobile Application Development.\nWe are using agile model and follow complete software development life cycle steps for application as well as website development. Quality for us at all levels is our elite concern. We are concentrated to commence and take all required steps to preserve and cherish quality in satisfying requirements of our valued customers.\nWe are tech crunchers and we work on all the advanced technologies: \nMobile: Native Android, Native iOS, and Cross Platform technologies including: Ionic, Cordova, PhoneGap and Appery, as well as various 3rd party integrations for mobile apps like Jumio-OCR SDK, Face recognition SDK, Fabric, Mix panel, payment gateway integration stripe and Braintree, Radio SDK and Yelp, GCM, iMessages keyboard app development, and peripheral programming with IOT. \nWeb: Core PHP, Codeigniter, Slim framework, REST API development, Yii, Symfony, Laravel, SSL integration and AWS cloud management, Professional admin panel development, analytics SDK integration like Mix panel, App Flyers, and Google analytics, Customized web product development like job portals, HR portals, and Dynamic payroll management systems.\nWe have developed several applications in native as well as PhoneGap based on functionalities like third party API integration like Radio kit, database linkages from other websites, location-based applications, GPS trackers, augmented reality & virtual reality, and wear apps for iWatch and Android. \nAlways expecting a strong handshake with all of our customers as we have our customer's satisfaction as the priority.\nThanks,\nArvaan Technolab\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"B 404, Shapath IV, Opp Karnavati club, S G Highway","locality":"Ahmedabad","region":"GJ","postal_code":"380015","country":"India","phone":"9825603830"},{"headquarters":false,"address":"4920 Niagara Road, Suite# 301","locality":"College Park","region":"MD","postal_code":"20741","country":"United States","phone":""}]}