{"id":"141021","name":"KNOWARTH Technologies Pvt. Ltd.","tagline":"KNOWARTH - Delivering Excellence","profile":"/profile/knowarth-technologies","website":"https://www.knowarth.com","directory":"directory/mobile-application-developers","page":"363","verified":"","description":"KNOWARTH is one of the fastest growing IT solutions Company with a strong commitment of \"Delivering Excellence\". We are delivering highly-customized IT solutions to Startups, small and medium businesses, enterprises, and Fortune 500 companies for their business requirements. \nWith a combined experience of over 80 years in technology development and 180+ strong IT professionals working with global clients in USA, UK, Australia, UAE, Canada and Europe. We have extensive experience in various verticals like telecom, healthcare, finance, insurance, media etc. Our comprehensive knowledge and expertise includes but not limited to Service Oriented Architecture, Open Source Portal Consulting, Enterprise Content Management, Business Intelligence, Big Data, Enterprise Portals, E-Commerce and Cloud Computing. \nOur offices in USA and delivery center in India strive to serve customers with their on-demand project development requests. We have served over 100+ clients with their varying needs and retained them with our services. Our teams handle all projects with equal zeal and achieve optimum output from the project. \nOur certified resources in Magento, Liferay, AWS and other technology platforms help us beat the competition with their work in digital solutions market for Web, Mobile and Portal projects.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2014","locations":[{"headquarters":true,"address":"11, Aryan Corporate Park, Nr. Shilaj Railway Crossing, Thaltej","locality":"Ahmedabad","region":"GJ","postal_code":"380059","country":"India","phone":"+91 79 6617 3708"},{"headquarters":false,"address":"One Commerce Center, 1201 Orange Street #600,","locality":"Wilmington","region":"DE","postal_code":"19899","country":"United States","phone":"+1 803 767 4034"},{"headquarters":false,"address":"IT/ITES SEZ, Village Chharodi - Tragad, Taluka Dascroi","locality":"Ahmedabad","region":"GJ","postal_code":"382470","country":"India","phone":""},{"headquarters":false,"address":"B319, 4th Floor, Eastern Business District, L.B.S Marg, Bhandup West, Ganesh Nagar, Bhandup West","locality":"Mumbai","region":"GJ","postal_code":"400078","country":"India","phone":""}]}