{"id":"141271","name":"InApps Technology","tagline":"Realize Your Ideas","profile":"/profile/inapps-technology","website":"https://www.inapps.net","directory":"directory/mobile-application-developers","page":"7","verified":"","description":"We are InApps Technology Company. Established in 2016, we have continually evolved over the past years to reach to the forefront of being a leading software development outsourcing company in Vietnam.\nOur expertise in:\n- Full Lifecycle Software Ecosystem and the Full-stack Development using the latest technologies.\n- Mobile App Development, developing native iOS, Android, mobile hybrid apps.\n- Web App Development\n- Offshore Development Centre (ODC)\n- Quality Assurance\n- UX/UI Design\n- IT Staff Augmentation\nWe work across the entire lifecycle of taking an idea to market with ideation, validation, product strategy, engineering, ongoing maintenance, and growth. We partner with Start-ups and SMEs globally to help them solve their toughest challenges, mitigate the risks and bring their great ideas to life.\nOur dignified niche is mobile app development. We have worked with clients from the USA, Australia, and Singapore to develop world-beating apps. We are a High-ranking Application Development Outsourcing Company in Vietnam.\nWe provide offshore software development services to help international clients increase their software development capacity and efficiently turn their ideas into working products, in terms of cost-effectiveness and low attrition.\nOur Dedicated Software Development Team of experienced engineers is at your service to design and develop high-quality technical solutions at any level of complexity.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2016","locations":[{"headquarters":true,"address":"288 Pham Van Hai, Tan Binh","locality":"Ho Chi Minh","region":"HC","postal_code":"700000","country":"Vietnam","phone":"84906330450"},{"headquarters":false,"address":"108 St Georges Terrace","locality":"Perth","region":"WA","postal_code":"6000","country":"Australia","phone":"610894674124"}]}