{"id":"141556","name":"Redpath Consulting Group","tagline":"Salesforce | Marketing Automation | Strategy","profile":"/profile/redpath-consulting-group","website":"http://redpathcg.com","directory":"it-services","page":"15","verified":"","description":"We are a Minnesota based Salesforce Silver Partner that specializes in mid-markets & nonprofits with their sales, marketing, customer service, and development needs. We've spent 50,000 hours helping over 250 organizations gain an unfair advantage with CRMs and Marketing Automation. \nThe hallmark of a successful project is to maintain focus on the business problem to be solved. To minimize scope creep and deliver timely functionality. Our Plan, Analyze, Design, Build, Validate, and Deploy methodology ensures your success.  Our methodology also allows our certified Salesforce.com consultants to be flexible and agile, while delivering on your unique business requirements. If you can dream it, we can build it.\nProfessional Services include:\n• \"Path to Success\" (Define your CRM strategy, success metrics and roadmap)\n• Implementations (Sales Cloud, Service Cloud, Marketing Cloud, Community Cloud, App Cloud, Pardot) \n• Enhancements (data quality, apps, integrations, AppExchange Apps)\n• Marketing Automation strategy & execution (Pardot & Marketing Cloud)\n• Managed Services (on demand support, system admin)\n• Custom Development (Visualforce, Apex, Lightning App Builder)\n• Training (documentation, training plans, training delivery, train-the-trainer)\nWe serve local, national & global customers Minneapolis, Minnesota | Sioux Falls, South Dakota | Fargo North Dakota | Milwaukee, Wisconsin | Chicago, Illinois | London United Kingdom.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"1011 S Washington AVE, Suite #350","locality":"Minneapolis","region":"MN","postal_code":"55415","country":"United States","phone":"+1.6128433360"}]}