{"id":"142000","name":"The Lead Agency","tagline":"Making Conversations Make Great Sales","profile":"/profile/lead-agency","website":"https://www.leadagency.com.au","directory":"seo-firms","page":"559","verified":"","description":"THE LEAD AGENCY: MAKING CONVERSATIONS MAKE GREAT SA\nOur B2B marketing consultants help our clients to accelerate sales and increase the quality of leads and new sales opportunities. Our services include B2B marketing strategy development; lead generation, lead management and nurturing; marketing automation; digital marketing; content marketing; and referral marketing.\nWe specialise in the unique B2B marketing services landscape: where purchasing decisions are often a complicated and considered purchase with long lead-times.\nEFFECTIVE B2B MARKETING\nWhether you employ sales specialists or your production/technical team also engage in sales, they both have a long and complex sales cycle to navigate to a very targeted audience. You need to find these select buyers and make sure they regularly engage with your company and staff: to remember you, to understand you, and to choose your service because they know your business.\nOur aim is to bring the Sales and Marketing functions of your business closer together through Sales Enablement. Our marketing consultants focus on providing more leads for your business AND, better quality leads for your business.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"Level 4, 96 Wellington Parade","locality":"East Melbourne","region":"VIC","postal_code":"3002","country":"Australia","phone":"+61.0408 002 684"},{"headquarters":false,"address":"Level 12, 189 Kent Street","locality":"Sydney","region":"NSW","postal_code":"2000","country":"Australia","phone":""},{"headquarters":false,"address":"Level 2, 476 St Kilda Road","locality":"Melbourne","region":"VIC","postal_code":"3002","country":"Australia","phone":""}]}