{"id":"142495","name":"FreshCode","tagline":"Web Development | BI | Hadoop","profile":"/profile/freshcode","website":"https://freshcodeit.com","directory":"web-developers","page":"6","verified":"","description":"FreshCode, a software development company, is here to make your ideas happen. 60+ highly skilled programmers and managers will make development process for you as smooth as possible. You can easily rely on our experience and expertise in development and maintenance of small and big solutions for clients all over the world including USA, Australia, Denmark, Israel, Germany, Russia, etc.\nWorking with us, you will get full-stack development of applications of all sizes and their functionality depends only on your imagination, because you hardly can ask for that we cannot accomplish. Apart from development, you can take advantage of maintenance services for your software and websites. Moreover, the quality of your product will be ensured by automated, unit, functional, stress, usability user interface, and compatibility testing. You are not restricted by technologies and solutions, and can choose whatever you want.\nLanguages: Java, Clojure, Ruby, C#, JavaScript, TypeScript, HTML5/CSS3;\nJava Frameworks: Spring (AOP, MVC, Security), JFS (Richfaces, Openfaces), JSP, Java Servlets, ORM (Hibernate, Ebean, iBATIS), GWT, Java FX;\nFrontend Frameworks: jQuery, AngularJS, Node.js, Meteor.js, Express.js, React.js, Redux, Bootstrap, Less, Sass;\nRuby stack: Ruby on Rails, Cucumber, Rspec, Capybara;\n.NET Platform: C#, F#, ASP.NET (WebForms, MVC, WebAPI), ORM, WCF, WinForms, WPF, Entity Framework.\nDatabases: MySQL, PostgreSQL, MS SQL, SQLite, MongoDB, Redis, Hbase, Hadoop, OpenTSDB, Cassandra, Spark, Lucene, Elasticsearch, Solr;\nPlatforms: Linux, MacOS, Windows;\nMobile Development: iOS (Swift, Objective-C), Android, Xamarin\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2014","locations":[{"headquarters":true,"address":"","locality":"Zaporizhzhya","region":"ZA","postal_code":"69000","country":"Ukraine","phone":"+380 96 588 02 89"}]}