{"id":"14255","name":"Systematix Infotech Pvt. Ltd","tagline":"Digital X'perience Partner","profile":"/profile/systematix-infotech","website":"http://www.systematixinfotech.com","directory":"directory/mobile-application-developers","page":"30","verified":"","description":"At Systematix, we believe in building applications that help companies lead the way forward. Since 2005, we have delivered over thousand projects to our customers across US, UK, Australia, Dubai and Singapore.\n \nAs the name suggests, we are inspired to approach any development project systematically providing transparency and clarity to the customer in execution. With over 250+ resources across spectrum of advance technologies, we are geared to be a full-stack technology partner in your growth journey. We offer you flexibility of various engagement models to suit to your business need. We are a CMMI Level 3 appraised, ISO 9001:2015 certified, Nasscom and CRISIL member company having below certifications:\n \nGoogle Certified Partner\nAWS Implementation Partner\nMicrosoft Gold Partner\nKentico Gold Partner\nDataStax Partners\nCertified Power BI\nRely on us for Mobile, eCommerce, CMS, ERP, CRM, POS, Business Intelligence, AI or ML application development delivered in compelling UI/UX. The technology deck includes- iOS, Android (Hybrid/Native), JavaScript Suite, Microsoft Suite, PWA, Magento, WordPress, Drupal, Joomla, Power BI, Tableau, Python.\nKeen on building next application, reach out to Systematix\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"250 - 999","founded":"2005","locations":[{"headquarters":true,"address":"11336, Ardrey Crest Dr, Charlotte, NC","locality":"Charlotte","region":"NC","postal_code":"28277","country":"United States","phone":"+1 713 701 5311"},{"headquarters":false,"address":"120 Lower Delta Road, #09-06 Cendex Centre, Singapore","locality":"Singapore","region":"","postal_code":"169208","country":"Singapore","phone":"+65 6692 9033"},{"headquarters":false,"address":"Plot No 67, PU-4 Commercial Behind C21 Mall, A B Road Indore","locality":"Indore","region":"MP","postal_code":"452010","country":"India","phone":"+91 731 2570281"}]}