{"id":"144460","name":"Richmond & Towers","tagline":"Best people in PR","profile":"/profile/richmond-towers","website":"http://rtc.london","directory":"agencies","page":"314","verified":"","description":"Welcome to Richmond & Towers – the home of award-winning PR and content.\nBased in Central London, we’re a 28-strong team, with one goal in mind: yours!\nSpecialising in food, drink and lifestyle, we spend each and every day delivering consumer, B2B and corporate campaigns that make a real difference.\nOur media and influencer campaigns are multi award-winning, and our clients stay with us for years; proof that we’ll work exceptionally hard to get the right people thinking, talking, writing, snapping and posting about you.\nAnd when it comes to keeping you out of the spotlight, instead of in it, our battle-hardened brand reputation management team are the only people you’ll want in the trenches with you!\nWe love working with challenger brands, the biggest in the business and all those in between, and our consultants are experts in brand building, PR, social media, digital, content and reputation management.\nWe believe that content is king, and our success together will be based on how we tell your story, in words, images and events. So our strategies and creativity will always be fiercely focussed on delivering content that impacts your bottom line.\n \nWhen asked what they love about us, our clients are unequivocal – they love the people at R&T, they love our creativity, and they love the fact that they can trust us to get the job done.\nRead on to discover more about what we do, who we do it for and how we do it, and maybe you’ll find something to love about us too.\nWe don’t want to be your supplier; we want to be part of your marketing team, so let’s get cracking and tell your story.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1930","locations":[{"headquarters":true,"address":"The Tapestry Building 51-52 Frith Street","locality":"London","region":"","postal_code":"W1D 4SH","country":"United Kingdom","phone":"+44 (0)20 7388 7421"}]}