{"id":"147","name":"Xm Software Solutions Pvt Ltd","tagline":"Where quality drives technology","profile":"/profile/xm-software-solutions","website":"http://www.xmsoftware.co.in","directory":"web-developers","page":"147","verified":"","description":"XM Software Solutions Private Limited, aims to deliver business excellence, supported through a complete suite of shared services.\nIncorporated in the year 2006 under the laws of India, we provide extended support services to our associate companies of the UAE Exchange Group.\nWe have evolved into a shared services centre, offering a wide range of multi-functional expertise that are designed to provide integrated, innovative solutions for business meeting the operational and technology needs of our associate companies world-wide.\nThe engine that drives our growth and performance is made up of our people. This strong group of 700 plus nurtured and empowered talent are based across different centres of excellence in India, serving our associate companies worldwide.\nWhat sets us apart from our contemporaries is our passion for service excellence, innovative solutions, portfolio of best practices, thorough understanding of scalability, quality of execution and commitment to consistent customer delight.\nThese continue to be the key drivers of success in our progressive journey so far.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"New Indian Express Building, First Floor Kaloor,","locality":"Kochi","region":"","postal_code":"682 017","country":"India","phone":"+91 484 304 7072"},{"headquarters":false,"address":"‘A’ South Wing, First Floor Central Square 1, C–28 – C–35 Cipet Road, Thiru–Vi–Ka Industrial Estate Guindy,","locality":"Chennai","region":"","postal_code":"600 032","country":"India","phone":"+91 44 3046 4899"},{"headquarters":false,"address":"","locality":"Bengaluru","region":"","postal_code":"","country":"","phone":""}]}