{"id":"149530","name":"FRSecure","tagline":"Information Security Experts","profile":"/profile/frsecure","website":"https://frsecure.com","directory":"it-services","page":"2","verified":"","description":"FRSecure is a full-service information security management company  that protects sensitive, confidential business information from unauthorized access, disclosure, distribution and destruction.\nInformation security is not a one-size-fits-all as others would lead you to believe. FRSecure works hard to assess your most significant vulnerabilities (information security assessment), put a plan together for managing those risks (information security roadmap), and helps you execute that plan (information security program development).\nWhat makes FRSecure different?\nFRSecure Methodology – FRSecure has developed a proprietary approach to assessing information security risks. It’s more than a checklist of questions and recorded answers. Get a full picture of your risks – prioritized and rated – with recommended solutions, so you know which investments will have the greatest impact.\nFRSecure Project Leaders – Our project leaders possess years of real-world information security experience assessing and building security programs from the Fortune 100 to SMBs.\nFull Transparency – FRSecure strongly believes in empowering our customers. The more knowledge transfer that occurs during our engagement, the more value our customers recognize. FRSecure fully discloses the methods, tools, and configurations used to perform analysis work for our customers, so that they can easily adopt our processes for their benefit.\nProduct Agnostic, On Purpose –FRSecure does not represent any third-party products or services. Our recommendations stand on their own, with no ulterior motive to sell you other things.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"5909 Baker Road, Suite 500","locality":"Minnetonka","region":"MN","postal_code":"55345","country":"United States","phone":"877-393-8546"}]}