{"id":"149806","name":"OKD Marketing","tagline":"A Full-service, Fully Integrated Marketing Agency","profile":"/profile/okd-marketing","website":"http://okd.com","directory":"web-developers","page":"66","verified":"","description":"Attention grabbing\n\nThe new currency for marketers is “attention”. Consumers’ attention is at a premium as we get bombarded with thousands of messages each day. The combined efforts of OKD and MJM ensure clients have a sound strategy for reaching their consumers, and a compelling message that will get their attention... on television, radio, or their mobile phone.\n \nFull-Service agency in a digital world\n\nOKD is more than a digital agency, we are a Full-Service agency for the digital world. We can deliver a strategy that truly puts the client first, because we are platform agnostic, and have a team of diverse digital experts. All our strategies lead to a measurable interaction, and we use the data to optimize future activities.\nThe OKD Marketing Group is a fully integrated marketing and advertising agency based in Burlington, Ontario with offices in Calgary Alberta and Hamilton Ontario. Our team of 60 talented employees can develop the strategy, produce the content, distribute the content over any platform, and measure/analyze/report on the results. We serve more than 100 active clients across a variety of diverse industries, and our work is seen across Canada and the United States. OKD was established in 1981, and today we are a $20mm company that has doubled in size since 2014 and plans on continued growth.\nAt OKD we continually improve our capabilities and offering, and we are proud to announce our acquisition of MJM Media. MJM Media is recognized as a leader in the Canadian audio and video production industry, and have been an establishment in the Hamilton community for more than 30 years.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"1981","locations":[{"headquarters":true,"address":"3375 North Service Rd, A12-15,","locality":"Burlington","region":"ON","postal_code":"L7N 3G2","country":"Canada","phone":"905.632.8850"}]}