{"id":"152467","name":"Thug Design","tagline":"We make great experiences based on user insights","profile":"/profile/thug-design","website":"http://www.thugdesign.com","directory":"web-designers","page":"489","verified":"","description":"Thug Design is a user research, experience design, and product development consulting firm focused on helping customers shape new ideas, technology, and products. Thug designs and develops products for the most valuable brands in the world. We understand the challenges large bureaucratic corporations face when it comes to innovation. We’ve structured our practices and methodologies to help teams break free of the red tape and create products that resonate with end users.\nThug has perfected a unique brand of the holistic product lifecycle. At any step along the journey our research and design, efficient and agile development process, and accurate, measurable, and repeatable validation helps our customers stay on the charts.\nWe specialize in qualitative and quantitative research. Our multidisciplinary team of ethnographers, human factors engineers, and usability specialists focus on understanding user behaviors, needs, and motivations to help shape experiences for emerging technology.\nOur customers come to us when they have new ideas or new technologies looking to go beyond the obvious. With a mix of future-casting methodologies, primary and secondary research, and product ideation, Thug offers a structured framework that looks at business needs, user needs, and technology constraints to pursue innovation.\nWe test the anticipated, actual, and remembered experience to uncover the emotional factors that matter most. We know behavior so you can avoid product experiences that exhaust and undercut brand loyalty.\nWe center on the human behavior, interaction patterns, and navigation models that make products usable. We help you design products as they ought to be. Satisfying.\nWe’ve defined parameters and principles that make up universal UX and design. It’s more than look and feel. It’s a purpose and attitude. Our design brings a special harmony to your product.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"2189 NW Wilson St.","locality":"Portland","region":"OR","postal_code":"97210","country":"United States","phone":"503-213-4370"}]}