{"id":"152734","name":"Geeks Ltd","tagline":"Dependable Tech Partner for Ambitious Businenesses","profile":"/profile/geeks","website":"https://www.geeks.ltd.uk","directory":"directory/mobile-application-developers","page":"25","verified":"","description":"At Geeks, we continuously challenge the status quo and re-define software development to make it more automated, faster, more reliable, smarter and more fun. We empower our clients to imagine more and innovate more. We work closely with them and use our sharp minds, unparalleled skills and can-do attitude to create amazing software concepts.\nOur mission at Geeks is to be the Dependable Technology Partner for Ambitious Businesses, and through that, help make life better for everybody.\nWe have worked as technology partner across different sectors including the Houses of Parliament, BBC, Royal College of GPs (RCGP), HMV, Euromoney, Harrods, Easyjet, Council of Europe and hundreds of SMEs.\nMost of the projects that we take on are:\nTech maturity assessment and developing Tech Strategy Plan that is in-line with your business plans\nRequirement & scope Analysis and prototyping\nSoftware development and maintenance\nComplex & bespoke process efficiency solutions\nSystems integration design and development\nApplication of emerging technologies in business\nOur clients choose us because we can deliver complex software systems that help them to be a leader in their market; thanks to our brilliant team, and the array of innovative technologies which we have won many awards for, including the \"Queens Awards for Enterprise: Innovation\"​.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2007","locations":[{"headquarters":true,"address":"66a London Road Morden Greater","locality":"London","region":"","postal_code":"SM4 5BE","country":"United Kingdom","phone":"+44 (0) 203 507 0033"},{"headquarters":false,"address":"","locality":"Sutton","region":"","postal_code":"","country":"United Kingdom","phone":""}]}