{"id":"153211","name":"tonik","tagline":"Making things happen","profile":"/profile/tonik","website":"http://tonik.pl","directory":"web-developers","page":"123","verified":"","description":"Hey there!\nWe're well-knit design studio heavily focused on user experience. We understand that each project is an investment, and as such should yield a high ROI return. That's why we're not just focused on making the visual layer aesthetically pleasing, but always look for ways to improve the conversion rate, or explore different monetization approaches, to make sure the product works well, both for you and its users.\nOur services can be boiled down to:\nUX/UI Design for mobile & web\nBranding\nFront-end development, including WordPress-related services\n \nOur process\nWe start with a brief discovery process, gathering information about the goal of the product and the needs of its users. Once that is settled we move on to the functional layer, providing wireframes focused on the UX and outlining all the user flows. Then, the visual layer – if the product is a part of an existing brand, we deliver a design that's entirely consistent with the brand guidelines. If it's something new, we're happy to experiment, having in mind the style needs to appeal to your target demographic.\nWe’re also big fans of Google's \"Design Sprint\" process (gv.com/sprint) and had lots of success implementing it in our workload.\n \nTools of Trade\nWe design in Sketch (recently moved away from Photoshop, although we still can deliver .PSD files if needed), we're using Invision for the feedback process, and hand–off assets via Zeplin or Avocode. For project management and time tracking we're using ActiveCollab, although we're happy to adapt to your software. Communication wise, it’s entirely up to you - from traditional emails, to Slack and Skype calls.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"","locality":"Poznan","region":"","postal_code":"","country":"Poland","phone":"+48.781.193.47.57"}]}