{"id":"15386","name":"Merixstudio","tagline":"Custom software development | web | mobile | UX/UI","profile":"/profile/merixstudio","website":"https://www.merixstudio.com","directory":"directory/mobile-application-developers","page":"12","verified":"","description":"We are a full-stack team of 120+ experts who build complex digital products for clients worldwide looking to outsource software development to professionals.\n \nMerixstudio’s key expertise is the delivery of high-quality and performant web applications and cross-platform mobile apps. Based on the needs of our clients, we can support them in end-to-end product development or seamlessly extend their in-house team of engineers.\n \nOur tech stack is focused on JavaScript (Angular, React, Node.js), Python (Django, Flask), PHP (Symfony, Laravel), and cross-platform frameworks (React Native, Flutter). We also provide fully-fledged support throughout the whole project’s lifecycle that covers project management, quality assurance, and product design services.\n \nMerixstudio collaborates closely with international companies of any size, from global brands such as GS1, Volkswagen, The Independent, Toshiba and HSBC to successfully scaled startups like Moneyfarm, Sendinblue and Burrow, a Y Combinator-incubated company.\n \nOur clients recognize us as a one-stop software development company with the ability to create a long-term design and development partnership. In return, we give them the best quality that stems from working with top-tier talents. We seek, recruit and develop the brightest engineers and designers locally creating an outstanding workplace for them. Check it out for yourself!\n \nFor more information regarding skills, agile teams’ capabilities and engagement models, please go to www.merixstudio.com\n \nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"1999","locations":[{"headquarters":true,"address":"Poznan, Malachowskiego 10","locality":"Poznań","region":"WP","postal_code":"61-129","country":"Poland","phone":"0048570001928"},{"headquarters":false,"address":"3537 36th Street Astoria","locality":"New York","region":"NY","postal_code":"11106","country":"United States","phone":""},{"headquarters":false,"address":"115 Mare Street","locality":"London","region":"LND","postal_code":"E8 4RU","country":"United Kingdom","phone":""}]}