{"id":"15499","name":"RebelDot","tagline":"End-to-End Software Development Company","profile":"/profile/rebeldot","website":"https://rebeldot.com","directory":"directory/mobile-application-developers","page":"27","verified":"","description":"Having worked with Fortune 500 Companies and as a top web & mobile development company, RebelDot creates top-notch digital experiences for startups and enterprise-level businesses around the world. With vast experience in over 15 industries, we aim to become your digital partner, understand all layers involved in your business, then lead the line towards a thriving digital product.\n \nOur end-to-end product development process takes you from the idea stage, all the way to launching your product. We pay attention to what people love and work with you to create human-centric & purpose-driven experiences for your clients, covering Product Strategy & Tech Advisory, UI/UX Design, Web & Mobile Development, Blockchain and Machine Learning.\n \nTogether, we are a cross-functional proficient team of designers, engineers and product strategists transforming knowledge and years of experience into ground-breaking experiences.\n \nWe believe that software development is more than coding, which is why we pay great attention to our relationship with you, asking the right strategic questions, optimising costs, delivering on time and making sure the solution we tailor matches a real market need.\n \nOne more thing - our job is never really done. We work with you to continuously improve and adapt the product even after launch.\n \nReady to meet us?\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"1 Buftea Street, 2","locality":"Cluj-Napoca","region":"CJ","postal_code":"400606","country":"Romania","phone":"0749993993"},{"headquarters":false,"address":"28E Nufarului Street","locality":"Oradea","region":"","postal_code":"410583","country":"Romania","phone":""},{"headquarters":false,"address":"Langelinie Allé 47","locality":"Copenhagen","region":"","postal_code":"2100","country":"Denmark","phone":"+45 3136 5676"},{"headquarters":false,"address":"Dorpstraat 68 A","locality":"Leende","region":"","postal_code":"5595 CJ","country":"Netherlands","phone":"+40 (0)749 993"}]}