{"id":"15522","name":"Verbat Technologies","tagline":"We Engineer Your Digital Success","profile":"/profile/verbat-technologies","website":"http://www.verbat.com","directory":"directory/mobile-application-developers","page":"83","verified":"","description":"Verbat is a Digital Technology Services company with over 15 years of experience in delivering Internet and Mobile Solutions to Enterprises, through Agile Development and Application Management methodologies. Our primary expertise is in Microsoft, Open Source, Mobile and Cloud Technologies. This lends itself naturally to a focus on today’s digital world and its need for technology development and support services.\nWe leverage our Innovation Ecosystem to bring disruptive thinking to next-generation Digital Technology Services and Products for enterprises across Retail and Manufacturing, Travel and Transportation, Financial Services and Emerging Verticals. As a mid sized partner with scale and depth to deliver a range of technology services, we bring our \"A\" team to our clients with the right levels of attention and agility in a spirit of true partnership, which clients are looking for.\nOur tried and tested delivery model leveraging India based Offshore Software Development Services provides our clients with the right mix of cost efficiency, operational control and flexibility. Our clients value the attention and intent shown by our teams, focussed on adding true value as a long term, trusted partner.\nVerbat provides its Digital Technology Services to customers across the globe via its offices in the USA, UAE and India.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1999","locations":[{"headquarters":true,"address":"217, Shk. Rashid Building, Hor Al ANZ","locality":"Dubai","region":"","postal_code":"56272","country":"United Arab Emirates","phone":"+971 42973236"},{"headquarters":false,"address":"Level 3, PTC Grandeur, Nanthancodu","locality":"Thiruvananthapuram","region":"","postal_code":"686102","country":"India","phone":"+91 471 6003295"},{"headquarters":false,"address":"","locality":"Quilon","region":"KL","postal_code":"601021","country":"India","phone":""}]}