{"id":"15647","name":"Net Solutions","tagline":"Award Winning Web + Mobile App Development Agency","profile":"/profile/net-solutions","website":"http://www.netsolutions.com","directory":"directory/mobile-application-developers","page":"9","verified":"","description":"Brands all over the world tap into Net Solutions’ experience and expertise from nearly two decades of digital consulting to create meaningful and personalized experiences for their customers that leave an impact and build loyalty. Our client roster includes leading enterprises like Unilever, Microsoft, Harvard Business Review, IMG, Mothercare, and Euro Car Parts.\nStartups love working with us to exploit our enterprise-grade production quality and process tooling to build their businesses in a reliable, transparent manner, trusting our focus on making them succeed. Multiple exits and relationships spanning over a decade underline their trust and our demonstrated abilities.\nNet Solutions specializes in technology-agnostic solution development driven by Design Thinking, implementing the solution using world-class engineering practices across a spectrum of technologies with our custom flavor of Agile methodology, and using insightful analytics to help drive growth. This is reflected in the fact that Net Solutions was mentioned in Forrester’s Vendor Landscape of Top 65 Digital Experience Service Providers 2017 and Gartner Cool Vendors 2017 Guide as CRM Application Software Specialists in the Asia Pacific.\nNet Solutions has won multiple awards from technology partners like Kentico and Adobe, industry bodies like WMA and Brandon Hall, and is a leading partner for solution enablers like Adobe, AWS, Microsoft, Acquia and Google.\n \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2000","locations":[{"headquarters":true,"address":"Site No. 15, Phase 1, Rajiv Gandhi Chandigarh Technology Park","locality":"Chandigarh","region":"","postal_code":"160101","country":"India","phone":"+91.172.431.5000"},{"headquarters":false,"address":"Aldgate Tower 2 Leman Street Fourth Floor","locality":"London","region":"","postal_code":"E1 8FA","country":"United Kingdom","phone":"+44.208.610.9966"},{"headquarters":false,"address":"111 Queen Street East South Building","locality":"Toronto","region":"","postal_code":"M5C 1S2","country":"Canada","phone":"+1.416.720.1790"},{"headquarters":false,"address":"101 Avenue of the Americas, 8th Floor","locality":"New York","region":"NY","postal_code":"10013","country":"United States","phone":"+1 (305) 767-3821"},{"headquarters":false,"address":"11601 Wilshire Blvd, 5th Floor","locality":"Los Angeles","region":"CA","postal_code":"90025","country":"United States","phone":"+1 (305) 767-3821"}]}