{"id":"15700","name":"Glance Creative Ltd.","tagline":"We're award-winning app developers.","profile":"/profile/glance-creative","website":"http://thisisglance.com","directory":"directory/mobile-application-developers","page":"5","verified":"","description":"We craft exclusive, engaging apps and supporting platforms for our brands. With a strong heritage in enterprise-level development, we're not just another mobile media agency or group of app developers. By bringing enterprise-level quality and process to the mobile sector, our products not only look exquisite, but they stand up to the scrutiny of your customers and ours.\nAs a small team of highly talented designers, user experience professionals and developers, we know the mobile sector better than most; that's why we're rated so highly. The brands we work with demand the most progressive and high-quality products and quite simply, that's what we create. If you've worked hard to build your brand, you want to work with a company who values that ethos as much as you do. It's our founding principle.\nTo produce amazing work you need amazing people and we have some of the best individuals working in design and technology. You know your business, your customers and your idea. We know mobile, usability and great design. The combination of these is what creates beautiful products. We work with you, not for you, to create dynamic products which take the best of our expertise and tailors it specifically to you, your customers and your business sector. Creating exclusive mobile experiences just can't be achieved without this close working relationship.\nBeing both creative and technical, we have extensive experience in creating unique products for our clients which not only stand out visually but are technically engineered to enterprise standards.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2016","locations":[{"headquarters":true,"address":"Unit 302, Cannon Wharf, Pell Street","locality":"London","region":"","postal_code":"SE8 5EN","country":"United Kingdom","phone":"+44 (0)20 3970 4775"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Belarus","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Poland","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Ukraine","phone":""}]}