{"id":"15754","name":"SAS Shack India","tagline":"Dreams beyond technology","profile":"/profile/sas-shack-india","website":"http://www.shackindia.com","directory":"directory/mobile-application-developers","page":"232","verified":"","description":"Established in year, 2009, SAS Shack India, an ISO 9001 - 2008 certified is a web and software development company in India, to provide software outsourcing development and web site development firms abroad. SAS Shack India has deliver more then 1500+ projects, 400+ satisfied clients across 32 countries.\nSAS Shack India has been providing cutting edge innovative solutions in Information Technology. Today we have achieved a position of respect as we have not only survived the economic rallies of the past decade; but excelled as a software development services provider.\n\"Any person can make things simple things complex; it takes brilliance to make complex things simple.\"\nSAS Shack India service offerings span of web application development, ecommerce solutions, iphone applications development, android applications development, open source applications customizations, business and enterprise application development service, custom software development.\nOur group of young trained professionals has varied experience and is intensely focused on providing customers with the highest quality technology appropriate for the customer at the best price imaginable.\nIt would be immodest to call ourselves brilliant, but that is surely an ideal SAS Shack India continuously strives towards. Since the very beginning, our core strength has been in the ability to design simple solutions for complex problems. At the core of this ability lies our continuous mingling with the latest knowledge and knowledge providers. SAS Shack India team is on a continuous learning curve whereby we strive to bring you the best solutions using the least effort, the least time, and the least cost. Now, that is something we are sure you will appreciate!\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"","locality":"Jodhpur","region":"","postal_code":"342001","country":"India","phone":"91.93.14909345"}]}