{"id":"157585","name":"Intivix","tagline":"Cloud and IT Solutions That Just Work","profile":"/profile/intivix","website":"https://www.intivix.com","directory":"it-services","page":"4","verified":"","description":"We run your IT, so you can run your business! We are a one-stop shop serving the IT needs of small and medium size business clients around the San Francisco Bay area. We take great pride in exceeding our customer's expectations and building very close, long-term relationships with our clients. Our IT services and expertise fall into four areas:\n1. IT Strategy, Governance and Control - we assess your IT needs based on the requirements of your business and provide a reliable, secure and cost effective long-term solution.\n2. IT Infrastructure and Security Management - we build, run and maintain your Datacenter/Server, Network and Firewall, Workplace (PC/Workstation/Laptop), Print, and Unified Communications (Smartphone, Mobile Device, IM, VOIP);\n3. Software/Applications Management & Development - we provide implementation, development, migration and administration services for your Business Productivity Applications such as Windows, Office, ERP, CRM, Finance/Accounting, Time Management, and Database.\n4. IT Consultancy & Project Management - our diverse expertise can be applied to your unique IT problem and we can augment staff in your IT Department in order to keep your business on track.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1996","locations":[{"headquarters":true,"address":"605 Market Street","locality":"San Francisco","region":"CA","postal_code":"94105","country":"United States","phone":"415-543-1033"},{"headquarters":false,"address":"2380 NW Kings Blvd","locality":"Corvallis","region":"OR","postal_code":"97330","country":"United States","phone":"541-368-4655"},{"headquarters":false,"address":"5427 Telegraph Avenue","locality":"Oakland","region":"CA","postal_code":"94609","country":"United States","phone":"510-292-4454"}]}