{"id":"15777","name":"Inaka","tagline":"We build end-to-end web and mobile apps","profile":"/profile/inaka","website":"http://inaka.net","directory":"directory/mobile-application-developers","page":"94","verified":"","description":"We build end-to-end web and mobile apps for large clients and small start ups. We focus on great delivery using Ruby, Rails, Java, Erlang, and Objective C; and everything from Elastic Search, Riak, Redis, to MySQL.\nWe are a team of thirty programmers, designers, and project managers. We work in partnership with client teams; we're passionate about little details, adding value, and making great ideas work.\nWe are experts in bootstrapping; we take a startup idea and build it to \"minimum viable product\". We help clients launch quickly, with a codebase that can grow with them and their business. We train and grow a team as needed, or we work alongside an existing team, depending on the client and the specific project.\nWe build solutions that really last. We reuse technology where it makes sense. This helps projects to go faster, with coding that is more reliable, a schedule that is easier to predict and a budget into which we can pack more value.\nWe believe one of the most important skills a developer can have is empathy. Technology is full of people who are more comfortable coding than understanding their customer. It's not enough to just take the hottest technology and use it because it's popular - you have to know how customers will interact with software long after the project is complete. We think through user stories, we plan for future versions, we decide what needs to be built now and what can wait until more is known about the end-user.\nWe work in teams with our clients, creating a specific team at inaka, based upon the needs of a particular project, or in some specific cases we will physically sit within a client team; the solution depends on each client and their needs.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"93 S Jackson St #65056","locality":"Seattle","region":"WA","postal_code":"98104","country":"United States","phone":"866.999.2927"}]}