{"id":"15799","name":"MediaAgility","tagline":"Re-imagining the power of Social, Mobile and Cloud","profile":"/profile/mediaagility","website":"http://www.mediaagility.com","directory":"directory/mobile-application-developers","page":"97","verified":"","description":"MediaAgility was born on the Cloud in early 2011 with a mission to enginerr intelligent solutions powered by the new paradigm technologies to enable our customers to achieve their moonshots. MediaAgility started with a focus on Google Enterprise platform and was soon awarded the prestigious title of Premier Google Apps Enterprise Reseller. We have a strong global presence with offices in US, India and Singapore.\nAs a Google Apps Premier Enterprise Strategic Partner we provide Google Apps, Google Apps Engine, Google Search Appliance, and Vault Message Security and archiving service to mid, small and large enterprises and educational institutes. Our Google Enterprise deployment team boasts of the most complex deployments to have happened in India in Google cloud space in heterogeneous IT environments. In a short span of time MediaAgility has implemented thousands of Google Apps licenses across many countries, deployed Google Maps, Developed 40+ Mobile, Tablet and TV Apps and numerous custom development projects on the cloud.\nMediaAgility holds the commendable expertise in Mobile Apps Development, Gamification, Financial Tracking, Product Development like BrandAgility and many others. We are group of receptive people who take up new technologies and develop products on new age platforms which sets us apart from other IT service companies which usually resort to offshore project development for their organisational needs. We are developing exciting Edutainment Apps on Facebook, Chrome Webstore, iOS, Android, Google TV, Tablets.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"< $25 / hr","num_employees":"250 - 999","founded":"2011","locations":[{"headquarters":true,"address":"SCO 43, Old Judicial Compex","locality":"Gurgaon","region":"HR","postal_code":"122001","country":"India","phone":"866.MEDIA.V1"},{"headquarters":false,"address":"360 Wall Street","locality":"Princeton","region":"NJ","postal_code":"08540","country":"United States","phone":"609.681.5754"}]}