{"id":"15859","name":"SocialDNA Labs","tagline":"Affordable Web Mobile and Software Application Dev","profile":"/profile/socialdna-labs","website":"http://www.socialdnalabs.com","directory":"directory/mobile-application-developers","page":"177","verified":"","description":"SocialDNA Labs defines, designs and delivers technology enabled business solutions in social, e-commerce and enterprise domain. It also provides a complete range of services including Web and Mobile Applications by leveraging our domain and business expertise and strategic alliances with leading technology providers.\nSocialDNA Labs is a perfect blend of business, functional and technical expertise that serves our clients best. It assists them in better aligning of their business objectives and strategies with the demands of the ever competitive market. We serve Indian media houses, business houses, multinational corporations, early stage startups as well as the public sector. We also provide assistance to global clients seeking to develop local businesses and expand into emerging markets such as India. Our integrated approach combines insight and innovation from multiple disciplines with business and industry knowledge to help our clients excel anywhere in the world.\nSocialDNA Labs is the unique source for your website design and development, graphics design, multimedia and Internet marketing service needs. If you think of offshore outsourcing services in India, we provide solutions like custom web design, flash intros, mobile application development, web portal development, flash presentation, custom logo design and much more.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"","locality":"Bangalore","region":"KA","postal_code":"560093","country":"India","phone":"91.99.00931624"},{"headquarters":false,"address":"2033 Gateway Place, Suite 500","locality":"San Jose","region":"CA","postal_code":"95110","country":"United States","phone":"408.618.5455"}]}