{"id":"158668","name":"SEO Locale, LLC","tagline":"We can only grow as much as our clients!","profile":"/profile/seo-locale","website":"https://seolocale.com","directory":"web-developers","page":"75","verified":"","description":"SEO Locale was started in 2015 by digital marketing experts who have over 15 years of experience in this industry.\nAs a full service digital marketing agency, SEO Locale offer specialized in local search engine optimization, national search engine optimization, web design, web development, paid search management, social media management, mobile app development, reputation management, content strategy and optimization and email marketing.\nMarc and Joe (aka Joey, Big J, J-Man) met at a networking event in Old City, Philadelphia on sunny Thursday night. Both Marc and Joey had the same dreams and aspirations of opening their own digital marketing agency and truly helping companies grow from the ground up. After just a couple short hours of in-depth business conversation, the two realized the potential there was to be had as business partners. Thus, the idea of SEO Locale, LLC was built. Like a couple of hungry hippos, Marc and Joe started to eat and breathe SEO Locale, got some clients, and never looked back.\nIn only 2 years of operation, SEO Locale has worked with small local business that are just opening their doors, all the way up to massive eCommerce companies that do millions of dollars a year in revenue, SEO Locale is able to handle any client. Not only can SEO Locale work with a business of any size, but digital marketing packages are specifically catered to fit your businesses needs, goals and most importantly, budget.\nAs a premier digital agency of Philadelphia, SEO Locale is honored and privileged to service the Greater Area of Philadelphia. There is no greater feeling than helping out fellow Philadelphia businesses grow and prosper. We are here to help YOU and want YOU to be successful. We understand that we are only as successful as our clients, and that is exactly what drives us to get results for them everyday.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"2 - 9","founded":"2015","locations":[{"headquarters":true,"address":"","locality":"Philadelphia","region":"PA","postal_code":"","country":"United States","phone":"267.368.7905"}]}