{"id":"158740","name":"Bitwise Solutions","tagline":"Communicate. Design & Develop. Deliver.","profile":"/profile/bitwise-solutions","website":"http://bitwise.in","directory":"directory/mobile-application-developers","page":"359","verified":"","description":"Hello,\nWe are Bitwise Ventures. We make awesome websites, mobile apps, games, designs & more.\nEstablished in 2010,  we are a SMALL - SMART - DYNAMIC organization based out of India. Technology and learning new things excite us and we have worked on .Net, Java, Android, iOS, Unity, Animations, PHP, IONIC, etc.\nOur core areas of work are as below -\nWeb Development  - HMTL5, CSS3 & JS\nCross Platform App/2D Game Development using UNITY\nLaravel Development\nOther PHP development - core, WordPress, Yii, Joomla etc.\nDespite being a very small team we have managed to work with some of the biggest clients. We owe this to:\nthe supreme quality of work\ntransparency with the client\nvery high commitment levels\nWe like to call ourselves web artisans. For us, programming is an art and each of our team member enjoys practicing this art, thoroughly. We work WITH the client and NOT FOR the client. We believe each piece of software is a solution, a vision, an aspiration. We strive to share the vision of the client.  We understand that software should have meaning, substance, and intelligence. It should be affordable but not cheap, fast but not resource hungry, smart but not complex.\nChoose us because:\nWe communicate\nWe understand\nTechnology excites us\nWe are fast\nWe test\nWe launch\nWe are honest\nWe love learning\nWe keep things simple\nWe design, develop and deploy\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"C2, Sunrise Complex, Near Asia School, Opp. Indraprastha Tower, Drivein Road, Sunrise Park, Gurukul","locality":"Ahmedabad","region":"GJ","postal_code":"380054","country":"India","phone":"9979311311"}]}