{"id":"15921","name":"Virtacore Systems, Inc.","tagline":"Your Cloud, our Infrastructure","profile":"/profile/virtacore-systems","website":"http://www.virtacore.com","directory":"it-services","page":"78","verified":"","description":"Virtacore is a leading cloud services provider specializing in virtual infrastructure solutions utilizing VMware. Our cloud solutions and disaster recovery services are built on leading edge, best-of-class Cisco UCS FlexPod architecture. We operate in the most secure and reliable data centers with 99.999% SLA uptime guarantees.\nWith years of experience in cloud and Internet services, Virtacore has a solid history of providing private and public cloud Infrastructure as a Service (IaaS) to meet the mission critical needs of our clients. Virtacore’s cloud solutions are extremely reliable, secure, scalable, and easy to manage. We help clients to shift their IT infrastructure to the cloud and reap the benefits of flexibility, rapid deployment, and lower costs. Virtacore also offers Google Apps for Business, enabling customers to migrate their email to the cloud and provide a powerful suite of collaboration and productivity tools for their employees.\nVirtacore’s four-tier security standard – which includes physical and logical security, as well as strict operational and compliance policies – meets the most stringent cloud security demands of our clients. Our numerous compliance certifications demonstrate Virtacore’s commitment to excellence and include SSAE 16 SOC 1 and SOC 2, PCI DSS, and HIPAA-readiness.\nHeadquartered in Sterling, Virginia – with offices and facilities in New York, Los Angeles, Chicago, Atlanta, and Salt Lake City – Virtacore maintains a broad U.S. footprint and serves domestic and multi-national customers across the globe.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$200 - $300 / hr","num_employees":"250 - 999","founded":"2009","locations":[{"headquarters":true,"address":"20110 Asbrook Place Suite 250","locality":"Ashburn","region":"VA","postal_code":"20147","country":"United States","phone":"888.573.7837"}]}