{"id":"16036","name":"DabApps","tagline":"We design and build apps for our client's success","profile":"/profile/dabapps","website":"http://www.dabapps.com","directory":"directory/mobile-application-developers","page":"62","verified":"","description":"We design and build bespoke web and mobile applications that help our clients succeed.\nWhat’s it like working with us?\nWe see the bigger picture.\nBringing fresh insight we can really add value by exploring your ideas and business goals fully with you. Our expert team of designers and engineers seek the best solutions to your problems through a process of discovery and whether you have a new idea or an existing product, we’ll help you fly.\nWe work in small focused teams to deliver projects on time and to budget, always aiming to build products that delight. We partner long term with you, supporting your business as it grows.\nWe treat you as a partner.\nWe can help identify the skills and resources you’ll need from within our strong and diverse team, including business analysis, product envisioning, technical design, development and project management.\nIf you are looking for a technical team to work with long-term, we’d love to hear from you.  We are equally able to work with you on a new business or product idea or support and extend your current systems where our skills are a good match for your own.\nCollaboration and partnership are at the heart of everything we do.\nWe’ll bring your ideas to life.\nWe have a wide range of experience of working with entrepreneurs and startups of all shapes and sizes! We can offer a broad perspective to those who are taking their first steps; from development strategy and funding options to ideas generation and technology choices.\nWe don’t just develop apps, we develop talent too.\nWe've built an awesome team with wide-ranging talents and interests. This makes DabApps such a great place to work and develop, personally and professionally. We celebrate diversity and encourage people to be themselves.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"36 Frederick Place","locality":"Brighton","region":"ESX","postal_code":"BN1 4EA","country":"United Kingdom","phone":"+44 12 7320 8222"},{"headquarters":false,"address":"First Floor, Brunel House","locality":"2 Fitzalan Rd","region":"CRF","postal_code":"CF11 9HW","country":"United Kingdom","phone":"+44 12 7320 8222"}]}