{"id":"161431","name":"COAL","tagline":"Fuel for business","profile":"/profile/coal","website":"https://wearecoal.co.uk","directory":"web-designers","page":"47","verified":"","description":"AT COAL WE MAKE BETTER ADVERTISING, BY MAKING ADVERTISING BETTER.\nWe keep things simple. In our opinion that the quality and effectiveness of advertising in general isn’t good enough. The way businesses work with agencies and the way that agencies organise themselves and develop work needs to improve. \nIt’s hardly surprising that marketing departments and agencies find themselves increasingly viewed with suspicion by CEOs, CFOs, boardrooms and businesses.\nSo how do we get out of this mess and return to the single-minded purpose of adding value to a client’s business with creativity? We need to challenge everything again. \nAt first glance, it might seem that an awful lot needs to change. But in reality, most of it starts with simplification. An injection of common sense and a commitment to deliver what is important to the customer.\nCOAL focus on the real reason businesses come to agencies in the first place to get smart creative thinking and advertising craft that helps them achieve their business goals.\nCOAL are organised around this single focus. We are building an agency that provides the best working environment to allow smart and ambitious marketing and advertising people to come up with the strongest possible solutions for our clients business.\nCOAL are building a future where the customer might again have reason to feel valued. A future where business understands the impact of good marketing and the important role it plays in fuelling businesses growth.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"Unit 319 Zellig, Gibb Street","locality":"Birmingham","region":"","postal_code":"B9 4AT","country":"United Kingdom","phone":"0121 270 0650"},{"headquarters":false,"address":"2 Sheraton Street","locality":"Soho","region":"","postal_code":"W1F 8BH","country":"United Kingdom","phone":"0203 598 0418"}]}