{"id":"162292","name":"Serfe","tagline":"High quality in Web and Mobile Development","profile":"/profile/serfe","website":"http://www.serfe.com","directory":"web-developers","page":"6","verified":"","description":"Since 2003, we have served as a web and mobile development team to hundreds of companies all over the world, being repeatedly recognized for developing innovative solutions.\nWe are responsible for full lifecycle development of next-generation software, from initial requirement gathering to design, coding, testing, documentation and implementation, merging business and user needs into high-quality, cost-effective solutions while keeping within budgetary constraints.\nWe also known the importance of an effective communication. As we are in Argentina, we have a similar timezone with America and Western Europe, allowing us to take advantages of phone calls and video-conferences to be sure that we are always on the same page on every step we take.\nOur technical expertise includes fluency on any free and open source software based on PHP and Javascript; advance knowledge on Front-End development (XML, JSON, JavaScript, DHTML, AngularJS, jQuery, AJAX, SASS/LESS, Bootstrap), Back-End development (PHP MVC Frameworks: CakePHP, Laravel, Symfony2, Yii, CodeIgniter; Databases: MySQL, PostgreSQL, MongoDB, CoachDB; CMS: Wordpress, Joomla, Drupal; E-Commerce: Magento, WooCommerce) and Mobile development (Android / iOS, Phonegap / Cordoba, Ionic Framework, SQLlite, LocalStorage); and proficiency on developer applications, tools, methodologies and best practices (including Scrum, client/server architecture and self-test automation).\nOur experience developing user-friendly solutions on time and on budget would enable us to bring value to your business. We look forward to working together in good harmony with mutual benefits! Hope to hear from you soon.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2003","locations":[{"headquarters":true,"address":"Macia 2472","locality":"Santo Tome","region":"S","postal_code":"3016","country":"Argentina","phone":"+54 342 4748205"}]}