{"id":"16329","name":"Hi-Tech ITO","tagline":"Enterprise Solutions with MS Dynamics CRM, AX, NAV","profile":"/profile/hi-tech-ito","website":"http://www.hitechito.com","directory":"web-developers","page":"134","verified":"","description":"Hi-Tech ITO, a division of Hi-Tech Outsourcing Services, is one of the leading software development and technology consulting company in India. We are a stable and capable partner to all our clients as we empower them to take hold of market opportunities, endow their people and operational efficiency from a partial solution to fully outsourced software development.\nWith a modest beginning in the year 1992, Hi-Tech ITO has successfully challenged norms, evolved with excellence & formed a robust-delivery model.\nService Offerings:\n• Enterprise Solutions (Microsoft Dynamics NAV, AX & CRM)\n• Enterprise Mobility\n• Microsoft SharePoint\n• Business Intelligence\n• Custom Application Development\n• Mobile Apps Development\n• CMS Development\n• Web Design & Development\nWe have successfully delivered more than 5,000 projects to our global client base exceeding 2,500+ clients, from small businesses to Fortune 500 multinationals in more than 50 countries, with 80% revenue generation through repeat business.\nHi-Tech is well equipped with professionals with deep domain expertise of Automotive, Healthcare, Construction, Heavy Engineering, Media/Publishing industries and Govt. /Public Sector.\nTo know more about our work and to get a free quote, drop us an email at info@hitechito.com\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"250 - 999","founded":"1991","locations":[{"headquarters":true,"address":"14, Aaryans Corporate Park, Near Shilaj Railway Crossing Thaltej - Shilaj Road, Thaltej,","locality":"Ahmedabad","region":"GJ","postal_code":"380059","country":"India","phone":"+91-79-26304241"},{"headquarters":false,"address":"547 Moreland Way","locality":"Santa Clara","region":"CA","postal_code":"95054","country":"United States","phone":"408.338.8047"}]}