{"id":"16427","name":"MobilePundits","tagline":"Outsourced Mobile development Partner","profile":"/profile/mobilepundits","website":"http://www.mobilepundits.com","directory":"directory/mobile-application-developers","page":"36","verified":"","description":"Mobilepundits is a leading custom app development and testing company. We have expertise in all major mobile platforms including iPhone, iPad, Android, Windows Phone and Cross platform technologies like PhoneGap and Sencha touch.\nOur Quality & Processes are ISO 9001:2008 certified by Bureau Veritas & UKAS, assuring our clients of high quality wireless and mobile app development in scheduled time and on budget. If you are looking for expert App developer for developing free or paid mobile phone applications, look no further. Your search for professional Mobile Developer ends here.\nSince more than 10 years, our team of experienced App Developers has been helping our clients with mobility strategy, enterprise mobility, Mobile Product Development, Porting applications to various mobile platforms and wireless testing. By leveraging our India based Offshore Mobile Development and Offshore Mobile Testing capabilities we help our clients to develop high quality products, while significantly reducing the cost of development/testing and time to market.\nMobilepundits have been awarded by Deloitte for 3 consecutive years as one of the Fastest Growing Technology Company in India & in Asia Pacific. This is attributed to our focus on Mobile Programming / Mobile App Development and Mobile Testing services.\nOur clients range from mobile start-ups and emerging wireless companies to mature organizations in multiple domains and technologies.\nSee our Portfolio\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2003","locations":[{"headquarters":true,"address":"","locality":"Indore","region":"","postal_code":"452001","country":"India","phone":"91.731.402.5351"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":"732.654.9056"},{"headquarters":false,"address":"","locality":"Sydney","region":"NSW","postal_code":"","country":"Australia","phone":""}]}