{"id":"166273","name":"Core Value Inc.","tagline":"A decade of trust through technology","profile":"/profile/core-value","website":"https://corevalue.net","directory":"directory/mobile-application-developers","page":"28","verified":"","description":"Since November 2019 CoreValue is a part of Avenga, a global IT company backed by funds managed by Oaktree Capital Management L.P. and Cornerstone Partners \nCoreValue is a Global Software and Technology Services company, providing Cloud based implementation services, Salesforce platform development and integration services, Data Services and Machine Learning powered solutions, and Mobile & Web application design and development services to industries such as Finance, Pharmatech, and Healthcare.\nHeadquartered in New Jersey, USA, CoreValue maintains quality software and consultancy services to funded startups, investors, mid-sized enterprises and Fortune 50 through 500 companies engaging our expert engineering teams in 9 development labs across Eastern Europe and a global network of consulting experts.\nAs both a Salesforce Global Consulting Partner and a Gold Microsoft Partner, CoreValue is a one-stop solution for products that transform business models.\nCoreValue is featured in 2018 Inc. 5000 List of Fastest-Growing Companies in the USA and ranks among Top Mobile App Development Companies in New Jersey in 2018. The company is also recognized by Ukraine’s top IT employer by DOU.ua, the largest Ukrainian developer community and is an official member of the CAI-Global IT Partner Alliance.\nCoreValue focuses on customer success through application development and product development outsourcing using complex data integrations and its core expertise areas include:\nSalesforce.com implementations\nData Science, Big Data\nData Analytics, BI & Data Operations\nCloud-based solutions\nCustom CRM solutions\nWeb and Mobile App Development\nTesting and QA\nR&D\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"Undisclosed","num_employees":"250 - 999","founded":"2004","locations":[{"headquarters":true,"address":"18 Overlook Ave, Suite 9","locality":"Rochelle Park","region":"NJ","postal_code":"07662","country":"United States","phone":"908-312-4070"},{"headquarters":false,"address":"","locality":"Lviv","region":"","postal_code":"","country":"Ukraine","phone":""}]}