{"id":"16634","name":"Apptivation Mobile","tagline":"UK's Innovative Mobile App Agency","profile":"/profile/apptivation-mobile","website":"http://www.apptivation.co.uk","directory":"directory/mobile-application-developers","page":"102","verified":"","description":"Apptivation is one of the UK’s largest full service award winning mobile agencies, based in the heart of London.\nWe focus on creating beautiful, innovative and technically robust mobile and tablet solutions that are commercially focused and results driven.\nWe partner with some of the leading brands, helping them shape their digital strategies and develop cutting edge mobile solutions. We make the complicated simple.\nDiscovery & Strategy Understanding business requirements and target customer behaviour to determine how the latest mobile tech can be leveraged to improve sales, retention and brand recognition.\nAgile Development We only hire the brightest most talented developers in the industry. Our specialist teams have expert technical experience and knowledge of all mobile platforms.\nExperience Design Translating project requirements into beautiful, engaging, on-brand experiences. From the initial creation of wireframes and user journeys through to the final design solution.\nTesting & QA Covering mobile UI, functional, compatibility, accessibility, network, security and performance testing on a full range of physical devices.\nRapid Prototyping Rapid development of proof of concepts to de-risk and refine design decisions, by providing early visibility to the final product, ensuring a successful launch.\nLaunch & Support We remove the hassle of distributing your app across multiple stores. Our media agencies are on hand to get your brand into the right hands maximising exposure and coverage.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2012","locations":[{"headquarters":true,"address":"10th Floor, 88 Wood St","locality":"London","region":"","postal_code":"EC2V 7RS","country":"United Kingdom","phone":"+44 20 8528 1855"}]}