{"id":"166708","name":"Brandpoint","tagline":"Driving Results Through Content","profile":"/profile/brandpoint","website":"http://www.brandpoint.com","directory":"seo-firms","page":"15","verified":"","description":"Brandpoint is a full-service, industry-leading content marketing agency. We operate in three core practice areas that address the continuum of content marketing tactics: content strategy, content creation and content distribution. \n*Content Strategy: We research and build customized plans -- focusing on SEO, content and social media -- that are fine-tuned to clients' unique needs.\n*Content Creation: We develop on-target, on-brand messaging -- including writing, design and structured data services -- to power clients' inbound marketing efforts.\n*Content Distribution: We use digital tools -- including MAT releases, sponsored content and content amplification -- to drive traffic, engagement and page views that incite consumer action for clients.\nBrandpoint has been in the content marketing business since 1996: before the practice was known as content marketing. Many of the world's biggest and best brands trust us for their content needs, as do mid-sized companies and start-ups down the street. Clients value the opportunity to work directly with our strategists and writers to create a voice that becomes an extension of their brand image. And our proprietary content platforms provide a turnkey process that streamlines workflow and reports results for clients. \nBrandpoint's online marketing methods are effective, efficient and measurable. We help you prove the ROI on your content marketing investment. Whether a client needs a blog or an enterprise-level content marketing campaign, Brandpoint delivers the bandwidth, proprietary services and expertise to achieve business goals\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"1996","locations":[{"headquarters":true,"address":"850 Fifth Street South","locality":"Hopkins","region":"MN","postal_code":"55343","country":"United States","phone":"877.374.5270"}]}