{"id":"168565","name":"Specbee","tagline":"Digital Solutions that Deliver","profile":"/profile/specbee","website":"https://www.specbee.com","directory":"web-developers","page":"15","verified":"","description":"We build enterprise websites and applications that drive consumer engagement, enable revenue generation and optimize business processes.\nOur CMS development, customization and implementation services over Drupal and Adobe Experience Manager has enabled online initiatives for some of the largest enterprises in the world. Our clients include Ericsson, The Volkswagen Group, Flipkart, 247 inc, Naryana Health among others.\n \nIf you are looking to build an enterprise application/website that is customized to your business and scales in line with it, we have just the right team for you. We are a premium supporting partner of the Drupal association and our  team consists of Acquia certified developers and architects who contribute actively to the Drupal community.\nWe are an Adobe partner company and have an Adobe Experience Manager Practice that consists of Adobe certified developers who can enable you to achieve your online objectives using AEM.\nIn addition to our core CMS expertise, we also have a dedicated team of front end developers over React and Angular who can assist you with building compelling, high performance applicaitons based on a head less architecture. We have architected and deployed several high traffic and mission critical applications over cloud IAAS such as Amazon AWS and Microsoft Azure.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2015","locations":[{"headquarters":true,"address":"3348 Peachtree Road NE, Suite 700","locality":"Atlanta","region":"GA","postal_code":"30326","country":"United States","phone":"+1 678 528 3109"},{"headquarters":false,"address":"wall street","locality":"New York","region":"NY","postal_code":"10005","country":"United States","phone":"+1 404 421 3539"},{"headquarters":false,"address":"2nd Floor, Pixel Park - A Block, PESIT South Campus","locality":"Bangalore","region":"","postal_code":"560100","country":"India","phone":"+919972400977"}]}