{"id":"16918","name":"Flugelsoft UK Limited","tagline":"Wings of Tomorrow","profile":"/profile/flugelsoft-uk","website":"http://www.flugelsoft.com","directory":"directory/mobile-application-developers","page":"125","verified":"","description":"More than 15 years of expertise in Software Sales & Development, social media, mobile, and web applications.\nHelp design, plan, customize and deploy end-to-end mobile enterprise solutions.\nExtend efficiency of enterprise applications by going mobile Improve sales force productivity through mobile applications\nMobility Inventory Management -Optimize warehouse management with real time inventory\nSoftware solution expertise spans several industries, including Finance, Health Care, Pharmaceuticals, Communication & Media, Telecom, Automotive and Aerospace\nDesigned and developed multiple complex client-server and web applications using various industry accepted methodologies.\nSpecialties: Mobility Inventory Management Customization of open source mobile app games for branding / marketing a idea etc. Online marketing International Market Sales Project management Business case, requirements analysis, and system definition Custom Unix/Linux servers (daemons) or network applications Back-end/database applications Open source applications like osCommerce, Magento, Sugarcrm, Wordpress, Drupal etc Android/Ipad/Iphone/Blackberry Application development based on different SDK's Corona Labs, Sencha Touch Software documentation and maintenance Code review, profiling, and optimization\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"1999","locations":[{"headquarters":true,"address":"30 LONDON ROAD 1ST FLOOR","locality":"SAWBRIDGEWORTH","region":"HRT","postal_code":"CM21 9JS","country":"United Kingdom","phone":"+44.208.123.6463"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":"+1.818.574.3596"},{"headquarters":false,"address":"","locality":"Guwahati","region":"AS","postal_code":"781001","country":"India","phone":""}]}