{"id":"16929","name":"Axmor Software","tagline":"For when it's really complicated.","profile":"/profile/axmor-software","website":"https://axmor.com","directory":"directory/mobile-application-developers","page":"74","verified":"","description":"We develop custom IT solutions for tech startups and small businesses that require deep expertise across multiple IT fields. Our company builds MVPs, develops systems, automates business processes, and handles integration with third-party services.\n \n70% of our clients return with new projects and stay with us 5 years on average. There is a common thread among them:\n \n- They have projects that require a cohesive team, as opposed to a newly assembled group of developers.\n- They expect flexibility in response to changing project requirements\n- They find effective project management and crystal clear communications to be crucial for success\n \nOur main strength lies in complex projects that require both experienced generalists and specialists:\n \n- BI solutions, Unified Communications, and VoIP, Internet of Things, Big data, Machine learning, blockchain\n- We use tried-and-true tech stack: Java, .Net, Python, Node.js, just to name a few\n \nWho we are \n \n- The team is comprised of about a hundred tech minds, who've worked together for the past 15 years\n- Our Heads of Technologies are published experts with 20+ years in their fields. You can find their articles on IBM developerWorks, in Java Developer's Journal, Dr Dobb's Journal, Automated Testing Magazine, SOA World Magazine. We also contribute to open-source software projects.\n \n \n \nIf you have a project in mind, drop us a line to request a free estimate: sales@axmor.com\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2003","locations":[{"headquarters":true,"address":"4433 Merlin Way","locality":"Soquel","region":"CA","postal_code":"95073","country":"United States","phone":"+1 831 475 2256"},{"headquarters":false,"address":"Inzhenernaya Str 4a","locality":"Novosibirsk","region":"NVS","postal_code":"630090","country":"Russia","phone":"+7 383 363 0128"},{"headquarters":false,"address":"Inzhenernaya Str 4a","locality":"Novosibirsk","region":"NVS","postal_code":"630090","country":"Russia","phone":"+7 383 363 0128"}]}