{"id":"16942","name":"ISHIR","tagline":"Excellence. Delivered.","profile":"/profile/ishir","website":"https://www.ishir.com","directory":"it-services","page":"14","verified":"","description":"Established in 1999, ISHIR is a globally diversified leading offshore software development company. With a strong expertise in software development, web design and development, managed cloud services, software testing, application development services, and PWA. ISHIR also offers next-gen Internet of Thing (IoT) and AI, Machine Learning, Robotics and Big Data services. \n \nHeadquartered in Dallas, with global delivery center in Noida, India, we are one of the preferred offshore software development companies with a unique combination of skilled people, world-class processes and robust technology.\n \nISHIR has extensive experience in providing outsourcing non-core business processes - IT functions (custom software development, product development, SharePoint consulting and development, mobile app development, software testing, managed IT services, managed hosting, cloud computing solutions), Interactive (web design, web development, mobile websites, PWA), Internet Marketing (search engine optimization (SEO), paid search (PPC), display, web analytics and social media marketing services), staff augmentation services, virtual employee, setting up Built Operate Transfer (BOT), specialized R&D facilities, and non-IT business process outsourcing (BPO) functions (data entry, research, photo editing, customer support, finance).\n \nISHIR is a SEI CMMi Level 3 company. We are also Microsoft Gold Certified Partners, VM Ware Solution Partner, and Google Adwords Company. We are adwarded by INC. as America's fastest growing 5000 companies. We are minority owned and certified by NMSDC and NCTRCA.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1999","locations":[{"headquarters":true,"address":"5830 Granite Pkwy, Suite #100-360","locality":"Plano","region":"TX","postal_code":"75024","country":"United States","phone":"1.888.994.7447"},{"headquarters":false,"address":"D- 44, Sector 59","locality":"Noida","region":"UP","postal_code":"201301","country":"India","phone":"0120-4234715"},{"headquarters":false,"address":"","locality":"New Delhi","region":"DL","postal_code":"110012","country":"India","phone":""}]}