{"id":"169876","name":"Aten Design Group","tagline":"Work that Matters","profile":"/profile/aten-design-group","website":"https://atendesigngroup.com","directory":"web-developers","page":"2","verified":"","description":"We’re a team of strategists, project managers, designers and engineers that love building digital products and experiences with organizations doing work that matters. We excel at communication and thrive on collaboration. We love helping clients tackle challenges big and small.\nDesigned for Humans\nWe’re a research, design and technology company that’s all about people. From human centered design and persona driven development to Agile methodology and high-touch collaboration, our process keeps humanity front-and-center. And it gets results. We build digital products that enrich and empower people all over the world.\nFlexibility is a Virtue\nFrom discrete strategy workshops and consulting engagements to redesign projects and ongoing support, our service offering is broad. We connect clients with members of our team in whatever way adds the most value.\nDrupal Experts\nWe’ve been using Drupal since way back in 2006 – version 4.7. From speaking at Drupal conferences internationally, to helping plan local Drupal events, to serving as track chairs at DrupalCon, to writing code for Drupal core and contrib, to providing Drupal trainings – we’re involved in Drupal in just about every way possible.\nHeadquartered in Denver, Colorado\nWe deeply value the chemistry and productivity gained by diverse, full-stack teams collaborating closely together under one roof. And while our team is centrally located, we regularly collaborate with clients all across the globe with tools like Zoom, Slack and Basecamp – and of course the good ol'fashioned telephone. For in-person meetings, workshops and extended onsite work sessions, Denver has direct flights to virtually all metro destinations. We’re a hop, skip and a jump from just about anywhere.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2000","locations":[{"headquarters":true,"address":"3507 Ringsby Court Unit #111","locality":"Denver","region":"CO","postal_code":"80216","country":"United States","phone":"303.831.0448"}]}