{"id":"170065","name":"Singularika","tagline":"ChatBots & AI Conversational Interfaces","profile":"/profile/singularika","website":"https://singularika.com","directory":"web-developers","page":"101","verified":"","description":"We sell possibilities for your business, virtual assistants are for free!\nWe create virtual assistants and chatbots related projects of any level of complexity: \n1) Chatbots for any messengers with opened APIs (FB Messenger, Kik, Telegram, Slack, Skype, Viber, Line, etc.); \n2) SMS chatbots; \n3) Chatbot for websites and mobile apps;\n4) Chatbots as a part of big projects with dashboard, analytics, different API ERP and CRM integration and standalone dialog systems projects.\n5) Integration of Artificial Intelligence, Natural Language Processing and Machine Learning features;\n6) QA and technical documentation for 3rd party solutions.\nVirtual assistants portfolio\nWe provide full circle of a project development: technical specification, dialogues design, front-end and back-end, building database, QA, Project management, hosting, different APIs and payment gateways integration. \nOur expertise:\nPHP, Node JS, Python, Java, Telegram Bot Platform, FB Messenger API, Skype API, Viber API,  Slack, Dialogflow (ex-APi.ai), Platform-O, AIML 1.0./2.0, R, Tensorflow, Watson IBM, Bluemix, botpress.io, Microsoft bot framework\nOur engineers are highly qualified in dealing with databases: MySQL, Postgresql, MongoDB, FireBird, AWS Lambda, Redis.\nIn front-end we're experienced in Angular2, React.js, NodeJS, HTML5, CSS3, Bootstrap, SASS, Foundation, Jade(Pug), Lodash templating engine, Ajax, NPM\n#Keywords:\nArtificial intelligence, Natural Language Processing(NLP), Machine Learning(ML), chatbot development, web apps development, chatbots for messengers, chatbots for websites, CRM integration, API Integration, virtual assistant, dialog system, speech recognition, voice-to-text.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2016","locations":[{"headquarters":true,"address":"10, Komarova St","locality":"Odesa","region":"","postal_code":"65043","country":"Ukraine","phone":""}]}