{"id":"170251","name":"Open Solutions","tagline":"Open Solutions is a software development company.","profile":"/profile/open-solutions","website":"http://osinit.com","directory":"directory/mobile-application-developers","page":"55","verified":"","description":"We are a global IT company specializing in software development projects. We are willing to work on your project and deliver a high standard output within tight timescales.\nSince you are looking for a full-time developer we can offer you collaboration within outstaffing model, in fact, it’s your external full-time employee (and even more if it's necessary to accomplish a task):\n1.    we provide you with highly skilled professional developers (if needed we can replace or enlarge your developer team in shortest terms);\n2.    we guarantee you full control over task progress, and you can freely contact with your developer(s) via Skype, Telegram, etc.;\n3.    we can also assign our project manager to your team to control deadlines and task accomplishing quality or you can control it yourself.\nWhy you should work with us:\n1.    we successfully accomplished over 150 projects since our foundation in 2009;\n2.    there are more than 50 professional developers in our team, mostly of them have Master’s degrees in Computer Science or related areas;\n3.    over 65% of our clients come back to us with new projects;\n4.    we work in any format you are comfortable with: fixed price, time & material, outstaffing, etc.;\n5.   we have very advantageous rates as our company is situated in the regional centre of Russia, all our developers work on-site.\nPlease, feel free to contact if you have any interest or questions, and, please, note that we can work with almost all technologies: we have Front-end developers, Back-end developers, Full stack developers, mobile app developers (iOS, Android and Windows Phone), etc. Our expertise is really wide and covers almost all technologies.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2009","locations":[{"headquarters":true,"address":"Moskovskaya","locality":"Penza","region":"PNZ","postal_code":"440000","country":"Russia","phone":"+7 (841) 2-200-604"},{"headquarters":false,"address":"","locality":"Moscow","region":"","postal_code":"","country":"Russia","phone":"+7 (926) 660-75-16"}]}