{"id":"17115","name":"AppTier","tagline":"ECM Solution Integrator","profile":"/profile/apptier","website":"http://apptier.com","directory":"it-services","page":"15","verified":"","description":"AppTier is a focused solution and services provider for Enterprise Content Management (ECM). Since 2001, AppTier has been assisting organizations in various industries with successful and proven approaches towards the management of content utilizing the Open Text Livelink ® ECM Platform. AppTier has seven years of experience working with Livelink Implementations in a regulatory environment.\nAppTier is comprised of the most dedicated and experienced Livelink ECM solution experts in the industry. Collectively, AppTier professionals possess multiple decades of experience and have provided global and enterprise implementations of the Livelink ECM Platform. Further, the professionals blend the deepest experience with all aspects of the Livelink ECM platform with an intimate understanding of the business needs to provide an effective implementation partnership.\nAs an essential implementation partner, AppTier provides unparalleled experience in offering ECM consulting, managed services and hosted applications.\nThe AppTier specific competencies include:\n-infrastructure\n-application\n-implementation services\nAppTier has partnership alliances with Open Text, Microsoft, ResonateKT and Kofax. AppTier is based in Denver, CO with other office location in Los Angeles, CA and plans to expand in other Western Region locations and resources.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$200 - $300 / hr","num_employees":"10 - 49","founded":"2001","locations":[{"headquarters":true,"address":"210 University Blvd, Suite 500","locality":"Denver","region":"CO","postal_code":"80206","country":"United States","phone":"303.385.8505"},{"headquarters":false,"address":"210 University Blvd, Suite 500","locality":"Denver","region":"CO","postal_code":"80206","country":"United States","phone":"303.385.8505"}]}