{"id":"17203","name":"Armedia","tagline":"Filling a Services Role in the ECM Space","profile":"/profile/armedia","website":"http://www.armedia.com","directory":"it-services","page":"66","verified":"","description":"Armedia is an award winning employee-owned company founded in 2002 with the vision of filling a services role in the expanding Enterprise Content Management (ECM) space. We specialize in Alfresco, Drupal, EMC Documentum, Captiva InputAccel, Microsoft SharePoint and solutions. Armedia is an Veteran Owned, 8(a)/SDB certified (Minority Owned) technology firm with multiple government contract vehicles like GSA IT70 and DHS EAGLE, with offices in Atlanta, GA and Vienna, VA.\nArmedia is a member of Documentum's C3P program, Alfresco Platinum partnership, Microsoft ISV partnership, EMC Velocity partnership and a charter member of the Designed for EMC (DFE) program. We have helped our clients realize their objectives with content strategy, web publishing, regulatory compliance, records management, case management, digital asset management, document capture, migration, workflow and taxonomy. Additionally, our experience working with various customers has resulted in the creation of several products each addressing unique business problems within the content management industry. Since 2002, Armedia has provided technical services to many Federal Services and Fortune 500 clients in a variety of industries including; Transportation/Logistics and Manufacturing, Retail, Telecom and Energy. Each client brought a unique set of requirements which has helped Armedia build a broad set of expertise in the ECM space.\nSpecialties\ncase management, content managment, document management, records management, medical records, web content management, collaboration, CPIC, Documentum, SharePoint, Alfresco, Oracle UCM, OpenText, Palantir\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2002","locations":[{"headquarters":true,"address":"","locality":"Atlanta","region":"GA","postal_code":"30328","country":"United States","phone":"866.398.0323"},{"headquarters":false,"address":"","locality":"Washington","region":"DC","postal_code":"20001","country":"United States","phone":""}]}