{"id":"17316","name":"US Cloud","tagline":"Technology with Altitude","profile":"/profile/us-cloud","website":"https://www.uscloud.com","directory":"it-services","page":"5","verified":"","description":"Award-winning global managed cloud provider headquartered in St. Louis, Missouri. With its 100% USA-based 24/7 Cloud Keeper™ support, US Cloud helps companies simplify their infrastructure, unburden their team, and protect their brand. US Cloud technology with altitude™ includes cloud computing, management and security services.\nCloud computing services at US Cloud include Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Services (SaaS). Cloud servers and more traditional dedicated hosting and colocation are also available to bridge data center capacity expansion or retraction needs.\nUS Cloud’s management services cover public, hosted private and on-premises private clouds. More specifically, the architecture, integration and management of a multi-cloud hybrid IT environment is provided. US Cloud management services help customers identify what workloads and assets are best suited for a particular cloud and how to securely integrate them with the rest of the infrastructure.\nUS Cloud’s security services include risk assessment, architecture and managed services. Risk assessment services identify threats via penetration testing and network vulnerability discovery. Security architecture, implementation, and remediation services align technology, risk, and budget short-term while meeting long-term security roadmap goals. US Cloud managed security services rounds out the security portfolio by allowing a business to extend their security team or tools without the need to hire or buy hardware.\nUS Cloud was previously known as Fpweb.net before rebranding, along with its sister company US Cyber Vault, as US Cloud in 2017. \nAnd for every $100 of new business spent with US Cloud, US Cloud donates $2 to charity: water, a non-profit organization bringing clean and safe drinking water to people in developing countries. 100 percent of the money is used to build clean water projects.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"1996","locations":[{"headquarters":true,"address":"1714 Gilsinn Lane","locality":"Fenton","region":"MO","postal_code":"63026","country":"United States","phone":"800.200.8440"}]}