{"id":"17416","name":"Xminds Infotech","tagline":"We understand IT best","profile":"/profile/xminds-infotech","website":"http://www.xminds.com","directory":"directory/mobile-application-developers","page":"58","verified":"","description":"XMinds has worked with more  than 200 businesses (and counting) in the past 14 years and we offer our experience with the best expert talent pool in the industry to fulfill all your application development needs.\nOur team of technology architects, technical consultants and engineers is at your disposal to assist you in providing you with top-quality and reliable application development services. XMinds deploys best practices, proven development methodologies and time-tested optimum delivery models for developing and building applications on a fixed time, fixed cost basis.\nWe have worked with more than 200 startups and 28+ enterprise products in Australia, US, UK, Canada and Singapore and our clientele includes successful businesses like Spreets (sold to Yahoo for $60M), Dealised (raised $6M in Series A), Tangler (raised $4M in Round A), Swiftcash, Posse, Lingopal, Servcorp, Puntclub, EFactor, LocalBilling, Simraceway etc to name a few.We were the technology partners of one of the most reputed startup incubators in Australia,based out of Malaysia and also from India. We have immense experience in providing technology support to startup companies and follow 'Agile\" methodologies. \nOur Services include\nWeb Application Development\nMobile Application Development\nQA Services\n \n \nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2004","locations":[{"headquarters":true,"address":"Second Floor,Bhadra Centre, Kunnumpuram Road Ayurveda College","locality":"Trivandrum","region":"KL","postal_code":"695001","country":"India","phone":"+914712477556"},{"headquarters":false,"address":"Sophia Road","locality":"Singapore","region":"","postal_code":"228149","country":"Singapore","phone":"+6590994138"}]}