{"id":"17461","name":"Bounteous (formerly Demac Media)","tagline":"We eat, sleep, and breathe all things eCommerce.","profile":"/profile/bounteous-formerly-demac-media","website":"http://www.demacmedia.com","directory":"web-developers","page":"31","verified":"","description":"Demac Media is an award winning eCommerce solution provider based out of Toronto, Canada. As the largest Magento Gold Solutions Partner in Canada, Demac Media was awarded the Magento Partner Excellence Award in 2012, which placed the company among the Top 10 Magento Partners worldwide.\nCo-founded by two friends who had a passion for eCommerce and a vision to build a company they’d want to do business with, CEO Matthew Bertulli and CTO Dimitri Colomvakos have taken the Canadian eCommerce scene by storm. From day one the company’s mission has been to be at the core of eCommerce and help grow the industry within Canada. The company represents over $2 billion in annual retail sales in Canada alone, and powers much of the technology behind Bench, Scotch & Soda, Ardene and Stokes. The company has strategically partnered with industry leaders such as Magento, Canada Post, PayPal, and Shop.ca to position itself at the forefront of Canadian eCommerce.\nSince 2008, Demac Media has been helping Canadian businesses build an effective and successful eCommerce presence from the ground up. From design and development to integration and optimizing everything in between, the company acts as a strategic piece of a merchant’s online business whether it be B2B, B2C or a variation of the two.\nServices: \nUser Experience Design\nPlatform Development\nSystems Integration\nFully Managed Services and Support\neCommerce Strategy & Analytics\nSEO/SEM \nEmail Marketing \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"71 King Street East, Suite 200","locality":"Toronto","region":"ON","postal_code":"M5C 1G3","country":"Canada","phone":"+1.888.860.0364"},{"headquarters":false,"address":"4529 Rue Clark #300","locality":"Montreal","region":"QC","postal_code":"H2T 2T4","country":"Canada","phone":"+1.888.860.0364"},{"headquarters":false,"address":"601 West 26th Street, Suite 325","locality":"New York City","region":"NY","postal_code":"10001","country":"United States","phone":"+1.888.860.0364"}]}