{"id":"17498","name":"doodleblue Innovations","tagline":"Digital Strategy Consulting","profile":"/profile/doodleblue-innovations-private","website":"http://www.doodleblue.com","directory":"directory/mobile-application-developers","page":"112","verified":"","description":"A digital strategy consulting boutique that leads digital transformation, UI/UX & design thinking, mobile engineering, web technology development, innovation & enterprise application development. \nWe are over 500+ projects old with a team of 130 people who are equipped to cater to a mix of global brands, leading consultancies, startups, Fortune 500s, and governments.   \nOur clients are spread across the world from diverse domains - Banking & Financial Services, E-commerce, and Healthcare to name a few. \nSome of our clients include- Star Health, Vodafone, Validus, Asian Paints, Harvard Business School, Lynk, Bijilpay and more. \nIn addition to the services, we develop products as well and this effort is spear-headed by our R&D department that works on cutting edge technologies like Augmented Reality, OCR, google glasses, etc.  \nWe love working alongside a vast range of companies, people and ideas and have created everlasting impact across a variety of sectors including, healthcare, mental health, fin-tech, banking, entertainment, education and e-commerce - right from simplifying interfaces, making product experiences more inclusive and user friendly and enabling greater reach, education and sales through our product experiences.\nConnect with us to digitally transform your business.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2011","locations":[{"headquarters":true,"address":"110, Prakash Presidium, MG Road, Nungambakkam","locality":"Chennai","region":"","postal_code":"600034","country":"India","phone":"91-9094443000"},{"headquarters":false,"address":"104-40 Queens Boulevard","locality":"Forest Hills","region":"NY","postal_code":"11375","country":"United States","phone":"8007589293"},{"headquarters":false,"address":"SYNERGE II WorkSpace, 16th Main Rd, 4th T Block East, Pattabhirama Nagar, Jayanagar,","locality":"Bengaluru","region":"KA","postal_code":"560041","country":"India","phone":""}]}