{"id":"175078","name":"Buchanan Brand + Design","tagline":"Solutions through smart design.","profile":"/profile/buchanan-brand-design","website":"http://buchanandesign.com","directory":"web-designers","page":"807","verified":"","description":"Buchanan is dedicated to solving your brand challenges through innovative, relevant, and meaningful design. Nothing is more gratifying than creating solutions that grow your business, empower your marketing strategy, influence your customers, and drive up the value of your brand. This passion for our craft and our clients is what has propelled us for over 20 years.\nWe like to invest. We believe branding success is the result of making a smart investment in sound strategy and solid creative. This philosophy is what differentiates us as your creative partner. We immerse ourselves in your brand and invest in you by getting to know your company, your customers, your culture, and helping to identify and provide solutions for your branding, creative, interactive, and marketing needs. \nWe see details. (And the big picture.) Design is all about the details and our passion here never ends. We live in a pixel-perfect, i-dotting and t-crossing world. But this love of the particular does not mean we lose sight of the big picture. We challenge ourselves daily to provide our clients inventive, significant, and valuable solutions that bring important change to your brand.\nWe’re in for the long haul. We’re grateful and proud to say we have become a trusted advisor to many of our clients for over 20 years. We work hard to earn trust and enjoy building long-term relationships with those who understand the value that a solid brand can bring to their organization. \nAnd yes, we love orange. Orange is the color of creativity, joy, expression, warmth, and success. It’s no accident that we love and harness its energy to drive us in every project we undertake.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"1996","locations":[{"headquarters":true,"address":"5230 Carroll Canyon Road","locality":"San Diego","region":"CA","postal_code":"92121","country":"United States","phone":"858.450.1150"}]}