{"id":"175051","name":"Rocketboy Media Inc.","tagline":"Your Online Business Guru and Web Strategy Expert","profile":"/profile/rocketboy-media","website":"http://www.rocketboymedia.com","directory":"web-designers","page":"166","verified":"","description":"At Rocketboy Media we develop complete website and online marketing solutions that will convert leads into sales for your business. We provide our clients with a range of marketing and marketing support services, including website design & development, strategic planning, content writing, marketing communications that include branding, copywriting, graphic design and marketing collateral.\n \nOur objective is to help our clients communicate better with their customers, employees, investors and stakeholders through strategic and tactical marketing programs and integrated marketing communications. We take advantage of our years of experience in strategic market planning, tactical marketing execution and top-shelf design to bring the right marketing programs and tools to bear on your business needs.\nWe have worked with a wide range of clients, that include such businesses as; IT professionals, high-tech manufacturers, interior and architectural designers, accountants, real estate escrow & mortgage companies, law firms and non-profit organizations. \nBeyond simply developing the tools and programs that have helped these companies reach out and connect with their clients, we are also focused on helping our clients achieve their business goals.\nWe achieve this through our proven Rocketboy Media Business Discovery Process™. Through a series of meetings and questions, we'll explore and identify issues in your business that will get you to that \"AH-HA\" moment. With our Rocketboy Media Business Discovery Process, we'll help you determine and find your goals, target market and ideal clients, who your business competition is and how we can create a loyal, valuable client and customer base for your business. We then take all of this valuable information and knowledge and apply it to your on-line and off-line marketing materials.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2001","locations":[{"headquarters":true,"address":"9135 Alabama Avenue, Unit C","locality":"Chatsworth","region":"CA","postal_code":"91311","country":"United States","phone":"818.280.0833"}]}