{"id":"175519","name":"DNA325","tagline":"Creating Teams for the Digital Edge","profile":"/profile/dna325","website":"http://dna325.com","directory":"it-services","page":"58","verified":"","description":"DNA325 is a full cycle R&D development agency. We offer one stop shop for your business grow. With operations spanning Ukraine and CIS, DNA325 allows its clients to hire IT talents quickly and effectively in order to scale their business.\nWe are your local partner for helping with all operations maintenance, including office rent, hiring, HR, legal, accounting to help founders to focus on their business growth.\nWe do Space as a Service unique working environments and ecosystems trusted by companies from USA, Canada, Germany, Israel and other countries\nRecruitment\nOur company provides IT staffing solutions.\nHaving tech and non-tech experts on staff we do our search more effectively giving full reports on the expertise: General Info, Industry Knowledge, Tools & Technologies, Projects\nBusiness Process Outsourcing\nDNA325 BPO consulting services are about finding the best fit for your business, whether it is an improvement of your in-house processes or an outsourced solution. \nCompany Formation\nIf you have an idea to found your startup or open a local office in Ukraine, DNA325 can help with all the business and operational issues from the development of business plan, detailed research of the niche to company registration and corporate procedures support.\nSPaaS\nRent an office on flexible terms for any period of time and get everything you need by one decision. You pay per seat, and get for your team: in/out tracking, private offices, shared space, private phone booth, shared conference rooms, shower, kitchen with tea/coffee/water/biscuits.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2016","locations":[{"headquarters":true,"address":"13785 Research Blvd","locality":"Austin","region":"TX","postal_code":"78750","country":"United States","phone":"512.861.1887"},{"headquarters":false,"address":"","locality":"Odessa","region":"","postal_code":"65000","country":"Ukraine","phone":"+380 97 250 0466"}]}