{"id":"17698","name":"Shilbrook Associates","tagline":"Making business sense of networks and community","profile":"/profile/shilbrook-associates","website":"http://www.shilbrook.com","directory":"directory/mobile-application-developers","page":"92","verified":"","description":"We are platform agnostic but focus on owned communities for customers, members, partners, and employees. We believe that to make an effective, successful social space, functionality is less important than truly understanding your audience members, their needs and their motivations for choosing to spend time on your platform. If you can link your business processes to their key motivations, you can focus your efforts in areas to achieve lasting success.\nShilbrook offers a wide range of services including:\n    Audience research    Workshops with senior management    Interviews and 121s with senior management and department heads    Helping the project sponsor develop the business case    Identification of project champions    Training project champions    Drafting and assisting champions to draft policies, processes and plans to support the community    Advice on configuration of the platform    Recommendations on resourcing the community management    Support on launch    Mentoring the community management\nA key aspect of this is ‘social learning’ – using the platform the client has chosen to work with key project champions (internally, from customer-facing departments, and externally, active members known to be enthusiastic about online engagement), to explore the opportunities and challenges that the platform offers, and to develop the policies, plans and practices that will be needed. These social learning programmes will be tailored to the client, and Shilbrook consultants are continually on hand to prompt, provoke and persuade participants to engage with the topics put up for discussion.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2012","locations":[{"headquarters":true,"address":"1 Marlborough Court, Duke St.","locality":"Oxford","region":"","postal_code":"OX2 0QT","country":"United Kingdom","phone":"44.1865.792053"}]}