{"id":"17726","name":"Prolifics","tagline":"Advise. Innovate. Deliver.","profile":"/profile/prolifics","website":"http://www.prolifics.com","directory":"it-services","page":"236","verified":"","description":"For 35 years, Prolifics has had a single mission—solving customers' business problems with technology solutions by providing expert consulting services and high-value technology enablers. Founded in 1978 in New York City, Prolifics first specialized in building high-performance transactional systems for many of the biggest firms on Wall Street.\nToday with offices throughout North America, Europe and Asia, Prolifics utilizes its wealth of expertise to offer comprehensive business solutions, having worked with over 3000 companies, both domestically and internationally, across a broad range of industries including banking, insurance, government, telecommunications, manufacturing and brokerage.\nOne of the keys to our longevity is the solid relationships we have built with our partners and customers. We seek to be a trusted technology advisor, helping our customers get the most value from their technology investments while decreasing the risk associated with complex software development and deployment.\nIn 2008, Prolifics joined with SemanticSpace Technologies and Arsin Corporation, and in 2013, these three companies united as a single organization, Prolifics, in order to offer clients a full service global delivery model for building custom applications.\nCombining business flexibility and cost competitiveness with excellence in technical skill, professionalism and a commitment to our customers, Prolifics' award-winning solutions build agility into businesses around the world. Our depth of experience delivering secure, end-to-end BPM, Integration, Security, and Content & Collaboration solutions can help you with all aspects of the full project lifecycle including software procurement, architectural advisement, design, development through deployment, testing and administration.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"1,000 - 9,999","founded":"1978","locations":[{"headquarters":true,"address":"24025 Park Sorrento","locality":"Calabasas","region":"CA","postal_code":"91302","country":"United States","phone":"212.267.7722"},{"headquarters":false,"address":"","locality":"New York","region":"NY","postal_code":"10036","country":"United States","phone":"212.267.7722"},{"headquarters":false,"address":"","locality":"Hyderabad","region":"","postal_code":"","country":"India","phone":""},{"headquarters":false,"address":"","locality":"Reading","region":"","postal_code":"","country":"United Kingdom","phone":""},{"headquarters":false,"address":"","locality":"Hamburg","region":"","postal_code":"","country":"Germany","phone":""},{"headquarters":false,"address":"","locality":"London","region":"","postal_code":"","country":"United States","phone":""},{"headquarters":false,"address":"","locality":"London","region":"","postal_code":"","country":"United Kingdom","phone":""}]}