{"id":"17863","name":"Denologix","tagline":"SUCCESS GUARANTEED","profile":"/profile/denologix","website":"http://www.denologix.com","directory":"it-services","page":"37","verified":"","description":"Denologix Inc. | Information Management\nSpecializing in Systems Integration and Visualization, Denologix has provided superior IT Professional Services and Solutions that empower companies to make the right decision.\nDenologix is a Premier Analytics and Information Management company. A recognized industry leader in providing Big Data implementations and management, utilizing leading technologies for Cloud solutions. We help customers to better understand their market, competitors, risks, operations & customers through predictive analytics, data integration and data quality. Our projects have helped our customers Increase Sales, Reduce Costs, Meet Regulatory Compliance, Gain Market Share and focus on Customer Retention, Cross-selling/Up-selling.\nOur Solutions Include:  Data Quality, Data Management, Data Integration, Big Data, Business Intelligence (BI), Master Data Management (MDM), Visual Analytics (VA), Key Performance Indicators (KPI) Analysis Dashboard.\nSupported Technologies: \nR, Apache Hadoop (YARN: Pig: Hive: HBase: Phoenix: Spack: ZooKeeper: Impala: Flume: Sqoop, Oozie: Storm: HDFS), Cloudera CDH, Enterprise Service Bus (ESB) Web Svcs, Java J2EE, .Net, SAS, Oracle, DB2, SAS SPDS, SQL Server, Mysql, PostgreSQL, HTML, CSS, Javascript, Unix, Linux, Windows, MVS Android, iPhone, Blackberry\nKey Partners:  \nSAS, cloudera, Hortonworks, AMSIO, redhat, Canada Post, Smart360°Biz, Oracle, Microsoft\nOur expertise and extensive partnerships in Big Data technologies enable companies to confidently embark on new Big Data solutions or leverage existing initiatives to further enhance ROI. Denologix provides customers Big Data services from project initiation to fully managed and administered Big Data environments. You can count on obtaining quality results for all your analysis needs.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2002","locations":[{"headquarters":true,"address":"161 Bay St - 27th Flr","locality":"Toronto","region":"ON","postal_code":"M5J2S1","country":"Canada","phone":"800.393.1203"},{"headquarters":false,"address":"1230 Avenue of the Americas","locality":"New York","region":"NY","postal_code":"10020","country":"United States","phone":"800.393.1203"},{"headquarters":false,"address":"30 South Wacker Drive - 22nd Flr","locality":"Chicago","region":"IL","postal_code":"60606","country":"United States","phone":"800.393.1203"},{"headquarters":false,"address":"701 West Georgia St - Suite 1500","locality":"Vancouver","region":"BC","postal_code":"V7Y1C6","country":"Canada","phone":"800.393.1203"},{"headquarters":false,"address":"701 Fifth Avenue - 42nd Flr","locality":"Seattle","region":"WA","postal_code":"98104","country":"United States","phone":"800.393.1203"}]}