{"id":"17942","name":"Kuliza","tagline":"We engineer exceptional digital experiences","profile":"/profile/kuliza","website":"http://www.kuliza.com","directory":"directory/mobile-application-developers","page":"71","verified":"","description":"Kuliza is a software development company that builds web, mobile and social experiences for global clients since September 2006. Kuliza's team of agile developers has expertise building scalable web apps, innovative social and mobile apps, high-performing media and e-commerce sites and smart big data apps. \nOfferings\nOur offerings include:\nEnterprise consumer facing applications: Today, enterprises require robust & scalable consumer facing applications. Kuliza provides a winning mix of UX, design and backend engineering to create enterprise applications that your consumers will love\nE-commerce applications: Kuliza designs and engineers end-to-end E-commerce applications to boost online sales\nNews and media publishing engines: Kuliza builds next generation news and media publishing engines to give consumers digital destinations for a second screen experience\nEnterprise mobility: Increasingly as users go mobile everyday, Kuliza assists enterprises get mobile ready in order to enable their products and digital destinations. \nProduct development for venture backed startups: Kuliza has helped multiple startups build and enhance products as their technology partner, while they focus on core competencies.\nKey Technologies\nUI Development: HTML5, CSS3, Angular JS, jQuery\nWeb Development: Ruby on rails, Python, Django, Drupal, Java, Node JS, Spring, Bottle, Hibernate, Play\nMobile App Development: Android, iOS, WIndows 8\nDatabases: MySQL, SQL Server, Mongo DB, Oracle, Amazon Simple DB\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"11/3 Bommanhalli","locality":"Bangalore","region":"","postal_code":"560068","country":"India","phone":"+91-9663899150"},{"headquarters":false,"address":"","locality":"Ahmedabad","region":"","postal_code":"320008","country":"India","phone":""},{"headquarters":false,"address":"","locality":"New Delhi","region":"DL","postal_code":"110012","country":"India","phone":""}]}