{"id":"17991","name":"Veepal","tagline":"Think Offshore, Think Us","profile":"/profile/veepal-it-services","website":"http://www.veepal.com","directory":"directory/mobile-application-developers","page":"25","verified":"","description":"Veepal is a diversified IT services company providing its services to the entire spectrum of businesses worldwide.\nOur competencies lie in setting up dedicated offshore software development teams for Custom Software Development, Web Application Development, Web Site Design and Development, Google Optimization and Marketing, Network Infrastructure Management, E-commerce Development, Application Maintenance, Quality Assurance & Testing, and Mobile Application Development including iPhone Application Development, iPad Application Development, Android Application Development and iWatch app development. We make an offshore development model work for you by using our proven Software Development Methodology.\nWe, at Veepal, understand that offshore software development from India is a key factor in increasing the overall productivity, quality, and cost-effectiveness of your organization. We are committed to adding real value to your business in terms of quality and cost effectiveness. We have an excellent track record of providing business solutions to small and medium enterprises as well as large corporations from various industries. With a diverse and rich experience in providing offshore software development and severe quality standards ensure us to develop solutions that give your business exclusivity over other competitors.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"322, Kalasagar Shopping Hub, Ghatlodia","locality":"Ahmedabad","region":"GJ","postal_code":"380061","country":"India","phone":"91.886.132.5406"},{"headquarters":false,"address":"1944, Silverwood Avenue","locality":"Mountain View","region":"CA","postal_code":"94043","country":"United States","phone":"702.518.6112"}]}