{"id":"180118","name":"GCS Agents","tagline":"Timely Contact. Timeless Value.","profile":"/profile/gcs-agents","website":"https://www.gcsagents.com","directory":"bpo","page":"3","verified":"","description":"GCS is an outsource contact center organization that focuses on delivering effective communication with your customers. We manage voice and self-service channels to meet your required service levels in three unique ways:\n1) Careful selection and on-going training of our associates with our F.E.E.D program. Our agents have the right personality to please your customer.\n2) Effective training in the art of empathy and soft skills to build connections with your customer that retains and builds your brand. Our agents have the right skills to handle all types of calls.\n3) Process driven management and smart use of technology to meet demand at the lowest possible cost. You achieve customer service goals while staying in budget.\nThe GCS team is led by contact center and BPO experts. Each of our area leaders has spent years in the customer communication business and have honed the management process. We focus on personalized communication - at scale. Each customer receives an individual focus, and we do it tens of thousands of times a day, achieving the same results.  \nWhile our primary business is managing contact center and back-office operations for our clients, we share our knowledge and expertise through consulting and training services too.\nWe provide contact centers for both live and automated voice, chat, text, email, snail maile, video and walk-in agents. Multiple languages. Back office services include any process done in a workstation environment. This includes IVR management, fulfillment, image review.\nContact us today to discuss your needs. Together we will decide the best approach to cost-effectively meeting your needs.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"250 - 999","founded":"2001","locations":[{"headquarters":true,"address":"118 S Main St","locality":"Salisbury","region":"NC","postal_code":"28144","country":"United States","phone":"1.704.647.9621"},{"headquarters":false,"address":"","locality":"New York","region":"NY","postal_code":"10001","country":"United States","phone":""}]}