{"id":"18072","name":"DM STAT-1 Consulting","tagline":"Statistics-DataMining-Machine-Learning","profile":"/profile/dm-stat-1-consulting","website":"http://dmstat1.com","directory":"it-services","page":"43","verified":"","description":"DM STAT-1 Consulting's Founder and  President Bruce Ratner, Ph.D., The Significant StatisticianSM ,has made the company the ensample for Statistical Modeling & Analysis, and Data Mining, and Machine-learning Data Mining in the DM Space. DM STAT-1 specializes in all standard statistical techniques, and methods using machine-learning/statistics algorithms, such as its patented GenIQ Model, to achieve its clients' goals – across industries including Direct and Database Marketing, Ba\nnking, Insurance, Finance, Retail, Telecommunications, Healthcare, Pharmaceutical, Publication & Circulation, Mass & Direct Advertising, Catalog Marketing, e-Commerce, Web-mining, B2B, Human Capital Management, Risk Management, and Nonprofit Fundraising. \nBruce’s par excellence consulting expertise is apparent, as he is the author of the best-selling books Statistical Modeling and Analysis for Database Marketing: Effective Techniques for Mining Big Data, and Statistical and Machine-Learning Data Mining: Techniques for Better Predictive Modeling, Analysis of Big Data. Bruce assures his clients' marketing decision problems are solved with the optimal problem-solution methodology; rapid start-up and timely delivery of project results; and, client projects are executed with the highest level of statistical practice. He is an often-invited speaker at public industry events, such as the SAS Data Mining Conference, and private seminars at the request of Fortune Magazine’s Top 100 Companies. \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"1994","locations":[{"headquarters":true,"address":"","locality":"North Woodmere","region":"NY","postal_code":"","country":"United States","phone":"516-791-3544"}]}