{"id":"18193","name":"Cadient Group","tagline":"Results in Action","profile":"/profile/cadient-group","website":"http://www.cadient.com","directory":"directory/mobile-application-developers","page":"63","verified":"","description":"The 2012 and 2013 business curve has been exciting to our core vision for the next generation of the company. With our core mindset of Results in Action, we have built a company equipped to partner with our customers to revise their commercial model to realize the full potential of digital, mobile and social engagement.\nOver the past 20 months, we have achieved significant milestones that have fueled our growth, expanded our capabilities, added operational agility and fostered a culture of actionable invention.\nStrategic and performance highlights for Cadient Group in 2012-13 include:\nExpansion and diversification of our life sciences portfolio to include pharmaceuticals, specialty medicines, biotech, medical device, consumer health, sustainability and chemicals markets \nDevelopment of mobile first, responsive design capabilities; implementation of multi-channel content marketing initiatives across our portfolio; \nGround-breaking utilization of social media channels and tools to support community dialogue, enhance patient education and adherence to treatment and to establish brand and company voice within the social media ecosystem; \nMarket leadership in visual storytelling to enhance awareness and education related to complex subject matter (e.g. clinical/scientific information, diseases awareness, novel treatment options); \nAccelerated release of our full REVEAL advanced analytics platform and engagement of first enterprise-level customers; \nContinued demonstration of our leadership in orchestrating a new model for product launch within life sciences verticals.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2002","locations":[{"headquarters":true,"address":"72 E Swedesford Rd","locality":"Malvern","region":"PA","postal_code":"19355","country":"United States","phone":"484.351.2800"},{"headquarters":false,"address":"127/1b/1, Plot No 1, Gopal House","locality":"Karve Road, Kothrud, Pune","region":"","postal_code":"411029","country":"India","phone":"01.610.862.5453"},{"headquarters":false,"address":"","locality":"New York","region":"NY","postal_code":"10001","country":"United States","phone":""}]}