{"id":"18213","name":"Crawford Technologies","tagline":"Streamlining High-Value Document Management","profile":"/profile/crawford-technologies","website":"http://www.crawfordtech.com","directory":"it-services","page":"362","verified":"","description":"Our goal at Crawford Technologies is to implement a streamlined document management solution that meets the specific needs of our customers. Our expertise is in evaluating, analyzing and designing a solution that meets the requirements of a customer’s high-volume enterprise workflow environment. We specialize in the automation of workflow processes after the creation or composition of the document.\nThis process automation can include reprints, whitespace management, value-add content such as transpromo and QR codes, as well as, tracking and reporting throughout the entire post document creation and delivery process.\nFor organizations with a focus on Multi-Channel Customer Communications, CrawfordTech has leading solutions for delivery and preference management into a multitude of delivery channels including digital mailboxes, custom e-presentment systems, email delivery, mobile and alternative formats such as PDF/UA, Braille, Large Print, Audio and eText for those customers with vision trouble or loss.\nIn addition to our workflow and multi-channel capabilities, we house technology solutions that interface with some of the largest document archive and Enterprise Content Management (ECM) solutions like EMC Documentum, IBM FileNet, Content Manager OnDemand (CMOD), CM8, P8 and Microsoft SharePoint. With our company’s expertise in output management, we bring a unique ability to archive print streams for long term storage meeting corporate and regulatory compliance guidelines. This capability also adds the ability for organizations to leverage their archived data with superior ability to retrieve transactional documents, reports and other documents and output them for electronic delivery, print or for use by other internal departments such as Customer Service.\nCrawford Technologies has the solutions to convert, manage, re-engineer, produce, deliver and track all of your customer communications in a streamlined and robust methodology.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"1995","locations":[{"headquarters":true,"address":"60 St. Clair Avenue East, Suite 1002","locality":"Toronto","region":"ON","postal_code":"M4T 1N5","country":"Canada","phone":"1-866-679-0864"}]}