{"id":"18323","name":"Arke","tagline":"Marketing Technology Consultancy","profile":"/profile/arke","website":"http://www.arke.com","directory":"web-developers","page":"6","verified":"","description":"Interesting Projects:\nMicrosoft & Sitecore - Hired Arke to build the next generation marketing showcase for the Microsoft Technology Centers (MTC) based on Sitecore 8, MSCRM, SharePoint.\nSitecore - We have developed a module that enables any site regardless of technology platform to be immediately manageable by Sitecore.  We sold this module to Sitecore in 2014 and it is now the Federated Experience Module released by Sitecore at 2014 Sitecore Symposium.  We continue to work closely with that module team to provide them enhancements we are creating for our customers.\nMachine Learning - Leveraging the Sitecore xDB platform we have engaged with the Microsoft Azure ML platform and Georgia Tech Research Institute to create best of breed algorithms for predicting clicks, engagement, product recommendations, and overall help our clients collapse the conversion funnel.\nMission: Bridge the gap between marketing theory and marketing reality. We take on the problems our customers consider impossible and we create amazing results. With a focus on how martech strategy (people, processes, data and technology) can create drastic improvements in prospect conversion, customer engagement, customer service and any other aspects of customer communication.\nWe provide MarTech Strategy and Implementation around:\nContent Management Systems; Sitecore, \nCRM Systems; Salesforce.com, Dynamics CRM\nCommunications; Marketo, Eloqua, IBM\nData Analytics; Sitecore DMS, Google Analytics, Lytics\nSitecore Staff:\nAndy Uzick - Longest Standing US Technical MVP\nMargaret Wise - Digital Strategy MVP \nPatrick Perrone - Technical MVP\nNeil Killen - Technical MVP\nChris Spears - Digital Strategy MVP\nCarlos Rodriguez - Technical MVP\nEric Stafford - Technical MVP\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"3400 Peachtree Rd NE Suite 200","locality":"Atlanta","region":"GA","postal_code":"30326","country":"United States","phone":"4048123123"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Italy","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Brazil","phone":""}]}