{"id":"18324","name":"Joss Technology (Acquired by AIM Software)","tagline":"Rethink Entity Data","profile":"/profile/joss-technology-acquired-aim-software","website":"http://www.josstechnology.com","directory":"it-services","page":"30","verified":"","description":"Joss Technology is an innovative solutions provider focused on entity data management. Our platform was created in response to the increased focus on regulatory compliance, risk management, and operational efficiency. Financial firms in particular need to have a clear picture of the entities they interact with and are exposed to. Entities can be brokers, clients, counterparties, custodians, issuers...\nHowever, institutions often struggle to build a complete and accurate picture due to internal data silos, duplicate records and data inaccuracies. We provide a comprehensive suite of data quality and governance tools that enable firms to build and maintain a 360-degree view of all their entities and achieve greater control over their data.\nOur Entity Data Management Solution (EDMS) platform contains two main modules: \n1) Data Quality and Reconciliation: we enable firms to aggregate data from various silos (internal and/or external sources), normalize it (converters), map it, match it (using proprietary fuzzy matching technology), cleanse it and then create a Master Record (aka “Golden Copy” or “Single Version of the Truth”).\n2) Data Maintenance & Entity Lifecycle: our platform can be the centralized entity data repository (with all the relevant static data including geolocation information, ratings, industry classifications, contacts, legal documentation,…). Workflows can be configured to ensure high-quality data upstream as well as automate data integration and processing (e.g. corporate action events). Real-time and/or batch connections are provided to downstream systems to ensure data consistency and proper data governance.\nOur tools can be deployed in-house or be accessed under a SaaS model. They were designed to be non-intrusive and can be integrated with your existing architecture. We work with both System Vendors and Data Vendors to make integration seamless and deliver immediate benefits.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2010","locations":[{"headquarters":true,"address":"349 Fifth Avenue","locality":"New York","region":"NY","postal_code":"10016","country":"United States","phone":"+1.646.797.3000"}]}