{"id":"18372","name":"Fractal Analytics","tagline":"Only a free mind can fly.","profile":"/profile/fractal-analytics","website":"http://www.fractalanalytics.com","directory":"it-services","page":"512","verified":"","description":"Fortune 500 companies recognize analytics is a competitive advantage to understand customers and make better decisions. We deliver insight, innovation and impact to them through predictive analytics and visual story-telling.\nWe are 600 people spread across globe, in San Mateo, New Jersey, Singapore, UK, Dubai, Mumbai, and Delhi.  We service CPG, retail, financial services, insurance, technology and telco companies, and breaking into life sciences. \nOur mission is to help companies move toward higher levels of sophisticated and institutionalized use of analytics. We deliver analytics services in the form of either programs or Global Analytics Partnerships (GAP).\nWe help companies institutionalize analytics and solve problems such as optimize marketing decisions, understand and improve the lifetime value of customers, optimize forecasting and supply chain, empower business people to consume analytics with visual storytelling. We partner with our clients to ensure analytics are implemented and operationalized to drive results. Ultimately we seek to make analytics a centralized way of making decisions for our clients, where analytics is a lens in all things.\nOur Customer Genomics™ solution helps marketers learn complex customer behavior at an individual level. Its proprietary pattern recognition and machine-learning algorithms learn from every transaction and customer interaction, including social media, to help marketers build a complete view of individual customers across attitudinal and behavioral dimensions.\n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"1,000 - 9,999","founded":"2000","locations":[{"headquarters":true,"address":"Harborside 3 210 Hudson St, Suite 803","locality":"Jersey City","region":"NJ","postal_code":"07311","country":"United States","phone":"+1 (650) 378 1284"}]}