{"id":"18403","name":"BOLD! Technologies","tagline":"Dream | Develop | Deploy","profile":"/profile/bold-technologies","website":"http://www.boldtech.co","directory":"directory/mobile-application-developers","page":"13","verified":"","description":"We’re BOLD! Technologies, an innovations company specializing in mobile app and web development, navigation tools and digital platforms. And we have a valuable story to tell.\nCreating a unique initial niche working with startups, some in Florida, others across the nation, and now expanding into international markets, BOLD! leverages and optimizes the learnings of each success and occasional failure to your advantage.  \nThanks to wonderful relationships and networks, we’ve been privileged to work with progressively larger companies, some steeped in tradition and some looking to reimagine their futures. Many we’ve been with since the beginning. Recognizing these business stages helps us orient the development roadmap. \nFrom start-ups to enterprise level, innovators to re-imagining the most seasoned of brands, that’s where we start. Among us, we’ve created, experienced, planned and collaborated on far reaching technologies. Not all  deployed, but most do, because among us and together, we have the talent, technology and business acumen to see you succeed.\nOur insights, experience and vision help empower you to think, act and craft your future using innovative, scalable, cutting-edge technology solutions.\nWe deliver and work with you every step of the way from concept to go-to-market. All the while understanding it involves a lean budget and high expectations. And that doesn’t change, no matter where you are in the business lifecycle. \nSo whether we help you in the very beginning, contribute to your next iteration, help you explore and onboard new technologies, we want you to be unimaginably successful, and will help you accomplish your goals. Best of all, we recognize that it’s never over, even when it is.  \nWe help you achieve your goals, monitor success and help you scale your business as it grows and evolves through its life stages. \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"163 E. Morse Blvd, Suite 200","locality":"Winter Park","region":"FL","postal_code":"32789","country":"United States","phone":"407-995-6585"}]}