{"id":"18430","name":"Rogomi, Inc.","tagline":"High-quality mobile apps -- it's what we do best","profile":"/profile/rogomi","website":"http://www.rogomi.com","directory":"directory/mobile-application-developers","page":"116","verified":"","description":"Rogomi, Inc. (formerly Numlock Solutions Co.) is a Philippine-based corporation which commenced operations in 2009 and is focused on enabling enterprises to tap the power of mobile technologies through iPhone, iPad or Android applications. From a three-man startup developing and releasing mobile applications under its own brand, the company moved to its current office and started designing and developing custom mobile applications for enterprises in November 2010.\nWith a current team of 11 mobile developers and designers, it has helped enterprises, from startups to some of the world's leading global companies, plan, design, develop, test and publish mobile applications.\nPrior to August 2013, Rogomi had been successfully launching its own in-house apps on the App Store and Google Play. The company's first iOS app, WalletWhiz, was released on the Apple App Store in May 2009 as the first budget calendar for the iPhone and its first Android app, StreetSmart, won the Globe Telecom Challenge for Android in August 2010. MindMash was the first Philippine-made app for the iPad listed on the App Store in April 1, 2010.\nIn August 2013, the company dissolved Numlock Solutions Co. as a partnership and incorporated a new company named Rogomi, Inc. to take over its operations and to focus solely on helping enterprises successfully publish and launch their own mobile applications.\nRogomi's principal office is located at 909 One Corporate Centre, Doña Julia Vargas Ave. corner Meralco Ave., Ortigas Center, Pasig City 1605 Philippines.\nThe company has one satellite office located at 2/F Lucky Plaza Bldg., Burgos St., La Paz, Iloilo City 5000 Philippines.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"909 One Corporate Centre,, Doña Julia Vargas Ave. cor. Meralco Ave.","locality":"Pasig City","region":"","postal_code":"1605","country":"Philippines","phone":"+63 2 584 6312"}]}