{"id":"18489","name":"Infrared5","tagline":"Yeah, we can build that","profile":"/profile/infrared5","website":"http://www.infrared5.com","directory":"directory/mobile-application-developers","page":"5","verified":"","description":"Located in Boston, Infrared5 is a interactive studio that specializes in the creation of innovative experiences, applications and games for mobile platforms and the Web.\nAn exceptionally curated team of developers, designers, problem solvers, gamers and all-around creative personalities, we are passionate about designing sophisticated experiences and developing innovative technology solutions. We dedicate our days to collaborating with our clients to solve their business needs, and find inspiration in the challenges we meet along the way. From design to development, our services include creating websites, interactive applications, games, collaboration tools, 3D experiences, streaming media solutions and pretty much any digital experience you can imagine. If you're looking to combine technologies for a unique need or working to bring an imaginative experience to life, you're at the right place.\nInfrared5’s team leads development of the open source Red5 media server. Now we offer mobile and modern browser support with Red5 Pro, which includes streaming SDKs and a fully scalable version of the server. Our tools empower developers to easily and seamlessly integrate audio, video, and data streaming into their own apps and build unique second screen experiences. If you're trying to create something ground-breaking, that stretches the limits of technology — we are here to help you. Together, yeah, we can build that.\n \nSpecialties\nHMTL5, Flex, Java, Red5, Flash, Unity3D, Shaders, Web and mobile application development, Gaming, Second-screen technologies, Videostreaming and real-time communications\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2006","locations":[{"headquarters":true,"address":"500 Amory Street, #2","locality":"Jamaica Plain","region":"MA","postal_code":"02130","country":"United States","phone":"617.442.4151"}]}