{"id":"18649","name":"Aware Web Solutions","tagline":"It's Your Web.","profile":"/profile/aware-web-solutions","website":"http://www.awareweb.com","directory":"directory/mobile-application-developers","page":"73","verified":"","description":"Aware Web Solutions is a leading implementer of web frameworks for mid-to-large sized organizations representing a broad range of industries. Leveraging our strategic, creative and marketing insights, we deliver robust and purposeful websites using industry-leading toolsets. From clearly defining your content management system needs to tool selection, implementation and training, we provide a consistent and proven methodology around industry best practices.\nSome Serious Sitecore Focus\nAware has been an award winning Sitecore Certified Partner since 2006.  With over 75 successful deployments for over 50 clients under our belt, Aware’s team of Sitecore experts has proven experience with Sitecore’s full suite of products.\nFrom UX design to custom Sitecore development to web strategy to customer engagement, Aware specializes in full life-cycle, soup-to-nuts Sitecore deployments.  Our vast experience also includes complex redeployments as well as supporting legacy Sitecore platforms.\nOur 40+ Sitecore practice group includes nearly 20 Sitecore-certified developers and 3 Sitecore MVPs who have been recognized for their outstanding Sitecore technical expertise. Over the past 15 years we’ve had the opportunity to work with a long roster of mid to large-sized clients from across the globe and spanning a wide range of industries. We have been honored to receive numerous awards throughout the years including 3 Sitecore Site of the Year awards, 2 Quarterly Outstanding Solution Awards and all 6 Sitecore Partner Specializations.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1998","locations":[{"headquarters":true,"address":"1660 South Highway 100, Suite 500","locality":"Minneapolis","region":"MN","postal_code":"55416","country":"United States","phone":"800.783.8919"}]}