{"id":"186835","name":"Bolin Marketing","tagline":"We are a creative brand experience agency.","profile":"/profile/bolin-marketing","website":"http://www.bolinmarketing.com","directory":"web-designers","page":"1232","verified":"","description":"Bolin is a fiercely independent, Minneapolis based creative brand experience agency focused on transforming and redefining brands for the modern world. We believe in emotionally and authentically engaging and inspiring consumers in a way that leaves positive and long-lasting impressions during every touch-point on their brand engagement journey. We focus on the intersection of insights, strategy, and design.\nBolin has developed a proprietary process and approach to insights gathering and brand experience architecture that combines analytical data with our DISTIL research methodology to produce effective brand positioning, marketing plans, campaigns, and strategies that can be proven and measured. We use a boutique approach to solving creative challenges, backed by senior leadership with a long history and pedigree in the agency world.\nWe are supported by our Tribe Global network, giving us scale to manage projects on a local, national and international basis. We specialize in brand and digital transformation efforts, backed by a full-spectrum of services from research, brand strategy, creative development, user experience design, amplified by media and social connections planning.\nThe Bolin CONNECTIONS team manages near real-time programmatic audience activation and media strategies while our Social DISPATCH team works to monitor, engage, and solve customer issues across all digital channels. Our 2,000+ sq-ft content production STUDIO is staffed with professional photographers, filmmakers, and content producers to create and distribute branded content as real-time responses to customer needs.\nOur goal is to efficiently and effectively provide a high quality, fully integrated set of services to our client partners, delivered with a collaborative and transparent approach. \n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1950","locations":[{"headquarters":true,"address":"2523 South Wayzata Blvd. Suite 300","locality":"Minneapolis","region":"MN","postal_code":"55405","country":"United States","phone":"612.236.0720"}]}