{"id":"18788","name":"Horizontal Integration","tagline":"Digital Marketing, Technology & Strategic Staffing","profile":"/profile/horizontal-integration","website":"http://www.horizontalintegration.com","directory":"web-developers","page":"10","verified":"","description":"Horizontal Integration is a leading Sitecore Platinum Implementation Partner and one of Sitecore’s original North American partners. Having worked with Sitecore since they entered the North American market in 2005, Horizontal Integration offers unmatched depth and breadth of experience with the most complex, enterprise-level Sitecore implementation and enhancement programs.\nOur in-house digital marketing and UX experts work hand in hand with our technologists to deliver custom, ROI-based solutions that truly unlock the context marketing power of the Sitecore Experience Platform. Sitecore is all we do, and we do it better than anyone.\nHorizontal Integration’s sweet spot is designing enterprise-scale, Sitecore-based solutions for mid- and large-size businesses. We have many Fortune 500 clients in our portfolio and are frequently recommended by Sitecore to businesses seeking help with highly complex digital ecosystems. Our experience ranges from health care to life sciences to financial services to B2B and retail ecommerce. We build solutions to support corporate sites, commerce sites, intranets, extranets, portals, campaign engines, microsites and more.\nOur esteemed team—including 13 MVPs and over 60 Sitecore-certified developers—has implemented hundreds of enterprise-level Sitecore projects. \nHorizontal Integration also has a Staffing Agnecy that provides temporary and permanent IT, Digital and Creative staffing needs, with over 500 active consultants. Horizontal Integration is headquartered in Minneapolis, MN, with additional offices in Denver, Dallas and Vadodara, India.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"2003","locations":[{"headquarters":true,"address":"1660 Highway 100 South, Suite 200","locality":"Saint Louis Park","region":"MN","postal_code":"55416","country":"United States","phone":"612.392.7580"},{"headquarters":false,"address":"2000 South Colorado Boulevard, Annex 305","locality":"Denver","region":"CO","postal_code":"80222","country":"United States","phone":"612.392.7580"},{"headquarters":false,"address":"20 W Kinzie Street","locality":"Chicago","region":"IL","postal_code":"60654","country":"United States","phone":"312.347.7051"},{"headquarters":false,"address":"Chitrakut Complex 2nd Floor / Bakul Society-3 Opp. Vodafone Store, Natubhai Circle","locality":"Vadodara","region":"","postal_code":"390015","country":"India","phone":"+91.265.232.3272"},{"headquarters":false,"address":"5080 Spectrum Drive, Suite 800E","locality":"Addison","region":"TX","postal_code":"75001","country":"United States","phone":"214-446-5441"}]}