{"id":"187958","name":"Brickman Marketing","tagline":"Jump Start Your Business Success!","profile":"/profile/brickman-marketing","website":"http://www.brickmanmarketing.com","directory":"agencies","page":"15","verified":"","description":"Wendy Brickman, President of Brickman Marketing, moved from Los Angeles to Monterey and established Brickman Marketing in 1990. Wendy has an extensive background in the areas of publicity, advertising, strategic collaborations, social media, content marketing and market research. Since launching her firm, Wendy has worked with hundreds of local and national clients on cost-effective marketing campaigns.\nBased on the scope of the client project, she works one on one with the client or teams up with some colleagues to accomplish marketing and public relations goals.\nWendy worked in the management training film area and also held management positions in the home video industry at Paramount Home Video, Media Home Entertainment and Pacific Arts Video. She holds an MBA in Marketing/Management from Loyola Marymount University in Los Angeles, an M.A. in Broadcast Journalism from University of Southern California, and a B.A. in English from the U.C. Berkeley. She is a graduate of Leadership Monterey Peninsula and the Leadership Santa Cruz County.\n \nShe is the is the winner of four Business Excellence Awards from the Monterey Peninsula Chamber of Commerce and a Small Business Advocate of the Year Award from the California Chamber of Commerce. Wendy was the Woman of the Year by the Professional Women's Network of the Monterey Peninsula, and one of the Top Women in Monterey County in by the Monterey County Commission on the Status of Women.\n \nShe has served on numerous Boards of Directors, including the Monterey Peninsula Chamber of Commerce, Development Executives Network, Professional Women’s Network, Monterey History and Art Association, and others. Wendy has taught at California State University Monterey Bay and Golden Gate University.  \n \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"Undisclosed","num_employees":"Freelancer","founded":"1990","locations":[{"headquarters":true,"address":"395 Del Monte Center","locality":"Monterey","region":"CA","postal_code":"93940","country":"United States","phone":"831-633-4444"}]}