{"id":"19026","name":"Last Call Media","tagline":"Digital Experiences for Web and Mobile","profile":"/profile/last-call-media","website":"http://lastcallmedia.com","directory":"web-developers","page":"4","verified":"","description":"Last Call Media is a digital consultancy that delivers engaging solutions that assist and support organizations such as governments and municipalities, educational institutions, enterprise companies, and nonprofit organizations around the world working to improve their communities. As a fully distributed team, LCM has a successful history of working with educational institutions, enterprise companies, and nonprofit organizations around the world.\nSince our founding in 2009, we made a name for ourselves by being “good at the hard stuff” in web development, which provided a foundation upon which to add expert user experience and design services. Together with our clients, we strive to create brand identities and digital platforms at the forefront of the digital media economy, following best practices and adhering to industry standards from strategy to deployment. Our team has extensive experience in the development and deployment of integrated digital solutions for complex, real-world problems.\nAs our reputation has grown, we are now often also the first call. We retain our name, Last Call, because that is our commitment. When you call us is up to you, but our mission is always to be there, to listen, to adapt, and to deliver. We hold you, our client, as our priority in this relationship. \nLastly, Last Call Media prides ourselves on our sense of business empathy: the ability to understand your core organizational goals and to realize them in the real-world ways in which your target audiences can connect. We seek to create an understanding of the users of the site, and how our work will ideally improve their experience and deliver tangible business outcomes.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"PO Box 1600","locality":"Northampton","region":"MA","postal_code":"01061","country":"United States","phone":"888-788-7177"},{"headquarters":false,"address":"","locality":"New York","region":"NY","postal_code":"","country":"United States","phone":"888-788-7177"}]}