{"id":"190958","name":"Hinduja Global","tagline":"Partnering for Better Outcome.","profile":"/profile/hinduja-global","website":"https://www.teamhgs.com","directory":"bpo","page":"39","verified":"","description":"HGS is a leader in optimizing the customer experience and helping our clients to become more competitive. HGS provides a full suite of business process management (BPM) services from traditional voice contact center services and transformational DigiCX services that are unifying customer engagement to platform-based, back-office services and digital marketing solutions.\nBy applying analytics, automation, and interaction expertise to deliver innovation and thought leadership, HGS increases revenue, improves operating efficiency, and helps retain valuable customers. HGS expertise spans the telecommunications and media, healthcare, insurance, banking, consumer electronics and technology, retail, and consumer packaged goods industries, as well as the public sector. HGS operates on a global landscape with around 44,200 employees in 68 worldwide locations delivering localized solutions. For the year ended 31st March 2017 HGS had revenues of US$ 555 million. HGS, part of the multi-billion dollar Hinduja Group, has more than four decades of experience working with some of the world’s most recognized brands.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10,000+","founded":"Undisclosed","locations":[{"headquarters":true,"address":"Hinduja House, 171, Dr. Annie Besant Road, Worli,","locality":"Mumbai","region":"","postal_code":"400 018","country":"India","phone":"022.2496.0707"},{"headquarters":false,"address":"105 College Road East, 2nd Fl,","locality":"East Princeton","region":"NJ","postal_code":"08540","country":"United States","phone":"609.759.5201"},{"headquarters":false,"address":"12120 Rojas, Suite A,","locality":"El Paso","region":"TX","postal_code":"79936","country":"United States","phone":"915.791.7900"},{"headquarters":false,"address":"HGS Cyberpark, 86 E. Rodriguez Jr. Ave., Brgy. Ugong Norte, Libis,","locality":"Quezon City","region":"","postal_code":"1110","country":"Philippines","phone":"632.434.5130"},{"headquarters":false,"address":"7/F Aeon Centre, Filinvest City, Blk. 45, Lot 2-3, Alabang-Zapote cor. North Bridgeway,","locality":"Muntinlupa City","region":"","postal_code":"1781","country":"Philippines","phone":"632.628.9661"}]}