{"id":"190952","name":"MTBC","tagline":"A Unique Healthcare IT Company.","profile":"/profile/mtbc","website":"http://www.mtbc.com","directory":"bpo","page":"23","verified":"","description":"MTBC is a healthcare information technology solution provider that offers physician practices a comprehensive product portfolio of fully integrated WebEHR, revenue cycle and practice management solutions and other related business services including transcription and data management.\nOur entire product portfolio-along with native mobile applications-functions as a cohesive, single-database platform to help healthcare providers, improve their financial performance and ultimately transform their medical practice into a successful business enterprise.\nWe serve an expanding array of diverse healthcare entities and our clients are spread across the healthcare continuum -from single physician, medium sized practices to independent physician associations-which is a testament to the functionality and flexibility of our core solutions. We have partnered with a variety of healthcare organizations to extend our reach to 40+ states.\nOur technological solutions and related business services can aid physician practices to cost-effectively and successfully meet regulatory challenges and prosper amidst a rapidly shifting healthcare industry environment.\nWe consistently innovate to keep pace with a global healthcare environment that enables transformational change in healthcare through technology.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"1,000 - 9,999","founded":"1999","locations":[{"headquarters":true,"address":"7 Clyde Road,","locality":"Somerset","region":"NJ","postal_code":"08873","country":"United States","phone":"732.873.5133"},{"headquarters":false,"address":"31 W 34th St, Rm 7072,","locality":"New York","region":"NY","postal_code":"10001","country":"United States","phone":""},{"headquarters":false,"address":"5501 Lyndon B Johnson Freeway, Suite 250,","locality":"Dallas","region":"TX","postal_code":"75240","country":"United States","phone":""},{"headquarters":false,"address":"Office No. 55 1/1 Demasu Center, Kumaran Ratnam Road,","locality":"Colombo","region":"","postal_code":"02","country":"Sri Lanka","phone":""},{"headquarters":false,"address":"106-A/1, Block A, Satellite Town, Murree Road,","locality":"Rawalpindi","region":"","postal_code":"46000","country":"Pakistan","phone":""}]}