{"id":"192076","name":"Communication Crafts","tagline":"THE TEAM NEXT DOOR!","profile":"/profile/communication-crafts","website":"http://www.communicationcrafts.com","directory":"directory/mobile-application-developers","page":"27","verified":"","description":"Meet Communication Crafts- The team next door!\nEstablished in 2005, Communication Crafts caters to an enviable list of clients across domains and geographies. Our services portfolio spans across arenas as diverse as Films, Design, Branding, E-commerce, Social Media, Web Development, Software, Mobile Apps, Online Marketing and 3D Architectural walkthroughs.\nHere’s why our clients love us- We follow transparent work practices and provide cost-effective solutions that are very to-the-point. We have a client-centric work model that puts client needs right at the top.\nThe work culture at Communication Crafts is lively and lithe. We love what we do, and maybe, that’s the reason we do it so well! CC’s as an exciting place to work at- for innovative, passionate, focused talent and energetic people wanting to grow at a fast pace.\nKey Strengths\n• A potent mix of innovation + technology\n• Young and passionate team with diverse capabilities\n• End-to-end solutions under one roof\n• Quick response and very less turn-around time\n• Always just a phone call away!\nSpecialties\nTechnology Products Development, IT and Software Solutions, E-Commerce Services, Mobile Application Development, Creative & Technology Resources, Video & Multimedia Productions, Cloud Ready Web Apps, IOT Based Solutions\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"","locality":"Ahmedabad","region":"GJ","postal_code":"380006","country":"India","phone":"+1 312 212 3563"},{"headquarters":false,"address":"Leeward, 24 Montserrat Road,","locality":"Hampshire","region":"","postal_code":"PO13 9LT","country":"United Kingdom","phone":"+44 02071939641"}]}