{"id":"192181","name":"EDENLAB","tagline":"Fintech, Medtech, Blockchain custom development","profile":"/profile/edenlab","website":"https://edenlab.com.ua","directory":"directory/mobile-application-developers","page":"78","verified":"","description":"Edenlab is a boutique software and product development company with a primary focus on Fintech, Blockchain, and Medtech.\n\nWe apply our experience & knowledge in designing, architecting, and developing sophisticated & high secured products, working as external RnD and product development team. On top of the development, our strong team of Architects and Business analysts brings tremendous business expertise that significantly helps us effectively transform our client's business ideas into robust software solutions.\nFintech is our core domain, given our deep understanding of the business side of things, we know how financial business works, relations between all players, what tools you can apply to what customer needs. Among our customers are Mastercard Europe, European loan originators, and major Ukrainian banks.\nThe second our area of expertise is a MedTech, and here we are proud of our e-health project. Its a Medical country-wide information system for the Ukrainian government. The system handles millions of accounts and tens of millions of personal records, and it is purposed to move all the medical documentation from offline to online in the entire country, this is a massive project that is a part of our country's medical reform and funded by a group of international donors including USAID. We developed the system according to HL7/FHIR standards.\nThe other focus of ours is the blockchain. It is one of our core competencies, specifically, such areas as fintech, MedTech, and alternative energy. Our team possesses a range of such skills as Ethereum Dapps and private blockchain development as well as an application of Tendermint, HyperLedger, Quorum, and other. We work with blockchain technology since 2015.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2014","locations":[{"headquarters":true,"address":"33 T. Shevchenko blvd, 11th floor","locality":"Kiev","region":"KV","postal_code":"","country":"Ukraine","phone":"+380993000853"}]}