{"id":"192307","name":"proMX AG","tagline":"Reinventing your productivity together","profile":"/profile/promx-ag","website":"https://promx.net","directory":"it-services","page":"7","verified":"","description":"proMX AG helps companies worldwide improve their processes with innovative solutions and the help of international partner network. We assist businesses with digital transformation, cloud migration and the implementation of agile organizational structures.\n\nFounded in 2000, we are a longtime Microsoft Partner. We focus on the customer engagement aspect of Dynamics 365 and are experts for Dynamics 365 for Project Service Automation and Dynamics 365 for Field Service.\n\nAs an Independent Software Vendor we also develop our own Dynamics compatible apps. Our project and resource management solution, proRM Fast Start, integrates seamlessly into Dynamics 365 and offers a compact tool box for small and medium-sized businesses. It’s entirely compatible with Dynamics 365 for Project Service Automation. We also offer Project Management add-ons for Dynamics 365 for Project Service Automation that provide further tracking, approval management and project planning functionality.\n\nWe have received numerous awards for our performance and solutions, such as Microsoft Partner of the Year – Germany, Microsoft Dynamics CRM Solution of the Year, and Microsoft EMEA Operations Online Service Advisor Excellence Award. \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2000","locations":[{"headquarters":true,"address":"Nordring 100","locality":"Nürnberg","region":"","postal_code":"90409","country":"Germany","phone":"+49 (9 11) 81 52 3-0"},{"headquarters":false,"address":"Hannover","locality":"Hollerithallee 17","region":"","postal_code":"30419","country":"Germany","phone":"+49 (5 11) 99 99 83 4-0"},{"headquarters":false,"address":"Dessauerstrasse 6","locality":"München","region":"","postal_code":"80992","country":"Germany","phone":"+49 (9 11) 81 52 3-0"}]}