{"id":"19242","name":"Symmetri Marketing","tagline":"We create meaningful brand interactions","profile":"/profile/symmetri-marketing","website":"https://symmetrimarketing.com","directory":"web-developers","page":"38","verified":"","description":"At Symmetri, our focus is to create meaningful brand interactions for B2B organizations — interactions that drive engagement, inspire action and motivate purchase. We seek to work with organizations that want to blaze a  new trail to make life better.\n \nBrand strategy. The founders of Symmetri came out of Leo Burnett Chicago, and as a result, brand building has always been at the heart of our organization. We have developed brand strategy for nearly 35 organizations over the past 15 years, ranging from $10M to multi-billion dollar organizations. Our brand strategy work has included brand positioning, brand promise development, brand vision and mission, brand architecture and brand identity.\n \nWeb development. Symmetri believes that a website must meet the goals and objectives of your business, answer the needs of your customer and provide an engaging user experience that motivates extended and repeat visits and recommendation to others. Symmetri provides full life-cycle web development services from discovery, UX, design and development through ongoing support and optimization. We have almost 10 years of development experience using the Drupal content management system and frequently contribute code to the community. Our team members are also knowledgeable in WordPress and other CMS platforms.\n \nDigital Marketing.\nPaid Media ( Display, Remarketing, Paid Search, Paid Social)\nSearch Engine Optimization\nTechnical Audits\nKeyword/Metadata Analysis\nSocial Media Management\nSocial Listening\nCommunity Management\nMarketing Automation\nDrip Campaigns\nData + Analytics\n \nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2003","locations":[{"headquarters":true,"address":"233 N Michigan Ave #765","locality":"Chicago","region":"IL","postal_code":"60601","country":"United States","phone":"734.393.4696"},{"headquarters":false,"address":"455 E Cady St Suite 302","locality":"Northville","region":"MI","postal_code":"48167","country":"United States","phone":"734.393.4696"}]}