{"id":"193719","name":"InfiniteProgress","tagline":"Remote development with Agile - tailored solutions","profile":"/profile/infiniteprogress","website":"http://infiniteprogress.pl","directory":"directory/mobile-application-developers","page":"87","verified":"","description":"We are the team of professionals specializing in a software development for business. Our primary goal is to design and implement solutions that meet the highest expectations of our customers. We have worked on numerous projects of different sizes and complexity. We have gained the knowledge that helps us to solve complicated problems professionally with regard to project costs. Our priority is to work with the client rather than for the client.\nThis subtle difference makes us to take every effort to encourage the client to actively participate in the process of software production. This attitude enables the fastest possible delivery of functionality. Experience, knowledge, passion and commitment is the foundation of our business. \nThe enterprise technologies are our main area of operation. We have a huge experience in JEE technology, but not the only. We know relational databases solutions, mainly Oracle, MySQL, Postgres and MS SQL.\n \nThe technologies we used to, are:\nJava: Struts 1.x, Spring, JBoss Seam, Vaadin, GWT, JSF, PrimeFaces, RichFaces, Apache Tomcat, Oracle Weblogic, Junit, JAX-WS, XML (JAXB, parsers SAX, DOM), Maven, Ant, JProfiler – professional Java profiler\n.NET:  C#, ASP.NET, Windows Forms, Unity Application Block, Linq2Sql, Windows Workflow Foundation, Windows Communication Foundation, Moles, MSTests\nOthers: JavaScript, jQuery, Highcharts, Hudson, Jenkins, Jetbrains TeamCity\nHow do we work\nWe know and use scrum methodology. We use daily meetings, sprints and many others tools to assure a high quality software for our customers. We plan our tasks and provide functionality according to schedule and expectations.\nWe can provide You a professional remote and complete development team for building a software solutions according to Your expectations. The team consists of: system architect, senior developers, junior developers, tester, graphic designer\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"Koscierzynska 10","locality":"Wroclaw","region":"DO","postal_code":"51-416","country":"Poland","phone":"+48 883 200 250"}]}