{"id":"194327","name":"Cool Nerds Marketing","tagline":"Let's talk nerdy.","profile":"/profile/cool-nerds-marketing","website":"http://www.coolnerdsmarketing.com","directory":"web-designers","page":"948","verified":"","description":"Cool Nerds Marketing is a digitally-focused agency with offices in Wilmington, DE and Philadelphia, PA, founded to create effective advertising campaigns to help clients communicate their messages and meet their marketing goals. We work with businesses of all sizes in all market segments to solve their marketing challenges in a cost-efficient and unique manner, specializing in Digital Marketing, social media marketing, and graphic and web design.\nWe deliver coherent and targeted messaging to break through the noise and deliver a memorable and impactful message to our clients’ target audience. However, simply selling our services is not our end goal; we look to build long-term relationships with our partner companies as we help them soar to new heights. Whether you need to promote a product, service, event, or just seek to effectively build your company’s brand, we can spread your message to specifically tailored audiences with a wide array of Digital Marketing efforts, including SEO and PPC advertising. Our advertising partners include Google AdWords (we are a Google certified partner), Facebook, Twitter, AdRoll, and several other industry-leading ad platforms. Our in-house teams of graphic designers and content specialists design and build exceptional websites that out-rank and out-perform those of our clients’ competitors. We utilize the thoughts and perspectives of our entire team to tackle our client’s challenges and create solutions driven by data, knowledge, logic, research, creativity, and intuition. Cool Nerds’ greatest source of value to our clients is the creative way we think & our passion for our client’s success.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2014","locations":[{"headquarters":true,"address":"1010 N Hancock St.","locality":"Philadelphia","region":"PA","postal_code":"19123","country":"United States","phone":"215.458.1266"},{"headquarters":false,"address":"300 N Market St.","locality":"Wilmington","region":"DE","postal_code":"19801","country":"United States","phone":"302.304.3440"}]}