{"id":"194510","name":"MARION Marketing","tagline":"Your Full-Service Marketing Agency","profile":"/profile/marion-marketing","website":"https://www.marion.com","directory":"web-designers","page":"515","verified":"","description":"MARION is a full-service marketing agency. We partner with clients like you to either supplement your in-house marketing or provide all of your outsourced marketing services.\nAt MARION, we specialize in digital marketing, graphic design and traditional marketing. We offer monthly services, or work on a project basis for select graphic and web design projects.\nOur digital marketing services include SEO, PPC and digital advertising, social media marketing, content marketing, email marketing, and reputation management. Our services are highly rated and delivered by an experienced team of digital marketing strategists.\nOur award-winning graphic design services include website design, logo design, print design, business card design, catalog design, brochure design, and branding services. We tailor our graphic design solutions to meet your business needs while maintaining your brand identity and authority.\nMARION's traditional marketing services include trade show display design, conventional ad placement, and direct mail. These tried and true marketing strategies are typically leveraged with graphic design and digital marketing services to optimally promote your company's products and services.\nOur team of design and digital marketing experts leverage data to inform your marketing direction for the best possible ROI for your marketing dollars. Our ongoing monthly services include a custom roadmap that helps us align the latest marketing methods with your business goals. We give you real-time acess to marketing performance reports, and refine your marketing roadmap every quarter to ensure that your strategy is optimized.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1981","locations":[{"headquarters":true,"address":"7026 Old Katy Rd. Ste 249","locality":"Houston","region":"TX","postal_code":"77024","country":"United States","phone":"713-623-6444"},{"headquarters":false,"address":"1701 Guadalupe St.","locality":"Austin","region":"TX","postal_code":"78701","country":"United States","phone":"512-522-6197"}]}