{"id":"195721","name":"BusyMachines","tagline":"Innovative software development","profile":"/profile/busymachines","website":"https://www.busymachines.com","directory":"directory/mobile-application-developers","page":"38","verified":"","description":"BusyMachines is an innovative software development company building complete software products for companies of the new digital economy. We have the technical expertise to handle all stages of software development and deliver scalable solutions that use exclusively open-source technologies. \nWe offer a free two-week trial sprint. This is a great opportunity to evaluate our services risk-free. We are confident that once you start working with us, you won't want to stop. If you like it, we will keep on working. If not, you are free to move on and nobody will even know that we've been working with you because of our NDA.\nHow can BusyMachines help you:\nProduct development (Proof of Concept, Minimum Viable Product): if you have a new business idea, we can build your product from scratch so you can deliver it to market as fast as possible. We take 100% responsibility for your technical product.\nTeam extension: If you already have a functional product and an in-house development team, we can help you scale up and increase delivery capacity by working with dedicated software teams from BusyMachines (on-demand software developers, solution architects, UI/UX designers, QA engineers, DevOps engineers and project managers).\nSoftware maintenance & support: we can keep the products we build for you in excellent shape with ongoing monitoring, tweaks and updates with efficient operational costs.\nOur technical expertise:\nWeb app development\nMobile app development\nBackend / Cloud solutions development\nInternet of Things / IoT development\nBig Data solutions development\nDevOps / TechOps\nUI/UX design\nQA\nIT Project Management\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"Piet Heinkade 55 UP Building","locality":"Amsterdam","region":"","postal_code":"1019 GM","country":"Netherlands","phone":"+31 617 021 657, +31 655 877 95"},{"headquarters":false,"address":"Bd. Tudor Vladimirescu 12, ap. 3","locality":"Timisoara","region":"","postal_code":"300195","country":"Romania","phone":"+40 773 960 018"}]}