{"id":"19593","name":"Queppelin","tagline":"Augmented Reality | Virtual Reality | Mobility","profile":"/profile/queppelin","website":"http://www.queppelin.com","directory":"directory/mobile-application-developers","page":"42","verified":"","description":"Queppelin is a “Red Herring Asia Award Winner” IT company. We have been featured in Mobile World Congress, Barcelona by Oracle corp and also certified with ISO 9001:2015 for IT services.\nWe develop Augmented Reality, Virtual Reality and Mobility applications and have a 10 year experience. \nOur tech platforms have been showcased at Mobile World Congress, Barcelona and have impacted millions of users worldwide. We’ve developed VR platforms to help thousands of manufacturing staff to train better, AR platforms for museums and merchants and mobile streaming platforms which stream billions of bytes of data every day.\nRecently, we broke an all time high record of 56 million user hits in a day for our media clients, where Queppelin team was managing the complete technology platform including the backend, middle layer and frontend. This is by far the third highest traffic successfully handled by any agency worldwide.\nAbout Queppelin AR/VR:\nQueppelin helps businesses leverage the potential of Augmented & Virtual Reality to engage their users at a deeper level and provide products/services like never imagined before.\nWe also launched a large platform in Australia where users can recreate their own marker based, markerless and teleport solutions in Augmented Reality. The project involved 30+ full time developers and has been under development for last 3 years at Queppelin.\nOur clients include Facebook, Snapdeal, Times of India, MakeMyTrip, Homeshop18, Gaana.com, Oxigen mobile wallet, Times internet Limited, Nokia, Samsung, KDDI, Micared (Japan) to name a few. \nSpecialities \nAugmented Reality, Virtual Reality, Android app development, iOS app development, Sports games, Betting games, Healthcare, Ecommerce, Payment systems, Unity, Vuforia, PHP, .NET, Java, Custom web development.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2010","locations":[{"headquarters":true,"address":"603-604, Welldone Tech Park, Sohna Road","locality":"Gurugram","region":"HR","postal_code":"122018","country":"India","phone":""},{"headquarters":false,"address":"74/143, Mansarover","locality":"Jaipur","region":"RJ","postal_code":"302017","country":"India","phone":""},{"headquarters":false,"address":"Top Floor, 22 West Street","locality":"Bromley","region":"KEN","postal_code":"BR1 1RF","country":"United Kingdom","phone":"44.785.012.5132"}]}