{"id":"196669","name":"DUNICE","tagline":"Web&Mobile development company.","profile":"/profile/dunice","website":"https://www.dunice.net","directory":"directory/mobile-application-developers","page":"21","verified":"","description":"We are company Dunice LLC with more than 7 years of market experience and over 300 successfully completed projects.\nWe help Clients to increase the influx of customers and their profits by developing web&mobile applications, websites and web services.\nWe're a team of high-skilled web&mobile developers, QA engineers, and designers. We use such technologies as Javascript and Node.js, Python and PHP, Ruby On Rails, etc.\nAlong with this, we guarantee:\n— transparent development process\n— direct communication with our full-stack developer\n— QA testing\n— UX/UI design\n— daily progress updates\nWith us:\nYou get a full-set team. We lead the entire project life cycle: from the idea to launch and technical support. Our developers are full-stack.\nAll developers are fully dedicated to your project. They will be working with you as one team.\nYou have a personal manager. Your manager helps you fast and timely to solve different questions (organization, technical, financial, etc). \nWe are always in touch and guarantee the highest level of communication. You get daily activity reports about the work done, plans for the next day and questions if any appear.\nWe prefer to use Agile approaches (flexible product development) for the implementation of our projects and use sprints in our business processes as well. Agile helps to provide development services in a highly flexible and interactive manner.\nWe provide regular code review and QA. Our specialists regularly qualify their skills passing different tests and international certifications (e.g. ISTQB).\nWe provide high-quality product and services and aim to build a long-term partnership.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"6, gogolevsky line","locality":"Taganrog","region":"ROS","postal_code":"347900","country":"Russia","phone":"+13235444617"}]}