{"id":"197185","name":"Copacino + Fujikado","tagline":"Marketing and Advertising Seattle, Washington","profile":"/profile/copacino-fujikado","website":"http://www.copacino.com","directory":"agencies","page":"101","verified":"","description":"Founded in 1998, Copacino+Fujikado is a full-service advertising agency with a twenty year track record of delivering measurable results for our clients. Our agency’s success is driven by a way of working that combines strategic rigor with innovative creativity, delivered with a healthy dose of humanity. This philosophy is captured by our agency mantra: Think like a consultancy. Create like an agency. Act with empathy.\n \nThink like a Consultancy: Our Research and Insights team deploys advanced technology and insightful strategic thinking to diagnose opportunities and best focus our efforts.\nCreate like an Agency: We turn insights into marketing ideas that intrigue, inform, entertain, provoke and ultimately impact our audiences to produce measurable results in the marketplace.\nAct with Empathy: People are at the center of everything we do. We operate with high respect for the needs of our colleagues and clients—as well as understanding the emotional needs of the consumer. This approach has led to several longstanding client relationships, evidenced by the fact that we have seven clients with which we enjoy with 10+ year relationships. With a mix of local, regional and national accounts, we have the scale and resources to stand shoulder to shoulder with larger, networked agencies—but combine this with a focus of working in close, collaborative relationships with our clients. We derive great joy from the work we do and the results we generate.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"1998","locations":[{"headquarters":true,"address":"1425 4th Avenue Suite 700","locality":"Seattle","region":"WA","postal_code":"98101","country":"United States","phone":"+1.206.467.6610"}]}