{"id":"197218","name":"GOTESO","tagline":"Landmark Of Technology Solutions","profile":"/profile/goteso","website":"http://www.goteso.com","directory":"directory/mobile-application-developers","page":"213","verified":"","description":"GOTESO - Goyal Technology Solutions is a product and service based Indian IT company where we have many different services. The company was founded in 2013 by Y.K. Goyal & V.J. Goyal has evolved since then from a reseller of IT products & providing technology services to become a Global IT support company. GOTESO is a software development company which provides custom development services to the customers and training in advanced technologies to the corporate clients.\nGOTESO focuses on providing IT consulting services, offshore web development, mobile app development, graphics designing and software development, re-engineering solutions and ready-to-deploy business applications for a number of industries including e-commerce, banking and finance. At GOTESO we are proud of our high quality standards. These standards allow us to provide our customer with reliable and error free software applications, regardless of complexity. Our top-notch developers use the latest software methodologies and technologies. This means they can concentrate on our clients business goals and keep them involved in every stage through the entire project. Our meticulous approach has helped us to build our excellent track record with no failed or aborted projects. To provide quality products at competitive prices and contribute to the business success of our clients.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"237 KEARNY STREET","locality":"San Francisco","region":"CA","postal_code":"94108","country":"United States","phone":"+14159926367"},{"headquarters":false,"address":"SCO - 16 , AKS COLONY , NEAR PUNJAB AND SIND BANK","locality":"Zirakpur","region":"PB","postal_code":"140603","country":"India","phone":"+919478187006"}]}