{"id":"19803","name":"State Digital","tagline":"We design and build for mobile devices and the web","profile":"/profile/state-digital","website":"http://statebuilt.com","directory":"web-developers","page":"132","verified":"","description":"We’ve been in the design and development business for many years and have worked on projects large and small.  \nA small team with big results.\nA common misconception is that a large agency will produce better work, faster. In truth, the people physically involved in any project tend to consititue a small team, whether employed by a larger agency or a boutique consultancy.  The benefit to working with a dedicated craft shop is that you always get the principals, rather than the interns.  \nCommunication is a huge part of running a successful project.  \nWith State you have direct access to the people designing and building your product. No middle men, no account reps, no sales team.  Just a direct line of contact.\nBuilding anything well requires a significant investment. \nWe understand the importance of your sending dollars into battle strategically.  \nOur methodoligy focuses on building what is necessary for today.  \nThis typically means using 3rd-party services, where possible, until a genunine need for a custom solution presents itself.  It can also translate to carefully choosing which tasks are automated or simplified, and those that remain more techinical.  We specialize in creating sofware on a predictable and controlled budget.\nTechnology and architecture choices  go a long way toward keeping a project cost effective after the keys have been turned over.  \nThe strategy will look very different for a company that has a technical team ready to support their new software, versus the small group of investors who will initially rely on us to keep their application running smoothly.   \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2011","locations":[{"headquarters":true,"address":"422 Eagle","locality":"Lakeway","region":"TX","postal_code":"78734","country":"United States","phone":"512.587.7590"}]}