{"id":"198387","name":"Girikon","tagline":"Salesforce Silver Partner","profile":"/profile/girikon","website":"https://www.girikon.com","directory":"it-services","page":"474","verified":"","description":"Girikon is an IT consulting & development company, based out of Phoenix, Arizona with development centre in Noida, India and office in Melbourne, Australia. \nGirikon is a Salesforce Silver Consulting Partner, HIPAA compliant, ISO 9001 certified & ISO 27001 certified. Girikon also supports its customers on technology platforms such as Java, Microsoft, Oracle, Data Management services etc.\nGirikon has expertise in the majority of Salesforce Platforms, including \nSales Cloud\nService Cloud\nCommunity Cloud\nMarketing Cloud\nPardot\nSalesforce CPQ\nSalesforce Billing\n3rd Party integrations\nBespoke Force.com development\nLightning Development\nData Migration\nGirikon works with its Salesforce Partner Success Managers to continue developing expertise on latest offerings from Salesforce e.g. Salesforce Einstein, Mulesoft, Commerce Cloud etc. ensuring that their customers can leverage the Salesforce Platform to its complete potential.\nOur Global network of offices in USA, India and Australia, allows Girikon to quickly respond to customer’s requirements with a view to effectively delivery a quality product and service. Girikon has a  team of experienced and certified Salesforce Architects, Developers, Consultants, and Administrators. Girikon’s strength lies in Salesforce implementation, customization, development, integration and support.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2015","locations":[{"headquarters":true,"address":"15433 N Tatum Blvd #105","locality":"Phoenix","region":"AZ","postal_code":"85032","country":"United States","phone":"+1.480.382.1320"},{"headquarters":false,"address":"Level 1 & 2 - 161 Collins Street","locality":"Melbourne","region":"","postal_code":"3000","country":"Australia","phone":"1300 332 888"},{"headquarters":false,"address":"B-24, Sector-65","locality":"Delhi NCR","region":"DL","postal_code":"","country":"India","phone":""}]}