{"id":"198375","name":"Brown Box Branding","tagline":"Award Winning Web Design & SEO","profile":"/profile/brown-box-branding","website":"http://www.brownboxbranding.com","directory":"web-designers","page":"250","verified":"","description":"We have been creating and executing groundbreaking branding projects, digital marketing campaigns, media, websites, mobile apps, and other cool stuff for clients all over the country since 2013. From small local businesses and startups, to large international corporations, our team has done it all. \n \nThroughout the years, we've perfected our strategies which will result in taking your business to new heights. Our clients agree that we deliver awe-inspiring work while keeping costs affordable. With experience ranging from branding and website design, social media planning & marketing, to search engine optimization, content marketing, and pay-per-click, our portfolio has grown to include an extensive list of recognized clients. \n \nWe don’t believe in short cuts. At Brown Box Branding, every successful campaign and project begins with an intensive discovery phase that pays off ten fold once it’s time to execute the campaign. Better attention to these items in the beginning leads to better results for our clients. Along the same lines, throughout the project, we avoid making hasty decisions without data to support it. This ensures your campaign or project is as optimized as possible. Our focus is always on you. \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"400 Renaissance Center, Suite 2600","locality":"Detroit","region":"MI","postal_code":"48243","country":"United States","phone":"313.241.6742"},{"headquarters":false,"address":"801 2nd Ave, Suite 800","locality":"Seattle","region":"WA","postal_code":"98104","country":"United States","phone":"206.489.5630"},{"headquarters":false,"address":"121 Southwest Salmon Street","locality":"Portland","region":"OR","postal_code":"97204","country":"United States","phone":"253-861-6857"},{"headquarters":false,"address":"325 N. St. Paul Street, Suite 3100","locality":"Dallas","region":"TX","postal_code":"75201","country":"United States","phone":"469.844.3331"}]}