{"id":"198861","name":"Speakeasy Creative","tagline":"WeSpeak Everything.","profile":"/profile/speakeasy-creative","website":"http://wespeakeasy.com","directory":"web-designers","page":"787","verified":"","description":"Left Brain Meet Right Brain\nOur marketing campaigns and customized websites utilize a data-driven approach coupled with beautiful design. Using research and analytics, we determine the most effective way to approach your marketing and web needs. Then, we turn it over to our design team to create materials that adhere to your brand and overall vision.\nYou’ve heard of B2B and B2C, but what about H2H?\nWe consider ourselves H2H marketers: human to human. Building a personal connection is very important and creates more opportunities to take your marketing strategy or website to the next level. So, let’s grab coffee – on us! We'll review your current web and marketing efforts for free, too.\nInbound Marketing\nMarketers tend to become overly aggressive with their efforts, which means even the most helpful materials will be viewed as a nuisance by potential leads. We utilize the inbound marketing methodology by focusing on creating helpful marketing materials that guide people through the buyer’s journey, ultimately nurturing them into leads.\nWebsite Design\nYour website is the most important marketing tool for your business, so you want it to look great and function properly across all devices. We take your current branding and build an entirely customized website that leverages marketing call-to-actions and strong copy to attract and identify potential clients.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2015","locations":[{"headquarters":true,"address":"304 Harper Dr #130","locality":"Moorestown","region":"NJ","postal_code":"08057","country":"United States","phone":"215.799.9415"},{"headquarters":false,"address":"230 S. Broad St., 17th Floor","locality":"Philadelphia","region":"PA","postal_code":"19103","country":"United States","phone":"215.799.9415"},{"headquarters":false,"address":"2424 E York St","locality":"Philadelphia","region":"PA","postal_code":"19125","country":"United States","phone":"(215) 789-9415"}]}