{"id":"19959","name":"Bastion Rare","tagline":"We are Rare!","profile":"/profile/bastion-rare","website":"https://www.bastionrare.com","directory":"directory/mobile-application-developers","page":"84","verified":"","description":"Bastion Rare was established in 2018 by Bastion Collective, following a merger & acquisition of two leading Southern California based digital agency's.\nBastion Collective is Australia's largest independent marketing & communications group. With offices in the U.S., Australia, and China, Bastion Collective consists of more than 300 people.\n \nBastion Rare is the Digital Brain Trust of Bastion Collective where the planning and implementation of enterprise level creative, development, and digital marketing work is executed.\nA global leader in providing Web and mobile application platform design & development services, the team at Bastion Rare helps forward thinking organizations and entrepreneurs translate complex business challenges into innovative digital solutions. Additionally, Bastion Rare provides strategic thinking and execution of local and national digital marketing initiatives, including search engine optimization (SEO), PPC management (SEM), and local SEO.\nBastion Rare has experience delivering solutions across a wide-range of industries, including consumer goods & services, financial services, healthcare, manufacturing & distribution, retail & e-commerce, entertainment, education, real estate, and training & marketing.\nWith expertise in most major Web and mobile technologies, including iOS, Android, and other mobile platforms, the Rare team offers expertise in creating user interfaces and experiences that people love and share!\nBastion Rare consists of business analysts, technology architects, project managers, user interface & experience (UI/UX) designers, engineers, quality assurance & testing specialists, and marketing experts, providing customers with innovative solutions tailored to their specific needs.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2018","locations":[{"headquarters":true,"address":"3333 Michelson Drive","locality":"Irvine","region":"CA","postal_code":"92612","country":"United States","phone":"949-600-5122"}]}