{"id":"201516","name":"Cultivate Software","tagline":"Expert software engineering and product guidance","profile":"/profile/cultivate-software","website":"http://www.cultivatehq.com","directory":"web-developers","page":"152","verified":"","description":"Cultivate’s team have been building the highest quality web applications since 2009. Throughout our history, we’ve operated under a number of brand names (EdgeCase, Neo and Cultivate), but our vision and passion for our craft remains unchanged.\n\nWe care deeply about the quality of our work. Aside from our highly selective hiring process, we work in pairs, write tests first, deploy to production frequently and regularly reflect on our progress. This ensures the highest quality code and reduced time to delivery.\nWe combine in-depth technical, design and business knowledge with experience across multiple industries. We are long term lean and agile practitioners and have a deep understanding of product management, user experience design and visual design. Over the years, our previous colleagues have literally written the book on Lean UX.\nOur clients cover startup, enterprise and public sector organisations and we flex our approach to fit with their unique requirements. Previous and existing clients include Deliveroo, The Government Digital Service, Living Social, The Money Advice Service, 38 Degrees, Registers of Scotland, General Electric, JP Morgan and many others. \nWe don't cut corners, and will never compromise the quality of your product to create more work for ourselves, or to undercut other consultancies on price. With Cultivate, you get the best industry talent, the highest quality code, and unparalleled excellence in software strategy, scalability and sustainability.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Castle Terrace","locality":"Edinburgh","region":"","postal_code":"EH39LR","country":"United Kingdom","phone":"0845 528 0757"}]}