{"id":"20351","name":"Cogniter Technologies","tagline":"Make Your Website Your Hardest Working Employee!!!","profile":"/profile/cogniter-technologies","website":"http://www.cogniter.com","directory":"directory/mobile-application-developers","page":"257","verified":"","description":"Cogniter Technologies, as an ISO 9001: 2008 certified software enterprise, is the fastest growing Mobile, Web and Software company. We specialize in providing online business solutions globally.Our Consultative approach and adeptness in using Innovative technologies towards our solutions enable our clients to gain a competitive edge over others.\nOur areas of expertise includes: \n- Smartphone Apps for all mobile verticals\n- Design & Multimedia\n- Microsoft Technologies\n- Open Source Technologies\n- Digital Marketing\n- Quality Assurance\n- Remote Infrastruture Management\n- Support and Maintenance\nWe at Cogniter technologies believe in an ethical approach to business and our process driven approach coupled with personalized attention has helped us to create and deliver solutions which have helped our customers achieve a healthy ROI. \nAs an enterprise with broad technology base in its development center, we pride ourselves in creating state of the art cost effective solutions for our clients.\nOur Offshore IT services provide complete geographical transparency and help deliver excellent quality in shortest amount of time. Over the years, Cogniter client relationships with world leaders in major industries have evolved into partnerships, with a focus on delivering business value. Since 2003, we have delivered quality work for small, medium and large scale enterprises, including several fortune 500 organizations. With an experienced team, Cogniter is able to take up any challenge and is committed to deliver real value to the clients worldwide.\nWe provide proficient outsourcing solutions with qualified engineers, designers, developers & excellent project management to suit your development needs.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2003","locations":[{"headquarters":true,"address":"Sector 34 A","locality":"Chandigarh","region":"","postal_code":"160034","country":"India","phone":"+91.172.262.0353"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Panama","phone":""},{"headquarters":false,"address":"","locality":"Vancouver","region":"ON","postal_code":"","country":"Canada","phone":""},{"headquarters":false,"address":"","locality":"San Jose","region":"CA","postal_code":"","country":"United States","phone":""}]}