{"id":"204308","name":"Blink22","tagline":"Mobile and Web Development Company.","profile":"/profile/blink22","website":"http://www.blink22.com","directory":"directory/mobile-application-developers","page":"11","verified":"","description":"Blink22 is a web and mobile development company, founded and running its operations in Egypt since 2015. With offices and representatives in the USA, Australia, Germany, Portugal, and Brazil. We are a team of 20+ engineers, project managers, and designers. We put our hearts and souls into them, not resting until we’ve generated surefire solutions that will propel a business forward. Our passion makes the difference.\nFor our team of highly-skilled engineers, there’s nothing more satisfying than developing software that helps a business exceed its goals. From Australia to the USA to Germany and beyond, our software has helped clients grow and expand their business ventures.\nSince 2015, Blink22 doubled in size every year, expanding the team from 2 to 40 members and increasing our annual income by 300% in the last 3 years. So far, we have worked with clients from 6 different countries, successfully delivering more than 30 projects with clients featured in BusinessInsider, TechCrunch, and entrepreneur.com.\nWe proudly support women in tech by maintaining 40% of its team led by women and support our skilled world-class Egyptian talent to break into the worldwide market. Blink22 is run by developers for developers, to create a positive working community and support tech entrepreneurial culture.\nWe are Blink22, one of the fastest-growing companies in Egypt. We maintain an unshakable passion for developing web and mobile applications for our clients worldwide and making a name for ourselves in the world of software development.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2015","locations":[{"headquarters":true,"address":"Second first Amir Al Behar St.","locality":"Alexandria","region":"","postal_code":"21531","country":"Egypt","phone":"00201100147473"}]}