{"id":"204542","name":"EventBank","tagline":"Events & Memberships Simplified","profile":"/profile/eventbank","website":"https://eventbank.com","directory":"web-designers","page":"345","verified":"","description":"EventBank is a leading cloud-based engagement management technology company that provides chambers of commerce, associations, event organizers, marketers, and businesses with solutions designed to streamline operations, modernize processes, and eliminate engagement challenges.\nEventBank’s innovative products combine the best event management, membership management, email marketing, CRM, and mobile apps into one all-inclusive platform:\nBusiness Growth Cloud\nConvert leads into sales and collect payments with a cutting-edge cloud that replaces multiple technology solutions. Stay competitive with an integrated platform that provides visibility into every aspect of your business so you can make smart business decisions faster.\nEvent Marketing Cloud\nRun hundreds of events from one platform. Drive revenue, save time, and increase ROI with a full suite of high-performance tools that streamline operations and maximize engagement. Keep data synchronized in a central location and leverage it to establish lasting relationships.\nAssociation & Chamber Management Cloud\nOptimize your member engagement and increase your team's efficiency so you can focus on achieving your organization's mission. Unlock new paths for growth and collect membership dues with a first-class cloud platform that consolidates all your operations in one place. Strengthen community relationships with an integrated solution that provides deep insights so you can maximize engagement.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2013","locations":[{"headquarters":true,"address":"8607 Westwood Centre Drive #250","locality":"Vienna","region":"VA","postal_code":"22182","country":"United States","phone":"1 888 218 1354"},{"headquarters":false,"address":"oom 3-1, Tower D, Guanghualu SOHO2 No. 9 Guanghua Road, Chaoyang District","locality":"Beijing","region":"11","postal_code":"100020","country":"China","phone":""},{"headquarters":false,"address":"89 Taixing Lu 5/F","locality":"Jing'an","region":"31","postal_code":"","country":"China","phone":""}]}