{"id":"20492","name":"Suventure","tagline":"Yes To Possibilities","profile":"/profile/suventure","website":"http://www.suventure.in","directory":"directory/mobile-application-developers","page":"59","verified":"","description":"Suventure is a next generation technology organization that helps clients use information technology as a business enabler. Suventure strives to be at the forefront of innovation in information technology and outsourcing leveraging IT to provide maximum returns.\nSuventure is led by a group of highly experienced technology and business professionals with global experience in IT and related industries.  As experienced IT and business professionals, we “think as an enterprise, work as a startup.”Suventure teams have provided services to a wide spectrum of clients ranging from startups to Fortune 1000 companies. Suventure covers a wide gamut of IT offerings and solutions including IT strategy, IT visioning & roadmap, applications portfolio assessments and reengineering, applications development, maintenance, support, IT Infrastructure, product engineering, system integration, quality assurance, independent verification and validation.\nSuventure has core competency in Mobile app development (iOS, Android and Windows) and have successfully supported our clients with the best of breed solutions, apps and enterprise mobility services.\n \nWith offices in US and India, Suventure is able to leverage onsite - offshore development model to benefit clients with highest quality solutions delivered at best price.\n \n \n \n \n \n \n \n \n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"240 Oxford Rd,","locality":"West Chester","region":"PA","postal_code":"19380","country":"United States","phone":"610.298.1276"},{"headquarters":false,"address":"1st Floor, BKN Ambaram Estate,648/L, 1st Main, 1st Stage, Indiranagar","locality":"Bangalore","region":"KA","postal_code":"560038","country":"India","phone":"+91 9845328282"}]}