{"id":"20506","name":"Montana Banana","tagline":"Building Mission-Critical Websites and Mobile Apps","profile":"/profile/montana-banana","website":"http://www.montanab.com","directory":"web-developers","page":"35","verified":"","description":"Founded in 1996 in Seattle, Washington, Montana Banana is a full service website and Internet development company. Beginning with comprehensive needs analysis, through design and implementation; Montana Banana has the experience and skill to make Internet strategies successful.\nOnce a website is online, we remain available to assist with its ongoing evolution, analyzing trends and advising on how to proceed. Since the Internet is changing at such a rapid pace, experienced and professional advisors are often needed to guide website development through future phases.\nWe believe that design is a plan for action. In other words, design isn't just about making something look good; it's about moving someone into action.  Our conversion principles guide every design decision while our inbound marketing tactics help to structure the business ones.\nMontana Banana has the right combination of business experience, technical knowledge and artistic vision to make websites stand out visually and work how our clients require their systems to work.\nOur core technical proficiency is building on a LAMP stack (Linux/Apache/mySQL/PHP); however, any solution that involves Linux or Apache is still within our wheelhouse. Our best clients have heavier code lifting needs that require either very unique solutions and/or a slew of API integration.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"1996","locations":[{"headquarters":true,"address":"1752 NW Market St, #541","locality":"Seattle","region":"WA","postal_code":"98107","country":"United States","phone":"206.686.3631"},{"headquarters":false,"address":"2355 Brigden Rd","locality":"Pasadena","region":"CA","postal_code":"91104","country":"United States","phone":"626.529.5488"}]}