{"id":"20509","name":"Definition 6","tagline":"We create content that spreads.","profile":"/profile/definition-6","website":"http://www.definition6.com","directory":"web-designers","page":"62","verified":"","description":"Definition 6 is a digital marketing agency that creates digital and video content for every medium. Whether it’s digital or broadcast, social or mobile, TV or radio, we have the ability to deliver the right message to the right person at the right time. We create, curate, distribute, and amplify content that connects with your audience everywhere. To deliver on that promise, we create and develop content fully in-house.\nWhether it’s content management, website design, ecommerce or an immersive experiential marketing campaign, we have the expertise. We incorporate strong creative with your company’s business objectives to create websites, social strategies, and mobile apps.\nWe maintain a full suite of in-house production (video, audio, and digital) and a “Social Content Newsroom” to create content and experiences effectively and efficiently. We maintain the largest global content exchange network for journalists, bloggers and publishers across 108 countries and in 22 languages.\nFor over 16 years, we have been creating compelling content and entertaining experiences that drive results.\nNamed OMMA Magazine's 2011 Viral Video Agency of the Year, and with offices in Atlanta, New York, San Francisco and London, Definition 6 supports a fast-growing client base. For more information on Definition 6's Digital Marketing Services, or to learn more about the agency's award-winning work, please visit www.definition6.com.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"1998","locations":[{"headquarters":true,"address":"2115 Monroe Drive, Suite 100","locality":"Atlanta","region":"GA","postal_code":"30324","country":"United States","phone":"+1.404.870.0323"},{"headquarters":false,"address":"79 Fifth Avenue, 14th Floor","locality":"New York","region":"NY","postal_code":"10003","country":"United States","phone":"+1.212.201.4200"},{"headquarters":false,"address":"8 California Street","locality":"San Francisco","region":"CA","postal_code":"94111","country":"United States","phone":"+1.415.912.1650"},{"headquarters":false,"address":"","locality":"Ahmedabad","region":"GJ","postal_code":"","country":"India","phone":""}]}