{"id":"20537","name":"Greater Than One","tagline":"Human Solutions for the Digital Age","profile":"/profile/greater-one","website":"http://greaterthanone.com","directory":"seo-firms","page":"44","verified":"","description":"Greater Than One (GTO) is a fully integrated digital communications agency. We specialize in highly complex categories – principally healthcare – where informed decisions among all constituents are critical to a brand’s success. Founded in April 2000, GTO has since grown to a seasoned team of over 100 professionals with deep expertise in all aspects of digital marketing. We are imaginative, collaborative, and driven.\nIt is our view that Digital is not just a channel: it is a complete way of thinking and doing. Our paradigm starts with human insights that are rooted in customers’ behavior – how they would like to be communicated to and engaged with – rather than what we want to say to them. Because Digital has become more mobile, social, and connected than before, our experience with and expertise in this way of thinking is now more important than ever.\nOur proven track record (our average client engagement is 5+ years) demonstrates our ability to not only move with the industry, but be a driving force in the development of new ideas and strategies that are changing the digital landscape.\nWe are headquartered in New York, and have offices in San Francisco and Madrid. Our unique partnership structure means that each client receives senior level, highly experienced attention. This structure ensures that each of our partners works hands on with each unit, creating a highly collaborative client experience.\nFurther, we understand the interdependencies that exist between the many different stakeholders involved in our clients’ businesses, patients, providers, and sales forces. Our breadth of services allows us to provide cohesive, integrated solutions, enabling us to create optimal opportunities for our clients’ businesses and build powerful digital solutions that stand the test of time.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2000","locations":[{"headquarters":true,"address":"395 Hudson Street","locality":"New York","region":"NY","postal_code":"10014","country":"United States","phone":"+1.212.252.1999"},{"headquarters":false,"address":"445 Bush Street","locality":"San Francisco","region":"CA","postal_code":"94108","country":"United States","phone":"+1.415.229.4500"},{"headquarters":false,"address":"Calle Montesa, 35, Escalera Derecha, 3º Izqa","locality":"Madrid","region":"","postal_code":"28006","country":"Spain","phone":"+34.91.829.10.45"}]}