{"id":"20558","name":"LiveWebMedia","tagline":"Simple & Flexible","profile":"/profile/livewebmedia","website":"http://livewebmedia.com","directory":"web-developers","page":"317","verified":"","description":"Not your average web design company, LiveWebMedia is an avante-garde web design and interactive media agency founded in 1998 in Southern California. Originally only servicing smaller businesses, LiveWebMedia has built up its clientele  list and found massive success in the industry.\nToday, the company has grown into a full-service agency with a growing list of top companies and brand names boasting the latest in technology, a masterful team, and an imagination that pushes our clients to the next level. Here at LiveWebMedia we believe that doing what you love creates a never ending abundance of possibility. \nThere is no feat too small and nothing we can’t do. Let’s be honest: You’re only as big as your biggest fan, and we all know that in the corporate world, that person can’t be mom. For that purpose, and many others, LiveWebMedia can step in to help globalize your company’s appeal via our ingenious skill at launching collaborative and avant-garde public relations campaigns. Your success is our triumph, and as such we’ll go the extra hundred miles to boast your company through a variety of different medias, including social media campaigning, to get your audience’s attention and present you as a leading brand. \nOur public relations team is more than well-versed in all trends and media, staying current through changing tides. We know the right way to market a brand, and LiveWebMedia’s team of brand advocates is the only team you should entrust to market your potential through a valuable public relations campaign. - \nSee more at: http://livewebmedia.com/about/#sthash.hfQ8XUnH.dpuf\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"1998","locations":[{"headquarters":true,"address":"6303 Owensmouth Ave, 10th FL","locality":"Woodland Hills","region":"CA","postal_code":"91367","country":"United States","phone":"855.548.3932"}]}