{"id":"205767","name":"Expansio","tagline":"Expansio Software House. Handmade. Digitized.","profile":"/profile/expansio","website":"http://www.expans.io","directory":"directory/mobile-application-developers","page":"69","verified":"","description":"We are a Polish software house with the \"turquoise company\" management model.\nWe have a vast background in the area of web applications and mobile software. We specialize in creating software and hardware startups. We developed B2C and B2B startup products, such as:\nEnter the game (http://www.expans.io/enter-the-game/), an educational project for the employees of Volkswagen Poznań\nCodeAll (http://codeall.fun) - startup focused on teaching programming using IoT devices, winner of many awards\nTinkerer (http://www.expans.io/tinkerer/) - beacons for the industry\nOur startup projects were selected to many acceleration programs, such as Swiss Kickstart Accelerator, Google Launchpad Start, Startup Spark or MIT Enterprise Forum Poland. We have won the Edulab competition as the best educational startup in Poland (1 000 000 PLN of investment) and were granted more than 1 500 000 PLN by the Polish National Centre for Research and Development. \nFounder of Expansio, Mateusz Jarus, has actively contributed to research work for more than 7 years. He is the co-author of 15 publications. His research work has been presented at multiple conferences around the world.\nMateusz Jarus is the alumni of TOP 500 Innovators Programme at Cambridge University. He is also the alumni of Research Experience for Undergraduates (REU) Programme at the Center for Research Computing, University of Notre Dame, USA.\nExpansio has developed multiple software and hardware projects in the following areas:\ne-learning,\nlaw,\nadvertisement,\ncompany management.\nWe specialize in the following technologies: React, React Native, JavaScript and PHP.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"2 - 9","founded":"2016","locations":[{"headquarters":true,"address":"Rubież 46, budynek C, biuro 102, 61-612","locality":"Poznań","region":"","postal_code":"H61-612","country":"Poland","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Poland","phone":""}]}