{"id":"20581","name":"Arcanys","tagline":"Outsource smarter.","profile":"/profile/arcanys","website":"http://www.arcanys.com","directory":"directory/mobile-application-developers","page":"38","verified":"","description":"Arcanys is a Swiss technology company specialized in building dedicated teams of highly-skilled developers for startups and established businesses in need of robust software solutions, fresh Internet business perspective, and a reliable execution of their vision.\nRun by a team of successful entrepreneurs, our software outsourcing center in the Philippines provides project-ready tech experts that work in full compliance with your needs and objectives.\nWe have a successful decade-long track record in helping businesses with SaaS and IoT products design, prototyping, and development (200+ SaaS products to our credit), and take a personal approach to every customer and project—bringing in transparency, technical expertise, and a great attention to detail. We pride ourselves in providing very talented and dedicated teams of developers, designers, and testers who have the necessary technology stack to build fast, impactful, and reliable cloud-based software solutions.\n \nIn short, our services are the following:\n• Full-time dedicated teams (software development, testing / QA)\n• Web and mobile applications development and testing\n• 24/7 AWS & customer support\n• Business Analysis & UI/UX design\n• Machine Learning, Artificial Intelligence & Data Science\n \nLearn more about our projects: http://www.arcanys.com/docs/Arcanys_Portfolio.pdf.\nREAD MORE...","min_project_size":"$100,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2010","locations":[{"headquarters":true,"address":"","locality":"Cebu City","region":"","postal_code":"6000","country":"Philippines","phone":"+639176349110"},{"headquarters":false,"address":"Paseo De Roxas","locality":"Makati City","region":"","postal_code":"1200","country":"Philippines","phone":"+639176349110"}]}