{"id":"207306","name":"Central American Software Services","tagline":"Bringing people together through technology","profile":"/profile/central-american-software-services","website":"http://www.cass.fr","directory":"directory/mobile-application-developers","page":"66","verified":"","description":"At Central American Software Services, we are dedicated to making software, mobile apps and web portals. But we are much more than that, thanks to the multiplicity of international profiles working with us. Here are the aspects of our company that our clients and partners value most:\n\n●    Have a fresh and dynamic workforce on your side, composed of skilled engineers and graphic designers. \n●    Get assessment at a technical and functional level.\n●    Get results within an established time frame previously discussed with you.\n ●    Have access to a virtual platform where you can follow the progress of your project in real time.\n ●    Receive protection of the intellectual property of your project.\n ●    Have an open and varied window of opportunities to establish your products in the market.\n\nCentral American Software Services is driven by its core values, which we apply in our everyday work:\n●    Integrity: we act with honor without compromising the truth\n●    Diversity: we respect and advocate equality between all our employees \n●    Inclusion: our teams are composed of people from all backgrounds, places and genders.\n●    Transparency: we believe that all our actions should be done in a transparent way\n●    Community: we believe that a sustainable growth of our community is a sustainable growth for our company\n●    Innovation:  we believe in the importance of creating a space where ideas that can make a difference are born\nAre you going to be our next partner?\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2006","locations":[{"headquarters":true,"address":"Calle Francisco Gavidia","locality":"San Salvador","region":"SS","postal_code":"00001","country":"El Salvador","phone":"(+503) 2252 2257"},{"headquarters":false,"address":"66 Rue St Savournin","locality":"Marseille","region":"","postal_code":"13001","country":"France","phone":"(+33) 4 13 20 82 08"}]}