{"id":"20954","name":"SmartLogic","tagline":"Custom Web & Mobile Applications","profile":"/profile/smartlogic","website":"http://smr.tl","directory":"directory/mobile-application-developers","page":"15","verified":"","description":"We build custom web and mobile applications.\nSmartLogic is a Baltimore-based consulting company that has been building custom web and mobile software applications since 2005. SmartLogic works with funded startups, established organizations, and non-profit agencies to bring new projects to life using progressive, best-of-breed technologies and methods.\n \nStress-free software development\nWe use best-of-breed agile development processes to deliver exceptional project management—and of course code—to your organization. The SmartLogic method prioritizes constant communication, good planning, high levels of organization, and of course, the best code.\nWe choose the best tools for the job.\nOur technology-agnostic development team focuses on choosing the right tools for the job, and are always learning and building best practices as the web and its underlying technologies continue to evolve. We embrace open source, leverage existing services, design for future scalability, and focus on widely-adopted and cutting edge development languages.\nTechnology Focus\nWhile we are technology-agnostic, we do specialize in the following:\nElixir/Phoenix\nRuby/Ruby on Rails\nPostgreSQL and MySQL\nJavascript Frameworks, particularly React\nReact Native for Android and iOS app development\nAPI development (we're happy working on software with no graphical user interface)\nHosting/DevOps: we've hosted our software on a number of providers, including AWS, Heroku, Linode, EngineYard, Rackspace, etc.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2005","locations":[{"headquarters":true,"address":"3500 Boston Street, Suite 323","locality":"Baltimore","region":"MD","postal_code":"21224","country":"United States","phone":"443.451.3001"}]}