{"id":"21013","name":"[x]cube LABS","tagline":"World Class Mobile Apps","profile":"/profile/xcube-labs","website":"http://www.xcubelabs.com","directory":"directory/mobile-application-developers","page":"100","verified":"","description":"[x]cube LABS is a leader in mobile app development and consulting. Having developed over 600 apps across platforms, [x]cube has been the partner of choice for several Fortune 500 companies as well as disrupting startups that have epitomized success.\nWith several awards winning apps to its credit, [x]cube LABS is one of the most reputable mobile solutions company in the world today.At [x]cube, we don't just develop mobile apps but we actively work on creating solutions that solve real problems and we partner with our clients to create real market success. As a leader in the mobile technology space we invest heavily in research & development focussed on innovation and also on design that transcends aesthetics and extends to strategy and user experience.Our strong technical competency, well-defined methodology, a dedicated team of more than 300 mobile consultants and global presence has helped us provide mobile solutions that offer critical business benefits, aid transformation, accelerate innovation and bring competitive edge to our clients.\nOur core experience lies in mobile strategy consulting, enterprise mobility solutions, Mobile app design ( UI / UX) as well as mobile game development.\nAwards & Recognition\n2014\nHermes Creative Award\nCommunicator Award\nGraphic Design USA ( 2 )\nW3 Award ( 2 )\n2013\nDavey Awards\nW3 Award\n2012\nHow Interactive Design Award\n2011\nThe Dallas Show by Dallas Society of Visual Comunication\nW3 Awards\nCore77 Design Awards\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"4153 Commerce Street","locality":"Dallas","region":"TX","postal_code":"75206","country":"United States","phone":"800.805.5783"},{"headquarters":false,"address":"12th Floor, Watermark Technopark, Plot No.11, Survey No. 9, Whitefields, Kondapur","locality":"Hyderabad","region":"","postal_code":"500084","country":"India","phone":"040.2311.7817"}]}