{"id":"210252","name":"Equaleyes Solutions Ltd.","tagline":"We create web and mobile apps that stand out.","profile":"/profile/equaleyes-solutions","website":"https://equaleyes.com","directory":"directory/mobile-application-developers","page":"35","verified":"","description":"Equaleyes Solutions is a multi-award winning software development company based in London, UK and Maribor, Slovenia.\nWe build mobile digital products, and we develop, manage, and maintain web systems with millions of monthly users.\nEqualeyes sees things clearly: You want a development partner that really thinks about your project, helping you hit your product milestones while saving you time and money.\nIf bravery, loyalty and excellence are in your vision, Equaleyes will give your vision the passion, dedication and care it needs to fully mature.\nThat's why we don't just develop your technology, we develop a relationship.  We guarantee our partnership will run as smoothly as your technology.\nOnce you become part of our Equaleyes family either as a client, a partner or an employee you can always count on us. We’ll fight for you.\nOur team have a combined 20 years experience in founding and running their own startups and our development team have clocked literally tens of thousands of hours of development for our many clients around the world.\nOur value proposition is pretty simple - we deliver world-class code without the price tag. These are the technologies we excel at:\nBackend: \nPython - Django, Node.js\nJava - Spring, Websockets, Jersey\nWeb Frontend: \nJavascript - Angular, React\nHTML 5, CSS\nMobile:\nAndroid\niOS - Swift\nCloud:\nAWS, Rackspace, Microsoft Azure\nContainers: Docker + Kubernetes\nStorage:\nMongoDB, Object Rocket, MsSQL, Postgres, MySQL\nYou can visit us at www.equaleyes.com for more info or email us at letsgo@equaleyes.com for a free quote on your project.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"37 Heneage Street","locality":"London","region":"","postal_code":"E1 5LJ","country":"United Kingdom","phone":"+44 20 812 314 37"},{"headquarters":false,"address":"Vetrinjska ulica 30","locality":"Maribor","region":"","postal_code":"","country":"Slovenia","phone":""}]}