{"id":"21059","name":"AB-Soft","tagline":"Software Development","profile":"/profile/ab-soft","website":"http://www.ab-soft.us","directory":"it-services","page":"247","verified":"","description":"We specialize in developing applications for any area of today's modern world. These areas include business application, mobile application development, web development, cloud computing or IP telephony. AB Soft is focused on delivering its product which would reflect the highest possible standards, in today's market.\nThe key to the success of the product - those who create it. We employ the best engineers - designers, specialists in quality, support and implementation of software. We are all united by the desire to make our service better, by solving interesting and challenging tasks. We encourage ourclients to bring their ideas to us, none of which will be left without attention.\nWe offer our clients a cloud virtual phone system: service, combining traditional telephony and the latest advances in information technology. This is the telephony of the XXI century.\nWe created our product from scratch, support it, and upgrade and modernize it. RingCentral already has changed the world, by making a professional telephony affordable even for small companies.\nOur system is used by many clients - small and medium businesses, startups and mobile professionals. Our system is for all those who want to get a professional phone system without the cost of equipment and maintenance. We take first place in our market segment: over 270,000 customers have already chosen our service, and this number is constantly growing. We are not resting on our laurels, our goal - to provide the best telephone system for business and increase its customer base to one million in the next few years.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2011","locations":[{"headquarters":true,"address":"1343 San Mateo Ave.","locality":"South San Francisco","region":"CA","postal_code":"94080","country":"United States","phone":"(650) 989-5109"}]}