{"id":"21166","name":"Calabria Technology (Out Of Business)","tagline":"Brilliant Business Solutions","profile":"/profile/calabria-technology-out-business","website":"http://www.calabriatechnology.com","directory":"it-services","page":"79","verified":"","description":"Calabria Technology is a California based Technology Development and Business Services Company. We design, develop, and implement custom technology development, custom applications, websites, web services, SaaS, cloud, enterprise and mobile applications, database management and emerging technology solutions with a core focus on project management, technical expertise, and integration of information technology.\nSince our inception, Calabria Technology has developed a solid reputation as a valued, quality-driven technology partner servicing organizations worldwide. We pride ourselves in providing end-to-end, industry-specific technology solutions tuned precisely to meet the needs of today’s complex, secure, and transaction-driven requirements.  Through our core focus of innovative technology solutions we are committed to providing value to our customers through creative, secure, cost-effective solutions.\nWe have built custom applications and websites from simple to extreme. Our technology development and design teams are proficient in web development including Linux, Apache, MySQL, PHP, Java, JavaScript, WordPress, Joomla, Ruby on Rails, .Net, CSS, Flash and other web 2.0 technology platforms. We have built websites with links to Facebook, Twitter and other social media sites, and websites which process secure credit card transactions and online commerce. \nWe have built mobile applications for IPhone, IPad, Blackberry, Android, Java, Phonegap, HTML5 and Windows mobile platforms. We also can port an application from one mobile platform to another. We have built mobile apps with links to Facebook, Twitter and other social media sites, and apps that manage web services to process mobile or online credit card transactions. We have no limits when it comes to creative design, application development, and functionality. \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"2 - 9","founded":"2008","locations":[{"headquarters":true,"address":"8757 Auburn Folsom Road, #2070","locality":"Granite Bay","region":"CA","postal_code":"95746","country":"United States","phone":"916.245.0707"}]}