{"id":"21215","name":"eSecForte Technologies","tagline":"We helps you realize ideas into Mobile Apps","profile":"/profile/esecforte-technologies","website":"http://www.esecforte.com","directory":"directory/mobile-application-developers","page":"162","verified":"","description":"We at eSecForte Technologies are experts in Mobile Application Development and Information Security. We delivered more than 500+ projects all over the world.\nWe equip your organization to be ahead from your competitors in the time of technology changes. We partner with clients to deliver in following domain:\nMobile App Development: Mobile Applications for iPhones, iPads, Android Phones, Android Tablets and Windows Phones which contains applications such as: basic, complex, or contextual applications, mobile games, utility mobile applications, cross-platform mobile applications and more.\n \nInformation Security Services: Web Application Penetration Testing, Vulnerability Assessment, Computer Forensics and Network Penetration Testing with particular interest in web applications.\n \nIT Services: It helps to build CRM, ZOHO, and provide enterprise cloud solution for our clients.\n \nOnline Marketing: Provide good social networking through a successful channel such as Facebook and Twitter that increased sales and cost efficiency and Mobile Apps Promotion that helps to increase your product popularity\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"Plot No. 311","locality":"Gurugram","region":"HR","postal_code":"122015","country":"India","phone":"+1 9177203785"},{"headquarters":false,"address":"C-3/7 Prashant Vihar, Sector-14, Rohini","locality":"New Delhi","region":"","postal_code":"110085","country":"India","phone":"+911142263289"},{"headquarters":false,"address":"2nd Floor, Prestige Omega No. 104 EPIP Zone Whitefield,","locality":"Bangalore","region":"","postal_code":"560066","country":"India","phone":"+911142263289"}]}