{"id":"21313","name":"IowaComputerGurus, Inc.","tagline":"Quality Development and Support for Your Project","profile":"/profile/iowacomputergurus","website":"http://www.iowacomputergurus.com","directory":"directory/mobile-application-developers","page":"278","verified":"","description":"Who We Are\nIowaComputerGurus, Inc. is a leading provider of custom solutions using DNN Platform and DNN Evoq as well as other modern Microsoft technologies. We have a proven track record building large-scale, high-performance installations, as well as day-to-day websites and intranets that are responsive, compliant, and secure. With more than 11 years of experience, we are a trusted provider to our customers in the United States and around the world.\nAbout Mitchel Sellers\nMitchel Sellers is not only the Founder, CEO, and Director of Development for IowaComputerGurus (ICG), he is also one of its core technical contributors. He has personally managed hundreds of successful website and application projects, served as a technology professor at Des Moines Area Community College, and become a published author – writing and contributing to hundreds of articles and three industry-standard texts on programming for the Microsoft stack. This list of accomplishments is impressive, elevating him to nine-time Microsoft C# MVP, ASP Insider, Microsoft Certified Professional, and DNN MVP.\nMitch has a deep understanding of software development with a focus on proper architecture standards, performance, stability, compliance, accessibility, cloud deployments, and cost-effectiveness. And he is a recognized authority on building applications and enterprise websites on industry-standard platforms – including ASP.NET Core, MVC, SQL, Windows, and the Azure Cloud. But perhaps what customers remember most is his dedication to great service and support and the ability to communicate effectively.\nYou will find Mitch sharing his experience by posting regularly on the technology forums, speaking at internet technology events around the world, and contributing to dozens of open source projects.\nWhen Mitch is not writing code he is spending time with his wife and family and flying his airplane from his home base in Des Moines, Iowa.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2006","locations":[{"headquarters":true,"address":"1680 SW Ankeny Road Suite 1A, Unit 12","locality":"Ankeny","region":"IA","postal_code":"50023","country":"United States","phone":"515.270.7063"}]}