{"id":"21371","name":"Django Stars","tagline":"A technical partner for business across the globe","profile":"/profile/django-stars","website":"http://djangostars.com","directory":"web-developers","page":"2","verified":"","description":"Since 2008, Django Stars has been a technical partner for software development and digital transformation. Whether you are a startup with fresh ideas, or a well-established business eager to transform, we’re ready to offer you solutions that can take you to the next level.\nOver more than 10 years of work, we’ve seen our clients grow from small startups to scalable enterprise companies – and celebrated every launch and success with them.\nAnd we’re eager to continue doing the same with you.\n \nOur values:\nWe’re a technical partner that dives into your business. Our clients emphasize our ability to really understand the business and its long-term goals.\nOwnership and full transparency is what we stand for. We take full responsibility for the development process while giving you access to every member of the team and every piece of process.  \nWe build products people want to use. Great ideas require even greater solutions; that’s why complex projects drive us to provide even better user experiences.\nOur expertise: Web Development, Mobile App Development, Crypto/Blockchain technology, Data Science, UI/UX Design, DevOps, Quality Assurance\nOur technical stack: Python, Django, React, Redux, React Native, iOS, Android, Angular, PostgreSQL, MongoDB, Django REST Framework, Elastic Search, Asyncio, Docker, AWS, etc.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"Glubochitskaya Street, 32B, Floor 3","locality":"Kiev","region":"","postal_code":"04071","country":"Ukraine","phone":"+1 650 741 0045"},{"headquarters":false,"address":"3024 Washington St","locality":"Boulder","region":"CO","postal_code":"80304","country":"United States","phone":"303-459-2283"},{"headquarters":false,"address":"Dianastrasse 5","locality":"Zürich","region":"","postal_code":"8002","country":"Switzerland","phone":"+44 996 8054"}]}