{"id":"215","name":"Paragon Dynamics Info Systems","tagline":"Our Goal Is Your Growth","profile":"/profile/paragon-dynamics-info-systems","website":"http://www.paragondynamics.in","directory":"directory/mobile-application-developers","page":"317","verified":"","description":"Paragon Dynamics is a software development company conceived by experienced professionals of winning combination. We have been able to provide the best of services to our clients across the globe owing to our years of experience in web development and our domain expertise. We have consistently maintained a high standard of delivery for our cost-effective solutions by reducing overheads and unnecessary expenses.\nWe believe in having a team of brains instead of just accounting with hands and legs. We ensure the quality of development by having in place a standard format of documentation for every project that we undertake. The various stages of development, integration and testing are laid out before the project starts. This in turn ensures timely delivery of the project and excelling beyond client satisfaction. Paragon Dynamics can provide solutions for a number of your business and technology needs We can provide a Low-Cost-No-Obligation case study prepared exclusively for your business needs, if you send us a description of your specific IT requirements to gopi@paragondynamics.in Paragon Dynamics has created a culture of trust and performance. The value for our clients is a knowledgeable and stable group of technical people upon whom they can depend. For our employees we offer career development, stability, and a true team environment.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2009","locations":[{"headquarters":true,"address":"3 rd Floor, Arihant VTN Presidency, New No. 50, North Usman Road \nT.Nagar","locality":"Chennai","region":"","postal_code":"600017","country":"India","phone":"+91.44.42122110,+91.44.28144420"},{"headquarters":false,"address":"Lakeside House, 1 Furzeground Way , Stockley Park,","locality":"Uxbridge","region":"MDX","postal_code":"UB11 1BD","country":"United Kingdom","phone":"+44.206.622.3986"}]}