{"id":"215730","name":"Baltic Amadeus","tagline":"Reliable Software For Your Digital Future","profile":"/profile/baltic-amadeus","website":"https://www.ba.lt","directory":"it-services","page":"56","verified":"","description":"Our Vilnius-based team, which comprises 200+ IT professionals, delivers custom software solutions in Europe and the US. With cutting-edge technologies, the latest delivery models and a 96% recommendation rate among customers, we are able to provide efficient business solutions and revenue growth for our clients and partners. We are ready to become a rock-solid digital partner for you.\nBased in Lithuania, a geographical and cultural sweet spot in Europe, we have extensive experience of carrying out major software development projects in Nordic and other Western European countries, as well as in the US. These experiences gives us the skills and knowledge to propose a set of best practices for establishing an agile nearshore development centre (NDC) that allows the use of IT resources when needed and guarantees a fast time to market.\nOur company has become a trusted IT partner for clients from different industries such as telecommunications, finance, shipping, logistics. Expertise and skills in different business sectors enables company to be universal and to face every challenge of this competitive market.\nBaltic Amadeus services:\nCustom software development\nNearshore development center\nMicro-services architecture modernization\nIntegration and data replication\nAnalysis and system design\nUser interface design\nQuality assurance\nSoftware maintenance and 24/7 support\nDevOps\nBaltic Amadeus competences consist of: \nProgress\n.NET\nJAVA\nWeb&Mobile\nUI/UX\nQuality assurance\nProject management\nBusiness analysis\n \n \nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"1988","locations":[{"headquarters":true,"address":"Mokslininkų str. 2A","locality":"Vilnius","region":"","postal_code":"LT-08412","country":"Lithuania","phone":"+370.5278.0400"}]}