{"id":"21933","name":"SEOinhouse.com","tagline":"Enterprise SEO With Management Consulting Flair","profile":"/profile/seoinhousecom","website":"http://www.seoinhouse.com","directory":"seo-firms","page":"58","verified":"","description":"SEOinhouse.com is a team of enterprise-level SEO consultants, founded by Jessca Bowman. We’re a team of former in-house SEOs serving as a trusted adviser for a selective client roster made up of the biggest brands online such as Yahoo! Inc., Microsoft, Salesforce.com, eBay and GEICO.\nMARKETING & DEVELOPMENT OPERATIONS is a primary method used to elevate SEO tactics and Strategy. What would take you months to figure out in your SEO operations, we take days. SEOinhouse.com does what an agency does, but adds the missing component - improving SEO through development and marketing operations. We dive into the processes, tools, resources, teams, and the holes in your SEO program that you didn’t even know existed.\nENGAGED BY BIG BRANDS & THE BEST SEO FIRMS IN THE INDUSTRY to train their SEO and non-SEO teams. We are sent around the globe to strategize and train everyone who impacts the website, equipping them with the 20% of SEO that will give 80% of the impact. SEOinhouse.com is most known for training, process analysis/improvements, novel strategies and hard-core technical SEO.\nWE BRIDGE THE GAP BETWEEN MARKETING AND DEVELOPMENT. We are marketers with a strong technical background allowing us to bridge the gap between both project requirements and how marketing and IT need to collaborate more effectively. SEOinhouse.com uses diverse experiences in project management, website usability, and process analysis to give our clients insight into what needs tweaked, in your complicated enterprise-level world.\nINTEGRATES SEO INTO AGILE TO WATERFALL development methodologies, with development teams of 10s to 100s – proving that our methods are universally applicable.\nPROPRIETARY METHODOLOGY MORPHS companies into a SEO Force to Reckon With. We have a systematic approach to transform your SEO program into a well-oiled machine with an army of 30-100+ people thinking about SEO every day.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"2 - 9","founded":"2008","locations":[{"headquarters":true,"address":"","locality":"St. Louis","region":"MO","postal_code":"63101","country":"United States","phone":"415.662.8084 / 888.899.0195"}]}