{"id":"220751","name":"Media Works","tagline":"An integrated marketing agency","profile":"/profile/media-works","website":"http://www.medialtd.com","directory":"agencies","page":"314","verified":"","description":"Media Works is an integrated marketing agency with specialized capabilities in media research, planning and buying. Clients coast to coast count on us to make their messages work harder and smarter across all media: broadcast, digital, social, cable, direct response and any other channel that will deliver the right message to the right consumer at the right time.\nWe’ve become one of the Mid-Atlantic region’s largest and most respected media marketing agencies because we believe that every dollar spent should produce results. Founded in 1989 and headquartered in Baltimore, MD, Media Works also has offices in Charlotte, NC and Phoenix, AZ. A Woman-owned, certified MBE firm, Media Works is proud member of the 4A’s and was recently recognized as one of Baltimore’s top Women-Owned Businesses and one of Baltimore’s Most Social Companies. We work with clients in a variety of ways: Directly: We work with many clients directly to maximize the way their marketing budgets are spent. And, if they have an in-house creative team or a creative agency, we step in to handle the media. Partnering with Creative Agencies: We complement the talents of creative agencies to offer account and/or media services. We’ll handle the media while they handle the messaging! Outsourcing: If a client has a media team that is overloaded or recently won a piece of new business, but can’t ramp up fast enough, tap into our team of media specialists to complete your media project on time and on budget.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1989","locations":[{"headquarters":true,"address":"1425 Clarkview Road, Suite 500","locality":"Baltimore","region":"MD","postal_code":"21209","country":"United States","phone":"+1.443.470.4400"},{"headquarters":false,"address":"1550 E. Missouri Ave., Suite 200","locality":"Phoenix","region":"AZ","postal_code":"85014","country":"United States","phone":"+1.443.470.4400"},{"headquarters":false,"address":"19733 Hagen Knoll Dr.","locality":"Davidson","region":"NC","postal_code":"28036","country":"United States","phone":"+1.443.470.4400"}]}