{"id":"22109","name":"UNION","tagline":"Digital Marketing Agency","profile":"/profile/union","website":"http://www.union.co","directory":"web-developers","page":"130","verified":"","description":"Union is a digital–first agency. We create experiences that help businesses thrive. We believe that in order to reach and engage with today’s highly connected consumers, all successful marketing programs should lead with digital. We partner with many of the Southeast region’s top brands to craft impactful digital marketing platforms, content and campaigns. We are confident in working with clients ranging from Fortune 500 companies to local startups.\nThe experiences we create dutifully align with our client’s objectives and goals — and deliver measurable results.\nWe are a talented team of enterprise strategists, creatives and technologists that closely collaborate to create amazing experiences. Our work is equal parts thoughtful strategy, superior creative and smart technology that transcends industries, devices and code bases. It is this high-caliber intersection of disciplines that enables us to deliver engaging work and measurable results.\nWe use accurate real-time data to constantly track and optimize how users interact with the platforms and campaigns we create. These quantifiable results allow us to constantly refine our approach so we can measurably improve performance and incrementally increase our clients’ ROI.\nOur work at Union starts by immersing ourselves in our clients’ business. With deep insight into their differentiating factors and marketing messages, we uncover key value propositions and craft powerful brand stories. Once these are articulated, our talented team creates memorable digital experiences that connect consumers with these engaging stories.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2002","locations":[{"headquarters":true,"address":"421 Penman St","locality":"Charlotte","region":"NC","postal_code":"28203","country":"United States","phone":"+1.704.335.5424"}]}