{"id":"22106","name":"BHSoft","tagline":"Web Applications and Mobile Solutions Development","profile":"/profile/bhsoft","website":"http://www.bachasoftware.com","directory":"directory/mobile-application-developers","page":"72","verified":"","description":"Bac Ha Software Co., Ltd. (BHSoft) is a dynamic and fast-moving company in software development and information technology in Vietnam. BHSoft is one of the subsidiaries of BHTech and focusing on software development services.\nEstablished in 2014, BHSoft has been expanding services to world-wide clients from Europe, America, Singapore, Japan and other countries. BHSoft provides the optimum solution that always meets customers’ needs and applies latest technologies on customer’s projects to make it the best applications.\nWe are offering following services:\nOffshore Development Center\nSoftware Development\nProduct Development\nGIS and Map Application\n3D and BIM Application Development\nMobile Application Development\nOur strong management, talent and experienced teams that have proven ourselves to be one of the top Software Development Companies of the market leaders. Being our client, you are always considered as our long-term partner and your business requirement will be carefully evaluated and applied with the best technologies that meet your demand.\nAt the moment, we are experienced with Objective-C/Swift,ReactJS/ React Native, Redis/Redux, GraphQL, C#/ASP.Net Core, JS/JQuery, TypeScript, AngularJS, NodeJS, HTML5/CSS3, Vue.JS, PHP/Laravel, MongoDB, MySQL/PostgreSQL. And familiar with GIS/Web Map View, Cesium, GeoServers, OpenLayers, PostGIS and Three.js, WebGL, 3D Visualization.\nFurthermore, we are using all deployment platforms now like GCP, AWS, Azure, Heroku, Docker. We can apply CI/CD and Unit test into projects implementation.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2014","locations":[{"headquarters":true,"address":"Floor 6th, TechnoSoft Building, Duy Tan Str., Cau Giay Dist.","locality":"Hanoi","region":"HI","postal_code":"100000","country":"Vietnam","phone":"84886160880"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Vietnam","phone":""}]}