{"id":"22110","name":"Fahrenheit Marketing","tagline":"Stellar Customer Service. It's All Inside.","profile":"/profile/fahrenheit-marketing","website":"https://www.fahrenheitmarketing.com","directory":"web-developers","page":"24","verified":"","description":"Fahrenheit Marketing is a company focusing on business growth through effective design, development and marketing of award winning web properties. The agency's portfolio includes publicly traded, international accounts including RJ Reynolds, Citgo Oil & Gas, Sanford Health Systems, Barbara Bush Foundation, NFPA, TransCore International, Transcore Link Logistics and more, as well as well established local brands serving business to business and business to consumers verticals. \nUnlike the sea of faceless agencies with a bloated ego and an attitude to match, Fahrenheit's clients have come to rely and appreciate the stellar customer service offered by the firm. Clients have direct access to the CEO's cell number and should there be any dispute, a resolution always starts with the assumption that the client is always right. \nWhile Fahrenheit Marketing is typically not a fit for everyone, retainer clients can engage with the agency with a monthly commitment as low as $3,000, which in the realm of professional marketing services, is considered very low, especially for reputable, established agencies. \nFahrenheit Marketing capitalizes on leading edge technologies to provide its clients with the latest in design and development and digital marketing for the web. Should you like to explore a potential partnership with our award winning team, we welcome the opportunity with excitement and zeal. \nOur commitment to you, our client, is that you will be treated with honesty, fairness and served with the best we have to offer. Welcome to the Fahrenheit Marketing Family.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"2500 West William Cannon Dr. #205","locality":"Austin","region":"TX","postal_code":"78745","country":"United States","phone":"5122064220"}]}