{"id":"221465","name":"Piton Marketing","tagline":"Web design & marketing for small businesses","profile":"/profile/piton-marketing","website":"http://pitonmarketing.com","directory":"web-developers","page":"411","verified":"","description":"We are a comprehensive marketing company dedicated to being the marketing arm for businesses. At Piton Marketing, we know how stressful it can be to survive in a rough economy, but we also know how to use marketing and advertising to succeed. We can offer advice and experience to get marketing campaigns off to an excellent start as well as the materials needed to get there.\nWe offer a full range of branding and brand development services as well as advertising and direct mail marketing creations. Our graphic designers offer design services that will enthrall you. We can help with logo creation, designing marketing materials, promotional materials, company colors, and more. People are turning to the internet to find businesses. Let us help you get noticed with an outstanding, professionally designed webpage. If you already have one, we also offer audits and assistance for improving performance. Promotional and advertising services are also popular services. We can create banners, tradeshow displays, customized promotional items (bags, hats, shirts, DVD covers, and more), and whatever else you can think of. We pride ourselves on remaining at the cutting edge of the industry, staying on top of the latest innovations and methods. We combine old world marketing with new technology to develop marketing solutions that consistently exceed industry standards. Call us toll free: (877)-236-1110 or email us at newmedia@pitonmarketing.com to get the conversation started.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"150, 6030 Daybreak Cir #293","locality":"Clarksville","region":"MD","postal_code":"21029","country":"United States","phone":"+1.800.399.9640"}]}