{"id":"22176","name":"SKI USA Inc","tagline":"Skill knowledge Innovation","profile":"/profile/ski-usa","website":"http://www.skiusainc.com","directory":"directory/mobile-application-developers","page":"123","verified":"","description":"Creative, energetic, ambitious, young & professional.. a few words that describe the company. Started from a small team of 4, working out of a small office, now has grown to a team of 60+ members and 3 offices located worldwide. Always looking to expand and stay ahead of the curve, by testing new ideas and using the latest technology to achieve the results. \nServices: \n1. Web Design & Development\nAt SKI USA, we offer creative, professional, skilled web design and development services for both small scale and large businesses.Our web design experts have extensive experience in all the latest technologies being used to create powerful user-centered websites, which also includes the creation of mobile friendly sites. \n2. Mobile Application Development\nAt SKI USA, designing mobile apps is an art and a passion. We build apps that cater to the specific demands of our clients and have our heart set to impress all.\n3. Search Engine Optimization\nSearch Engine Optimization (SEO) is the process of improving your business website’s ranking on various search engines like Google, Yahoo, and Bing, to attract customers and ultimately increase your business.\n4. Instant Business listing\nThis Self listing service allows you to list your site on your own. This cost effective solution allows you to sign up with just a few simple steps that get your business listed on the most important local listings sites.\n                  \n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"1002, 10th Floor, DLH Park Near MTNL, S.V.Road, Goregaon (W)","locality":"Mumbai","region":"MH","postal_code":"400062","country":"India","phone":"+91.22.2876.9213"},{"headquarters":false,"address":"A 601/2 Technospace Mumbai-Bengaluru Bypass Highway, Behind Mercedes Showroom, Baner","locality":"Pune","region":"MH","postal_code":"411045","country":"India","phone":"+91.02.0653.61060"}]}