{"id":"22342","name":"NZT Solutions Pvt. Ltd. - Out of Business","tagline":"Our Limitless Innovation will fetch your needs","profile":"/profile/nzt-solutions-out-business","website":"http://www.nztgrp.com","directory":"directory/mobile-application-developers","page":"95","verified":"","description":"NZT Solutions is an ISO certified 9001:2008 tech-savvy, futuristic mobile application development company. With an idea of bridging the gap between technology and services we offer ingenious business solutions to small companies, large organizations and government agencies for productive gains.\nOur strength lies in our proficient team of creative thinkers, strategists, designers and developers who have rich experience in app development. They are well conversant with latest technological knowledge and always go the extra mile on behalf of our clients. Within short period of time we have gained a solid reputation of work efficiency, effectiveness, dedication, and utmost professionalism.\nWe expertise in the following areas:\nMobile App Development & Design\neCommerce & Retail Apps\nCustom Software Development\nSpecialized Enterprise Solutions for Construction, F&B, Entertainment & Education Industry\nWeb Application Development\nToday, we have grown into a large organization with offices across India, US & UK. We have successfully delivered 150+ mobile applications to the world's leading enterprise and consumer-facing companies. We are known for our highly defined transparent development process for customers to track the progress by the entire cycle of development, testing, deployment and training.\nNZT Solutions core strength is excellent project and management skills and consultative approach. Secondly our strength also lies in our all time endeavor to provide higher, trouble free mobile applications to our worthy clients. The quality of our product speaks the valuable efforts we put into every aspects of the product development and delivery.\nIf you want to start discussing your project details, please feel free to contact us.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2014","locations":[{"headquarters":true,"address":"1102, 11th floor, D-Mall, Netaji Subhash Place","locality":"Pitampura","region":"DL","postal_code":"110034","country":"India","phone":"+91.11.47020722"},{"headquarters":false,"address":"258, South 5th Street","locality":"San Jose","region":"CA","postal_code":"94088","country":"United States","phone":"+1.602.388.0496"},{"headquarters":false,"address":"26, St. Josephs Green, Scholars Walk","locality":"Welwyn Garden City","region":"HRT","postal_code":"AL74TT","country":"United Kingdom","phone":"+44.75.7428.9178"}]}