{"id":"2242","name":"Svitla Systems","tagline":"Custom Software Development Company","profile":"/profile/svitla-systems","website":"https://svitla.com","directory":"directory/mobile-application-developers","page":"29","verified":"","description":"Svitla is a proven custom software development company and testing provider headquartered in Silicon Valley. We deliver unparalleled value to our customers, who rely on our expertise in managed teams and build-to-order software applications.\n \nFounded in 2003, Svitla Systems is headquartered in Corte Madera, California, with sales and development offices throughout the US, Mexico and Europe (Ukraine, Poland and Germany). If you are looking to scale up your technical team quickly, we are your trusted glocal partner. \nFor 15 years, we have served a wide range of customers ranging from big corporations and leading young companies in Silicon Valley to large educational institutions on time and budget. The list of our customers includes such well-known companies as Monster.com, BMC Software, Ancestry, Affymetrix, Ingenico, Logitech and Stanford University.\n \nIn addition to delivering build-to-order software projects for our customers, we use our proprietary Team Extension and Managed Team models, where our experienced developers and project managers become a natural extension of the client’s team.  They are being assigned full-time exclusively to the client’s project, making it easy to communicate, contribute and deliver throughout the development process.\n \nOur mission is to build a business that is not only profitable but also contributes to the well-being of our employees and their families, improves our communities, and makes a lasting difference in the world. \nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"250 - 999","founded":"2003","locations":[{"headquarters":true,"address":"100 Meadowcreek Dr. Ste 102","locality":"Corte Madera","region":"CA","postal_code":"94925","country":"United States","phone":"+1 415 891 8605"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Ukraine","phone":""},{"headquarters":false,"address":"","locality":"Guadalajara","region":"","postal_code":"44100","country":"Mexico","phone":""}]}