{"id":"22459","name":"Intetics","tagline":"Where Software Concepts Come Alive","profile":"/profile/intetics","website":"http://www.intetics.com","directory":"directory/mobile-application-developers","page":"51","verified":"","description":"Intetics is a leading global technology company providing custom software application development, distributed professional teams, software product quality assessment, and “all-things-digital” solutions built with SMAC, RPA, AI/ML, IoT, blockchain, and GIS/UAV/LBS technologies.\nBased on proprietary pioneering business models of Offshore Dedicated Team® and Remote In-Sourcing®, an advanced Technical Debt Reduction Platform (TETRA) and measurable SLAs for software engineering, Intetics helps innovative organizations capitalize on global talent with our in-depth engineering expertise based on the Predictive Software Engineering framework.\nIntetics’ core strength is the design of software products in conditions of incomplete specifications. We have extensive industry expertise in Education, Healthcare, Logistics, Life Science, Finance, Insurance, Communications, and custom ERP, CRM, Intelligent Automation and Geospatial solutions.\nOur advanced software engineering background and outstanding quality management platform, along with an unparalleled methodology for talent recruitment, team building, and talent retention, guarantee that our clients receive exceptional results for their projects. At Intetics, our outcomes do not just meet clients’ expectations, they have been exceeding them for a quarter of a century.\nIntetics operates from 10 offices in 6 countries including Naples, FL (headquarters), Chicago, Dusseldorf, London, Minsk, Krakow, Kyiv, Kharkiv, and Lviv.\nIntetics is ISO 9001 (quality) and ISO 27001 (security) certified and a Microsoft Gold, Amazon, and Google Partner. The company’s innovation and growth achievements are reflected in winning prestigious titles and awards, including Inc 5000, Software 500, CRN 100, American Business, Deloitte Technology Fast 50, European IT Excellence, Best European BPO, Clutch and ACQ5 Awards, and inclusion into IAOP’s Best Global Outsourcing 100 list.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"250 - 999","founded":"1995","locations":[{"headquarters":true,"address":"10001 Tamiami Trail N, Suite 114","locality":"Naples","region":"FL","postal_code":"34108","country":"United States","phone":"+1-239-217-4907"},{"headquarters":false,"address":"303, 9/3 Timiryazeva St.","locality":"Minsk","region":"","postal_code":"220004","country":"Belarus","phone":"+375-17-211-2785"},{"headquarters":false,"address":"3-B Novgorodskaya St, Floor 5","locality":"Kharkiv","region":"","postal_code":"61145","country":"Ukraine","phone":"+380-57-760-4877"},{"headquarters":false,"address":"Ul. Marii Skłodowskiej-Curie 5","locality":"Krakow","region":"","postal_code":"31-025","country":"Poland","phone":"+48 500 448 770"}]}