{"id":"225437","name":"Solid Software Solutions","tagline":"Bespoke Software Development that Creates Value!","profile":"/profile/solid-software-solutions","website":"http://solidsoftware.pl","directory":"it-services","page":"57","verified":"","description":"Our Customers range from early stage companies to global enterprises in Travel & Leisure, eCommerce and Fintech sectors. Solid's success relies on team of experienced software engineers, with great industry and academic experience, building new solutions with passion. We are software craftsmen, taking great pleasure from programming, and adopting new technologies.\nAs a full technical stack team we concentrate on feature-driven software development offering our energy, experience, to deliver technology best suiting our customers needs.\nWe deliver a wide spectrum of software consulting and development services starting from building green-field bespoke solutions, applying big-data processign and analytics, introducing machine learning solutions, and ending on modernising and extending legacy software solutions.\nSoftware Development Services:\nCustomized Software Development\nMethodology: Agile, Scrum/XP, TDD\nClose cooperation with the client\nWork in full integration with the client processes (Requirements Specification and Testing)\nFlexibility in requirements documentation (emphasis is on frequent communication, and wiki published documentation)\nConsultancy:\nEnterprise Application Architecture Analysis\nApplying Artificial Intelligence Methods and Predictive Modelling\nBigdata Processing and Analytics\nData Modelling, Datawarehousing and Business Intelligence\nLegacy Systems Rengineering\nSystems Performance Engineering:\nApplying Systems Monitoring and SLA Driven Measurements\nPerformance Analysis, Identifying Problems, Addressing Issues, and Monitoring\nLoad, Stress and Soak Testing\nSystems Redesign and Business Workflows Alteration\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"Jesionowa 9a","locality":"Katowice","region":"","postal_code":"40-156","country":"Poland","phone":"0048 787622787"}]}