{"id":"226781","name":"MJ Kretsinger","tagline":"A Minneapolis Digital Agency","profile":"/profile/mj-kretsinger","website":"https://mjkretsinger.com","directory":"web-developers","page":"597","verified":"","description":"MJ Kretsinger (MJK) is a full-service digital marketing and design agency with offices in Minneapolis, Minnesota. Since 2013, our award-winning agency has assisted mid-size and Fortune 1000 businesses in marketing their products and services online, resulting in increased customer engagement and conversion for our clients.\nEvery great company has a story to tell, and MJK is pleased to have helped to shape the online identity of some of the most recognized brands in the world – something we call Digital DNA. But, being the steward of our client’s online brand is only a small part of what we do. MJK’s experienced team of experts provide unparalleled leadership in search engine marketing (SEO & PPC), content strategy, user experience, design, development, and the ongoing maintenance of websites and web applications. Our client-centric approach and dedication to transparency and integrity, combine with our proven processes to help ensure excellent results and high customer satisfaction. Our approach and dedication to quality has played a key role in the marketing and delivery of hundreds of online solutions for our clients, resulting in over 50 industry awards from Advertising Age, The Webby Awards, and AIGA.\nOur History\nIn 1999, Mike Kretsinger launched his first digital agency called Atomic Playpen. He soon realized that clients were looking for an agency that they could trust to guide them through the pitfalls of the internet, while providing ongoing strategy and support at a fair price. Atomic Playpen grew to 50 people and in 2013, Mike sold Atomic and launched a new digital agency called MJ Kretsinger. Today, Mike and his team of experts at MJK continue to deliver the highest quality marketing and online solutions to their clients. \nWith so much depending on your success, why would you risk going with anyone else?\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"7760 France Ave S, Suite 295","locality":"Minneapolis","region":"MN","postal_code":"55435","country":"United States","phone":"612.327.8067"}]}