{"id":"22869","name":"Stellaractive","tagline":"A strategy-driven creative agency","profile":"/profile/stellaractive","website":"https://stellaractive.com","directory":"web-designers","page":"12","verified":"","description":"We’re fun to work with, and we truly love what we do.\nWe help companies elevate their brand through websites, print, branding and digital marketing solutions that connect, engage, inform and inspire.\nLocated in the iconic city of Portland, Oregon, Stellaractive has helped clients across the U.S. build an engaging online presence since 2007. Our full-service marketing solutions are an affordable way to maintain consistent messaging and drive brand growth.\nWe are a passionate team of strategists, designers, storytellers, developers and all-around creative idealists. Our goal is to help your business grow! Whether you're B2B, B2C, in service or in sales, we can help you!\nOur Services:\nStrategy: Opportunity exists 24 / 7 /365. So how do you know where and when to commit your efforts — and your investment — to get the greatest return? Our approach to strategy development is research-driven and results-oriented.\nBrand Development: Is your business new to market, desperately seeking focus or in need of a fresh new face? We can help you define your mission and create a visual identity that is versatile, memorable and an effective.\nWeb: Your website is an important reflection of your company. Show the world you're serious about what you do, how you do it, and that you're poised to delivery for the long term. We are WordPress and WooCommerce experts.\nDigital Marketing: Discover the right mix so you can extend your reach, capitalize on opportunities, maximize the return on your investment and leave your competition in the dust.\nPrint: From direct mail, trade show presentations and capability brochures to virtually everything in-between.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2007","locations":[{"headquarters":true,"address":"1931 SE Powell Blvd.","locality":"Portland","region":"OR","postal_code":"97202","country":"United States","phone":"5033842413"}]}