{"id":"229068","name":"Divwy Technologies","tagline":"Expedite Business Growth with Divwy Technologies","profile":"/profile/divwy-technologies","website":"https://www.divwytechnologies.com","directory":"web-developers","page":"101","verified":"","description":"Divwy Technologies is a leading Web, Mobile, AR/VR, AI, Big Data & Digital Marketing Company in India which brings the prospect to your lifeless business by continuously nurturing it with cutting edge engineering, which results in higher conversion rate. Be the core part of the team and see the constant traffic coming to the website.\nWe help all types of business from the inception of their website with creative design & development to ensure the gradual increase of relevant traffic to their website. Being currently located in Ahmedabad, Gujarat in India & we plan to expand to establish a global presence.\nStrategy, design, and development are our core pillars and help us suppress every milestone. We aim to build a global client base by providing excellent services. Come, join hands with us and witness the rapid growth in your sales.\nOur mission is to be successful at delivering high-quality Website solutions and helping businesses get the recognition they deserve.\nWe have the vision to expand from our base in Ahmedabad and have a global footprint helping businesses all around the world. \nWe believe in and practice our core values to help shape our office culture:\nHonesty\nExcellence\nRespect\nIntegrity\nTrust\nPassion\nAccountability\nWe are based in Ahmedabad, Gujarat in India; where we have a state of the art infrastructure to ensure all the necessary resources are always available to help us meet the client demands.\nThanking you.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2016","locations":[{"headquarters":true,"address":"107, 1st Floor Earth Retail Nr. Bhadaj Circle, Science City Circle, 200 Ft. S.P. Ring Road","locality":"Ahmedabad","region":"","postal_code":"382481","country":"India","phone":"9727313444"},{"headquarters":false,"address":"1410 Guerneville Road, Suite 18","locality":"santa rosa","region":"CA","postal_code":"95403","country":"United States","phone":""}]}