{"id":"22996","name":"Visuality","tagline":"Business Driven Development Full Stack Team.","profile":"/profile/visuality","website":"http://www.visuality.pl","directory":"web-developers","page":"8","verified":"","description":"PASSIONATE ENGINEERS\nThe vast majority of our developers are professionally trained and experienced software engineers with many accomplished commercial projects, who graduated best Polish technical universities. The recruitment process is extensive, multi-stage and focuses on selecting the right engineering skills and cultural fit.\n \nDIVERSE CULTURE AND FULL TRANSPARENCY\nWe are a diverse, multinational and multilingual company, we speak English on a daily basis, Spanish and Turkish are also heard. We are highly communicative and organized. Given these perks, the whole development process is facilitated and the client fully aware.\n \nBUSINESS ORIENTED\nWe use our best practices for agile project management in the development process which is undoubtedly useful in cooperation with SMEs and startups. Thanks to constant monitoring and cyclic analysis, we predict and mitigate the risk of unforeseen situations and answer to actual business needs.\n \nSTARTUPS\nWe had our share with startup projects built from scratch. Our experienced team helps to define the product, structure it, describe in detail and prepare the strategy. We conduct fully comprehensive MVP/product workshops that allow our clients to see the opportunities, risks and groom the concept.\n \nONGOING DEVELOPMENT\nWe specialize in long-term development projects with large teams working closely with the client, both synchronously and asynchronously. Our know-how and experience gathered throughout the years allow us to audit the code and prepare the strategy to improve the performance and help you in achieving the goals you set. We selected only the best technologies and project management methodologies in order to be able to scale-up your business easily. If you grow, we grow.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"Odolańska 56","locality":"Warsaw","region":"","postal_code":"02-562","country":"Poland","phone":"+48 22 307 1205"},{"headquarters":false,"address":"ul. 27 Grudnia 9/7","locality":"Poznań","region":"","postal_code":"61 – 737","country":"Poland","phone":"+48 22 307 1205"}]}