{"id":"230313","name":"Inteca","tagline":"IT's about business","profile":"/profile/inteca","website":"http://www.inteca.pl","directory":"directory/mobile-application-developers","page":"58","verified":"","description":"Inteca is fintech and regtech consulting company and software provider. Our aim is to build a  better, more sophisticated web and lift the industry standards.\nLeveraging on APIs and API Management to efficiently integrate and scale enterpise architecture, we support banks, financial institutions and large companies, when travel through digital transformation and regulation processes.  \nInteca's engineers have a profound knowledge of working with best-in-class technology solutions, particularly AngularJS or WebMethods to develop refined jet robust software. We provide our clients with excellent services, focused on their business needs. We care for smooth customer journey, as well as for splendid final product.  \nInteca's team is experienced in designing, delivering and integrating software and apps within the customer’s enterprise environment. We bring cloud solutions and help to create a strategy with wide perspective for future growth. We are agile, lean and with an eye for perfection.\nOur industry focus is for big and complex organisations: banks and public sector companies, as well as production firms and large e-commerce platforms.   \nWe are designers of APILOGIC Open Banking API, a ready-made public API enabler for banks. It can help them to be compliant with PSD2 Directive's technical standars faster. Our solution can be transferred over to any system within a reletively short time.   \nPlease do contact us when looking for an excellent technologies and solutions of tomorrow. We are keen to know your technology challenges. \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"","locality":"wroclaw","region":"","postal_code":"","country":"Poland","phone":"+48 71 7156091"}]}