{"id":"230997","name":"Classic City Consulting","tagline":"You don’t have to do web on your own.","profile":"/profile/classic-city-consulting","website":"https://classiccity.com","directory":"web-developers","page":"85","verified":"","description":"As a team of diverse talents, we want to help you tackle the challenges of web. Partnering with us and our team of developers will help bring your vision to fruition. Our goal is to produce high quality work that will expand your business' digital imprint, so you can make a lasting impact on the communities you serve.\nOur Code is artistic The medium of the nuanced relationship between man and machine. We compose clean scripts, stripping out unnecessary fluff, cutting straight to each command.\nWebsite Development\nApplication Development\nStaff Augmentation\nCreative content like blogs, videos, podcasts, posts, + photos allow you to publish your story in dozens of mediums! As developers, we have an intricate understanding of how your brand conversation gets cycled thru the Inter Webs.\nBranding\nContent Marketing\nPrint Media design + printing\nOur Consulting operations keep your business moving forward. For ongoing operations like data collection, posting, updates, security checks, and more, if it’s not easy, it won’t happen. We can make it happen.\nProcess\nMaintenance\nTraining\nOur Give 5 Program\nNo company is an island, and we are committed to investing in the people around us. It can be hard to do that sitting behind a computer all day, so we’re encouraging our employees to leave their offices to find projects they care about. Each year 5% of our employees clocked hours will be in service of others. Through pro-bono work, nonprofit discounts, and volunteer responsibilities, we will give away more than 200 hours by the close of 2018. \nMeet our team https://classiccity.com/story/\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2004","locations":[{"headquarters":true,"address":"104 Cambridge Avenue Suite E","locality":"Decatur","region":"GA","postal_code":"30030","country":"United States","phone":"7707789092"},{"headquarters":false,"address":"","locality":"","region":"GA","postal_code":"","country":"United States","phone":""}]}