{"id":"23134","name":"Scorpion","tagline":"Internet Marketing","profile":"/profile/scorpion","website":"http://www.scorpion.co","directory":"it-services","page":"29","verified":"","description":"Scorpion is an Internet marketing company that caters to professionals in a wide-range of industries. Through their cutting-edge digital marketing solutions, they pride themselves on helping their clients succeed online. For clients who are looking to get a great return on their investment, Scorpion is the one to call.\nFrom paid search to white-hat, effective SEO tactics, Scorpion has proven that they are successful in helping their clients get more: more exposure online, more clients calling, and more revenue.\n \nTheir on-going success has led to them being named to the Inc. 500 | 5000 list for four consecutive years—setting them apart as one of the nation’s fastest growing companies. Their dynamic, beautiful designs have also led to them winning multiple awards; for example, in 2014, they won 10+ different WebAwards and 26 separate awards in the 20th Annual Communicator Awards. Their talents, however, do not end there. In 2014, Scorpion announced that they had been selected into the prestigious Google AdWords™ Premier SMB Partner program—making them the 23rd company in North America to earn this prestigious endorsement.\n \nNot only is Scorpion nationally awarded, but they have a team of experts who are passionate about what they do and who strive to build long-term relationships with clients. Whereas other marketing companies may require clients to go through a ticketing system to get assistance with their website, Scorpion provides clients with their own personalized Marketing Manager who is always available to answer questions, discuss suggestions, and more. Scorpion prides itself on being more than just a vendor, but rather an extension of their clients’ businesses. They consider the only measure of their success to be the success of their clients.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"2001","locations":[{"headquarters":true,"address":"28480 Avenue Stanford","locality":"Valencia","region":"CA","postal_code":"91355","country":"United States","phone":"866.332.3230"},{"headquarters":false,"address":"","locality":"New York City","region":"NY","postal_code":"","country":"United States","phone":""},{"headquarters":false,"address":"","locality":"Dallas/Fort Worth Area","region":"TX","postal_code":"","country":"United States","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Mexico","phone":""}]}