{"id":"23154","name":"Maven Ecommerce","tagline":"Your Maven in the World of Ecommerce","profile":"/profile/maven-ecommerce","website":"https://www.mavenecommerce.com","directory":"web-developers","page":"109","verified":"","description":"We are a software development company with one very clear goal - we want each of our clients to be completely satisfied with our work. We are the team of professionals with almost 10 years of global experience specializing in the development of large and medium-sized sites, web applications, portals with complex and rich functionality.\nThere are more than 20 specialists creating magic in our team, which are:\ndesigners UX/UI\nback-end developers\nfront-end developers\nproject managers\nmanual QA\nBy becoming our client, you get superior consultants, developers, and designers to carry out your project. We highly value our client's time. If you feel that our specialized team can benefit your company, do not hesitate to contact us.\nWe developed software for 95 challenging projects in USA, Europe, and CIS. Our clients say that we create precisely what they need, not just what they ask.\nTools that we use for development are:\nMagento1 and Magento2\nPHP, Symfony framework, Zend framework, Laravel framework\nJavaScript, React, AngularJS\nHTML, CSS, LESS/SASS\nMySQL, PgSQL, MongoDB, Solr, Elastic search\nWhy you should work with us:\nSpecialized in Symfony/Zend/Laravel frameworks;\nFriendly and professional Project Manager\nGood QA;\nWe always complete promises, and sometimes we do more than you expect\nWe manage all our projects using the world-class software by Atlassian\nWe follow the world's best methodology SCRUM, Agile, and Kanban in project management. We track developers' activity in a time tracking system.\n \nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2014","locations":[{"headquarters":true,"address":"1177 Avenue of the Americas","locality":"New York City","region":"NY","postal_code":"10036","country":"United States","phone":"+13024090927"},{"headquarters":false,"address":"Mashynobudivna St","locality":"Kyiv","region":"","postal_code":"03058","country":"Ukraine","phone":"+380673239033"}]}