{"id":"23370","name":"MetaOption","tagline":"Advancing Solutions Through Choice","profile":"/profile/metaoption","website":"http://www.metaoption.com","directory":"directory/mobile-application-developers","page":"107","verified":"","description":"MetaOption LLC a Microsoft Dynamics Gold Partner and a leading solution provider of Microsoft Technologies and Consulting services run by a passionate, professional and highly experienced team for Microsoft Dynamics Business Solutions. \nMetaOption help businesses to innovate and grow by streamlining their finance, operations, customer service, and increase their productivity with Microsoft Business Solutions (Dynamics 365, Business Central/NAV, GP & AX), SharePoint, Power BI solutions.\n \nOur team consists the experience of successful implementations, upgrade and support with experience across the industries. Our deep product knowledge helps us to deliver the best solution to meet our customer’s business needs.\nSome of the major areas, where we excel are-\nMicrosoft Dynamics CRM Consulting, System Integration, Development, Migration, Implementation, Upgrade & More\nMicrosoft Dynamics  365 Busines Central (Previously Dynamics NAV) Customization, Data Migration, Integration with external systems, Development, Migration, Implementation, Upgrade & More\nMicrosoft SharePoint Consulting, Deployment Planning, Implementation, Migration, Collaboration, Application Development & More\nMicrosoft Office 365 Consulting, Deployment, Integration, Migration, Volume Licensing, Distribution & Resell, Technical Support & More\nWeb Application Development Services on various platforms including, ColdFusion, Drupal, Magento, Ruby On Rails (RoR), PHP, Java.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"2500 Plaza 5, 25th Floor Harborside Financial Center,","locality":"Jersey City,","region":"NJ","postal_code":"07311","country":"United States","phone":"2013773150"},{"headquarters":false,"address":"BITS Tower, 6th Floor Plot No -9, Sector - 125","locality":"Noida","region":"UP","postal_code":"201301","country":"India","phone":"91.120.6482680/81"}]}