{"id":"23902","name":"Girnar Software (SEZ) Private Limited","tagline":"Authentic Mobile and Web Solutions","profile":"/profile/girnar-software-sez-private","website":"http://www.girnarsez.com","directory":"directory/mobile-application-developers","page":"12","verified":"","description":"Girnar Software (SEZ) Private Limited, an authentic mobile and web solutions development company, founded in year 2007 with focus on Software development. Employee strength: 900+ top engineers and management professionals from best schools in India & abroad. Having membership of National Association of Software and Services Companies (NASSCOM), Software Technology Parks of India (STPI) and Microsoft BizSpark.\nGirnarSoft is one-stop solution dispenser for all mobile applications, web development and software development services. \nWhat We Do:Web application development\nIT consulting servicesEcommerce SolutionMobile Apps Development(Iphone,Android,Windows)\nOur global software development team for Start-ups and Big Enterprises\nTechnically advanced resources, committed workforce, agile development and cost-effective solutions are substantial highlights of GirnarSoft. We take it further with stronger ability to work with evolved needs of our clients with each solution.\nProject management at GirnarSoft makes the best use of technology to serve you with the most value-oriented and user-specific web and mobile solutions. State-of-art infrastructure, well-defined practices and sophisticated tools mark our global loom of organizational character.\nOur work is all dedicated to best of technology resources and world’s biggest technology enthusiasts. We combine design led approach with tech expertise to build awesome experience for you.\nFunding:\n$15MM: Sequoia Capital, $50 MM: HillHouse Capital &Tybourne, Mr. Ratan Tata (TATA Group) and HDFC Bank also invested in GirnarSoft.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"1,000 - 9,999","founded":"2007","locations":[{"headquarters":true,"address":"IT-A-016-D, IT/ITes Zone of Mahindra World City, Tehsil - Sanganer","locality":"Jaipur","region":"","postal_code":"302037","country":"India","phone":"+91 8430806595"},{"headquarters":false,"address":"62 West, 47th Street, Suite #505","locality":"New York","region":"NY","postal_code":"10036","country":"United States","phone":"914.930.0875"},{"headquarters":false,"address":"9 C & D , 9th Floor, Vaishavi Cynosure, Reliance Trends Building, Opp: Urdu University,Gachibowli, Serilingampally","locality":"Hyderabad","region":"","postal_code":"500081","country":"India","phone":"+91.88904.09920"},{"headquarters":false,"address":"","locality":"New Delhi","region":"","postal_code":"","country":"India","phone":""},{"headquarters":false,"address":"","locality":"Gurgaon","region":"HR","postal_code":"","country":"India","phone":""}]}