{"id":"242499","name":"My Cheap Web Design","tagline":"Affordable Web Design in Vancouver","profile":"/profile/my-cheap-web-design","website":"https://www.mycheapwebdesign.com","directory":"web-developers","page":"650","verified":"","description":"My Cheap Web Design is a web design and development company in Vancouver, Canada. Our affordable web design package is the most popular package. We provide free domain name, free hosting and free email addresses under all our web design packages. My Cheap Web Design Vancouver provides onsite search engine optimization on many of our web design packages.\nIf you are looking for a Vancouver web design company to build your website, My Cheap Web Designers Vancouver is the one for you. With years of experience and quality designs are the main key points for us to standout from other Vancouver web design companies. Even though My Cheap Web Design Company located in Vancouver, but we provide affordable web design services across Canada.\nMy Cheap Web Designers are dedicated and focus on web design projects in order to complete them within the given period of time. And we are always ahead of the game and have finished our web design projects before the deadlines. 100% customer satisfactions is one of our goals and our web design company will go for an extra mile to provide better web design services.\nWithin a very short period of time, My Cheap Web Design has managed to attract more customers and gained their trust as a quality Vancouver web design company.\nWe offer few different web design packages for new business starters and business owners to meet their website design needs.\nOne Page Website Design\nAffordable website Design\nBusiness Website Design\nAdvance Business Website Design\nEcommerce Website Design\nCustom Web Development\nWebsite Redesign Package\nUnlike other Vancouver web design companies, My Cheap Web Design Company offers the most affordable website design services in Canada. Contact My Cheap Web Design company today. We will give you an instant and affordable web design quotes for your website design.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2017","locations":[{"headquarters":true,"address":"422 Richards Street, Suite17","locality":"Vancouver","region":"BC","postal_code":"V6B 2Z4","country":"Canada","phone":"+1.604.316.3064"}]}