{"id":"24248","name":"Lucid Crew Web Design","tagline":"Kick-Awesome Web Marketing & SEO","profile":"/profile/lucid-crew-web-design","website":"http://www.lucidcrew.com","directory":"web-designers","page":"18","verified":"","description":"Lucid Crew is a full-service Austin web design, search engine optimization and development company. We’ve been in business since 1999 – long enough to see dozens of other internet marketing companies rise and fall. Why have we continued to thrive? Maybe it’s our good looks, natural charisma, and great dental hygiene. Or maybe it’s any one of these other things we do:\nWe commit to your success.\nAt Lucid Crew, we don’t just design your site and then let you go. We maintain a positive business relationship, helping your site to grow and change along with your business. When you hire us, you don’t just get a one-time service provider – you get a partner committed to your success.\nWe deliver on our promises.\nA web design company that keeps its promises is harder to come by than you’d think. At Lucid Crew, we take pride in doing exactly what we say we’ll do. We don’t miss deadlines; we don’t go over-budget; and we don’t deliver less than we promise. If we say we’ll do something, we will – it’s that simple.\nWe work with your budget.\nWe work with clients of all sizes, from one-man start-ups to corporations with hundreds of employees. We’ll deliver a quote based on the budget you have, and work to create a design or SEO plan that does what you need – within your budget. If you think you can’t afford us, get in touch anyway. You might just be pleasantly surprised.\nWe’re highly professional.\nOur crew is comprised of experienced professionals who stay on top of the latest industry developments and maintain the highest standards in design, SEO, programming, Internet marketing, and more. We’ve got the know-how to deliver exactly what you need – and provide ongoing management that keeps your site in top shape.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"1999","locations":[{"headquarters":true,"address":"501 N I H 35","locality":"Austin","region":"TX","postal_code":"78702","country":"United States","phone":"512.853.9693"}]}