{"id":"24306","name":"Branded3","tagline":"The go-to agency for search expertise and results.","profile":"/profile/branded3","website":"http://www.branded3.com","directory":"web-developers","page":"511","verified":"","description":"Branded3 is a leading digital marketing agency with highly skilled teams in London and Leeds. \nLaunched in 2003 by CEO Vin Chinnaraja and co-founded by Director of Strategy, Patrick Altoft, the agency has grown to employ over 70 staff and is growing all of the time. Branded3 works with world-class brands including the likes of Virgin Holidays, Symantec and Inchcape.\nBranded3 is most regarded for its successful SEO work and the agency’s reputation means that 80% of its business is inbound. The SEO team is spearheaded by Patrick Altoft and Director of Search Tim Grice, both of whom are frequent public speakers on the topic at industry events.\nThe agency’s growth in the past two years has largely hinged on the team’s ability to deliver online visibility and search-engine rankings success in the wake of two major Google algorithm updates.\nBranded3’s web design & development arm is managed by David Crawford, Managing Director, who was appointed in January 2013 to grow this area of the business. Since David’s appointment, the agency has won a substantial design and development project with Inchcape and become a certified Sitecore partner.\nBranded3’s growth was further fuelled in May 2013 when it was acquired by the St Ives Group, a move which supports the agency’s future international expansion plans. \n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2003","locations":[{"headquarters":true,"address":"2180 Century Way","locality":"Leeds","region":"","postal_code":"LS15 8ZB","country":"United Kingdom","phone":"+44 (0) 113 260 4010"},{"headquarters":false,"address":"72-74 Dean Street","locality":"London","region":"","postal_code":"W1D 3SG","country":"United Kingdom","phone":"+44 (0) 113 260 4010"},{"headquarters":false,"address":"Melcombe Road","locality":"Bath","region":"","postal_code":"BA2 3LR","country":"United Kingdom","phone":"+44 (0) 1225 480 480"},{"headquarters":false,"address":"125 Park Avenue","locality":"New York","region":"NY","postal_code":"10017","country":"United States","phone":"+1 646 971 9378"}]}