{"id":"245805","name":"BJL","tagline":"Stand for something. Take on anything.","profile":"/profile/bjl","website":"http://bjl.co.uk","directory":"web-designers","page":"380","verified":"","description":"BJL is an integrated agency, creatively focused and commercially aware. We work with brands – often challenger brands and nearly always brands in transition – to help them stand out and be successful in today’s world. We believe many voices talking as one are incredibly powerful;  Your social media amplifies your PR which builds on your advertising, which heightens the relevance of your CRM and provides a base for your content creation, and so on. So we work in a way today’s consumers live.\nConnected. BJL is a mix of strategists, planners, creatives, digital and social specialists, PR and brand teams. Our role is most often as lead agency, developing and delivering integrated campaigns. We do this with a team of 85 split across 2 offices: Manchester (Spinningfields) and London (Shoreditch). We’re also part of Tribe Global: a network of owner run and managed agencies spanning markets across 22 different countries. Globally, we are members of Tribe Global, a network of independently owned agencies spanning markets across 22 different countries. Our independence means we can be nimble and adapt quickly to industry developments – investing in areas that will benefit clients.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"1987","locations":[{"headquarters":true,"address":"Black & White Building, 74 Rivington St,","locality":"London","region":"","postal_code":"EC2A 3AY","country":"United Kingdom","phone":"44.0.203.701.6782"},{"headquarters":false,"address":"Sunlight House, Quay St,","locality":"Manchester","region":"","postal_code":"M3 3JZ","country":"United Kingdom","phone":"44.0.161.831.7141"},{"headquarters":false,"address":"","locality":"Stockport","region":"GTM","postal_code":"M18 7JW","country":"United Kingdom","phone":""}]}