{"id":"24601","name":"Vardot","tagline":"Enterprise Drupal Solutions","profile":"/profile/vardot","website":"https://www.vardot.com","directory":"web-developers","page":"2","verified":"","description":"Vardot provides cutting-edge enterprise web solutions, with optimized digital experience and powerful cross-platform content management system, developed on Drupal technology.\nVardot solutions are open-source, built using its own Drupal distributions, thus has lower total cost of ownership and faster time to market.\nVardot covers the whole project lifecycle, from consultation, design, development, implementation, to enablement, with a robust project management and post-launch maintenance, support and growth to guarantee continuity and dynamicity.\nOur achievements speak for themselves. With over 150 enterprise digital experience and business transformation projects in more than 20 countries, Vardot has accumulated unparalleled experience and expertise in all industries and regions.\nOur services are trusted by Vodafone, United Nations, Amman Stock Exchange, The Royal Hashemite Court, Georgetown University, King Khaled University, The American University in Cairo, Acquia, and many others.\nBased in Jordan, with offices in the USA and Egypt, we take pride in being one of the few – if not the only – specialized Drupal solutions provider in the Middle East.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"2075 De La Cruz Blvd","locality":"Santa Clara","region":"CA","postal_code":"95050","country":"United States","phone":"408 329 9888"},{"headquarters":false,"address":"20 Paris St. - Sweifieh","locality":"Amman","region":"","postal_code":"11185","country":"Jordan","phone":"+96265817612"},{"headquarters":false,"address":"12 Ibn Al Nafeis St., Nasr City","locality":"Cairo","region":"","postal_code":"n/a","country":"Egypt","phone":""},{"headquarters":false,"address":"7022 Qanat As Suwais","locality":"Riyadh","region":"","postal_code":"11414 3989","country":"Saudi Arabia","phone":""}]}