{"id":"247122","name":"Chase Design","tagline":"Creating Success!","profile":"/profile/chase-design","website":"https://chrischasedesign.com","directory":"web-designers","page":"1","verified":"","description":"Whether you are starting a new business and need a logo and website to connect with your customers or are an already established company that needs to evolve to the next level – we have the talent, skill set and experience to successfully collaborate with you to take your brand to new heights.\n \nReady to soar above the competition? We have a first-class, non-stop flight to “Creating Success” waiting just for you!\n \nWe are a full-service branding agency.\n \nLet’s work together!\n \nOur Mission\n \nCreate extraordinary value for our clients by connecting business strategy and creative execution.\n \nChase Design, Inc. specializes in graphic design services and consulting for businesses throughout the United States. The firm has built an impressive reputation for producing effective design and has received several awards for excellence in the industry. Chase Design, Inc. has worked for small and large startup firms as well as more established ones. Some of their more prominent clients have included Callaway Golf, Ashworth Golf, The Los Angeles Triathlon, The Nation's Triathlon, Scripps Hospital and Palomar Health. Projects range from advertisements, catalogs, brochures, corporate identity, publication design, product illustrations, 3D design, motion graphics, web design, web development and SEO marketing.\n \nChase Design, Inc. currently employs a team of 4 staff along with several contractors who encompass a wide range of design and programming skills.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2000","locations":[{"headquarters":true,"address":"2011 Palomar Airport Rd - Suite 304","locality":"CARLSBAD","region":"CA","postal_code":"92011","country":"United States","phone":"760.814.2688"}]}