{"id":"247587","name":"Techved Consulting India Pvt.Ltd","tagline":"Redefining Digital Experience","profile":"/profile/techved-consulting-india-pvtltd","website":"http://www.techved.com","directory":"directory/mobile-application-developers","page":"73","verified":"","description":"The current UX/UI scene in India has forever changed due to TECHVED. Co-founded by digital strategist Mohar V and architect Neha Modgil, TECHVED is a global usability and design hub that has become the most trusted brand to provide UX solutions to digital products. The crux of TECHVED’s brand persona is its UX powerhouse that delivers the best digital needs to clients on time. Once any corporation is on board, TECHVED guarantees customer satisfaction through its services.\nAnd with the help of their keen research facilities, usability labs and large databases, they initiate User research and provide exquisite UX solutions. Even though being a young organization, TECHVED has managed to become a thought-leader in the UX domain across all globe.\nToday TECHVED is among the top 5 leading consultancies for UX designs in India. they have handled more than 200 national as well as international clients, such as Disney, Dell, eBay, IndiGo, Flipkart, Kotak Bank, Hindustan Times, Reliance, only to name a few. Along with helping brands with UX design, TECHVED is also one of the leading technology companies that are dealing with Artificial Intelligence. Various news and media companies and technology journalists have covered their work and breakthroughs with artificial intelligence and chatbots.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2007","locations":[{"headquarters":true,"address":"201, Synergy Business Park, Goregaon - East","locality":"Mumbai","region":"MH","postal_code":"400063","country":"India","phone":"09967105359"},{"headquarters":false,"address":"Downtown, Dubai","locality":"Dubai","region":"","postal_code":"00000","country":"United Arab Emirates","phone":""}]}