{"id":"247701","name":"Sid Lee","tagline":"Creative Brand Builders For The Modern Age","profile":"/profile/sid-lee","website":"http://sidlee.com","directory":"web-designers","page":"30","verified":"","description":"One of the industry’s most multidisciplinary agencies, Sid Lee is a collective of makers and thinkers based in Montreal, Toronto, Paris, New York and Los Angeles. We use the power of collaboration to create work that matters across advertising, branded content, social media, digital, design and branding, architecture and retail design, analytics and experiential platforms.\nUsing deep strategic insights, we seek to strengthen our understanding of human behaviour while embracing change, technology and innovation. As a creative business ally, we have achieved international recognition by designing brand experiences rooted in people’s cultures and everyday lives for some of the industry’s most progressive clients.\nOffering fully integrated solutions across the globe, Sid Lee is a member of kyu, a collective of top-tier global creative companies—including IDEO, SYPartners and Digital Kitchen—established by Hakuhodo DY Holdings, the second-largest agency network in Asia. Together, we propel our belief that creativity has the power to move the economy and society forward. Sid Lee also imagined C2 Montréal, one of the largest innovation conferences in the world.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"1993","locations":[{"headquarters":true,"address":"1, Place Ville-Marie, 21st floor","locality":"Montreal","region":"QC","postal_code":"H3B 2C6","country":"Canada","phone":"514.282.2200"},{"headquarters":false,"address":"3585 Hayden Ave","locality":"Culver City","region":"CA","postal_code":"90232","country":"United States","phone":"212.257.4743"},{"headquarters":false,"address":"7, rue de Paradis","locality":"Paris","region":"","postal_code":"75010","country":"France","phone":"314.488.8390"},{"headquarters":false,"address":"952 Queen St. W.","locality":"Toronto","region":"ON","postal_code":"M6J 1G8","country":"Canada","phone":"416.421.4200"}]}