{"id":"24816","name":"1st on the List Promotion","tagline":"Trusted SEO Experts - Driving Results Since 1997","profile":"/profile/1st-list-promotion","website":"https://www.1stonthelist.ca","directory":"web-designers","page":"47","verified":"","description":"1st on the List is a full service boutique SEO company located just outside of Vancouver, BC. Over the last 22 years we’ve used our expertise and experience to help clients with a range of custom SEO services, Pay Per Click Management and SEO Web Design, including website redesign and mobile web design services.\nEach of our core staff has over a decade of experience, having serviced hundreds of SEO clients in Canada and the US in a diverse range of industries and markets. A deep understanding of Search Engine history and how Search Engines work plus our strict adherence to current search engine guidelines enables us to achieve long term, stable visibility for our clients with scalable growth.\nOne of the major differences in our SEO services is that all projects begin with a Detailed Site Audit which helps us identify deeper SEO issues on a website. We help prioritize and fix any issues prior to optimization beginning. In our experience our Site Audits ensure that you will obtain the best results possible. Any amount of onsite updates and linking can’t overcome the foundational issues we find on many sites.\nIn today’s marketplace virtually every web designer and marketing firm offers Search Engine Optimization as an add-on for their clients in addition to their core services. Some even outsource the SEO. Our core focus has always been SEO which means our full attention is on Search Marketing, the latest trends and the best practices. SEO isn’t an afterthought for us – it’s what we live and breathe!\nWe seek to establish long term working relationships with a limited number of clients. We truly care about your website and the success of your business as much as you do. You can count on us.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1997","locations":[{"headquarters":true,"address":"201-33119 South Fraser Way","locality":"Abbotsford","region":"BC","postal_code":"V2S 2B1","country":"Canada","phone":"604.484.2334"}]}