{"id":"248844","name":"Afterlogic.Works","tagline":"Full-stack web&app development agency since 2002.","profile":"/profile/afterlogicworks","website":"https://afterlogic.works","directory":"directory/mobile-application-developers","page":"61","verified":"","description":"We are full-stack web development agency focused corporate expertise and developed popular proprietary products that have become industry standards in their sectors (https://afterlogic.com/) and a pool of clients consisting of hundreds of leading global companies (https://afterlogic.com/clients ) Ready to discuss a long-term partnership.\nWe specialize in corporate mail, private cloud file storage, data privacy and encryption, notification and messaging systems, data synchronization.\nThe main stack is PHP / Node.js, the additional one is JS / Flutter.\nOur specializations:\n1. Corporate Storages: Development of self-hosted Corporate storages. Access from the Web, DAV, Mobile Applications. Secured by strong encryption.\n2. Corporate and Mass Messaging: Self-hosted transactional and mass mailing services like email/SMS/push-notifications. High loaded solutions based on Docker. \n3. Email and Webmails: Messaging systems (webmails with threads, chats). Integration with any hosting control panel. Single Sign-On (SSO). Data synchronization.\n4. Privacy. Message encryption: Browser-based encryption (AES-256). The server has no access to the encryption keys. Integration of peer-to-peer encryption to your platform. \n5.  Synchronization: Data synchronization between your platforms, services, applications, mobile devices (contacts, calendars, files, and folders). Integration with ActiveDir, LDAP, DAV.\nWe are located in Russia, the city of Taganrog. We have a legal entity in the USA.\nWe have a great portfolio and clients list. We worked with enterprises like Acision / XURA, Medicity and Netcore, and startups like Citybook.\nPlease see our website to learn more — https://afterlogic.works\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2002","locations":[{"headquarters":true,"address":"Petrovskaya 89B","locality":"Taganrog","region":"ROS","postal_code":"347900","country":"Russia","phone":"415.513.0152"},{"headquarters":false,"address":"113 Barksdale Professional Ctr.","locality":"Newark","region":"DE","postal_code":"19711","country":"United States","phone":"415.513.0152"}]}