{"id":"25025","name":"zGames","tagline":"External Game Development Services","profile":"/profile/zgames","website":"http://www.zgames.com","directory":"directory/mobile-application-developers","page":"8","verified":"","description":"zGames is a game development studio that stepped onto the video game playground back in 2008. It's a team of 40+ gaming pros ready to lend a hand to other companies from gaming, educational, corporate and advertising fields and develop Unity-powered games from scratch for them. Our portfolio features 20+ titles and includes successful team-ups with clients from USA and Europe, including Big Fish, Taito and Atari.\nzGames helps companies that are up against the lack of resources, absence of expertise or working against tight deadlines with:\nfull-cycle game development\ngame design and level-design\ngame art creation (2D, 3D, pixel art)\nFlash-to-Unity migration\nWebGL game development \nzGames team accommodates the needs of companies seeking to build:\nnative and cross-platform games for mobile devices;\ngames for consoles and microconsoles (PlayStation, PS Vita, OUYA, NVIDIA SHIELD, GameStick, FireTV, etc.);\nbrowser and PC games.\nThe team is ready to bring into play its skills, experience, and performance excellence to cover the implementation of such game genres as:\nadvergames & brand promotional games;\neducational games;\ncasual games;\nRPGs, arcades, strategies, FPS, action-packed adventures;\ngames with gambling and social features, and advanced mechanics;\nAR and VR games for Oculus Rift, Microsoft Hololens, PS Vita etc.\nWe always keep tabs on the latest advancements on the tech landscape, and employ the latest techniques to wow players around the world, including:\n2D & 3D modeling;\nSmart prediction AI;\nVirtual/Augmented reality;\nSynchronous and asynchronous multiplayer\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"1155 Dairy Ashford Suite 115","locality":"Houston","region":"TX","postal_code":"77079","country":"United States","phone":"281.552.5005"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"","phone":"888.576.3837 toll-free"}]}