{"id":"25071","name":"CTI Digital","tagline":"Marketing • Design • Development","profile":"/profile/cti-digital","website":"http://www.ctidigital.com","directory":"web-developers","page":"8","verified":"","description":"Established in 2003, we’re now one of the UK’s leading full-service digital agencies with a growing team of over 40 talented and creative individuals.\nWe provide bespoke web solutions using open source technologies such as Drupal, Magento, Grails and the Zend Framework. We've chosen the best web technologies for content management systems, e-commerce, bespoke applications and integrated solutions - so we’re able to match the best technology to the needs of your business. Our developers are split into technology-specific teams to ensure that each project gets the expertise and attention it needs.\nOur dedicated marketing team are available to help with all of your digital marketing requirements, from consultancy and planning through to delivery and reporting - we’ve got the experts to help. We aim to drive more, relevant traffic to your website, engage with your customers across all channels to increase conversions, enhance your visibility and ultimately, drive sales.\nWe also work directly with clients, providing full-service digital solutions and collaborate with advertising, branding and creative agencies in need of a web development services. In addition, we offer support for large-scale development projects and assist partner development agencies where a high-level of technical expertise is required.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2003","locations":[{"headquarters":true,"address":"5th Floor, 31 Dale Street","locality":"Manchester","region":"","postal_code":"M1 1EY","country":"United Kingdom","phone":"+44 84 5620 0014"},{"headquarters":false,"address":"17 Macklin Street","locality":"London","region":"","postal_code":"WC2B 5GN","country":"United Kingdom","phone":"+44 20 3384 7241"},{"headquarters":false,"address":"","locality":"Stockport","region":"GTM","postal_code":"M18 7JW","country":"United Kingdom","phone":""}]}