{"id":"252327","name":"The Works","tagline":"AUSTRALIA'S CREATIVELY WIRED AGENCY","profile":"/profile/works","website":"https://theworkssydney.com","directory":"web-designers","page":"428","verified":"","description":"Like a few start-ups you might have heard of, The Works began with little more than the passion of two entrepreneurial, creative people. It started on the streets of Sydney, in a van driven from client meetings to shops with shelves full of products. It was seen parked beach-front locations where Kevin and Damian came up with ideas and solutions before driving back to the client to present.\nThis humble approach of creatives working directly with clients combined with really getting to know clients’ products and services and how and when consumers bought and used them – what today we might call data – shaped our unique ‘Creatives on the Forefront’ model. Fast forward 14 years and we are no longer just two front seats of a van but instead have over 90 desks spanning three floors, a content agency called Fifty Patrick’s, and Australia’s first messaging specific agency, On Message. As we have evolved, so has our approach, ensuring we stay relevant in a rapidly changing industry. Not only are creatives still on the forefront but they are creatively wired, ensuring they have access to the best data to make informed decisions - not just for the brief but the whole business. This immersive and agile approach means that our teams have multi-disciplinary skill sets. Now there are a few buzz-words in that sentence, but what it essentially means is we’re both excited by, and capable of, every possible way to create extraordinary ideas that produce award winning results. Our passion for disruption, digitalization and data ensures that as channels multiply and mutate we continue to connect our clients with their audience.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2002","locations":[{"headquarters":true,"address":"4 Glen Street,","locality":"Milsons Point","region":"NSW","postal_code":"2061","country":"Australia","phone":"+61.2.9459.4500"}]}