{"id":"252402","name":"Hunt Adkins","tagline":"Minneapolis ADVERTISING AGENCY","profile":"/profile/hunt-adkins","website":"http://www.huntadkins.com","directory":"web-designers","page":"574","verified":"","description":"We are artists, writers, strategists, planners, social media mavens, technology geeks, masters of all things digital. We are nonstop thinkers, mad geniuses, eccentric recluses, relentless tinkerers, discontent perfectionists, obsessive wordsmiths, quiet doodlers, caffeine-addicted taskmasters, demanding status-quo challengers, impassioned idealists, nurturers of nascent notions, egalitarian embracers of ideas and writers of really long sentences.\nWe are night owls and morning larks, dog lovers and cat devotees, Packer fans and Vikings die-hards, beer drinkers and wine snobs, extroverts and wallflowers, comedians and tragedians. We are madcap flingers of adjectives. We are bookworms who like nothing better than to curl up with a good thesaurus. We are unfettered. We are heretical. We are cold in January. We are the exception to all sorts of rules. We are morally and fundamentally opposed to layered, bureaucratic, Brobdingnagian agencies that purport to solve problems by throwing more people at them. We are users of words like Brobdingnagian. We add un to ordinary, in to imitable and anti to all things establishment. We are proof that marketing on a global basis is not the sole province of inefficient, monolithic agencies that would have you throw money on a bonfire if they had a sudden urge to roast a marshmallow. We believe that big ideas have sharp edges and sanding them off leaves you with a featureless lump of bland. We are sharp edges and dangerous corners. We are anarchists who throw Molotov cocktails of ideas around with wild abandon to drive back the Hordes of Milquetoast and make our clients kings and queens of a more interesting world. We are fascinated and fascinating. We are impossible to reduce to a few words.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1991","locations":[{"headquarters":true,"address":"15 SOUTH 5TH ST, 12TH FLOOR,","locality":"MINNEAPOLIS","region":"MN","postal_code":"55402","country":"United States","phone":"1.612.339.8003"}]}