{"id":"25284","name":"Chapter247 Infotech","tagline":"Software Dev | Cloud Consulting | Web | AI | IOT","profile":"/profile/chapter247-infotech","website":"http://chapter247.com","directory":"directory/mobile-application-developers","page":"75","verified":"","description":"Chapter247 Infotech is a full-service software partner specialized in architecting, designing & developing tech solutions by binding Web, IoT, Analytics, AI and Cloud technologies. Our global clients include organizations right from Enterprise, Midsize to startups.\nIn 6+ years we have launched over 100 products with ambitious clients in industries like E-commerce, financial services, healthcare, education, shipping, energy, and retail.\nKey Capabilities-\nWeb and Mobile-centric Product and Application development\nEnterprise Application services ( Development and Legacy Modernization)\nProduct Engineering ( MVP, Product development, support, and maintenance)\nIoT Applications\nMobility Solutions\nCloud Consulting ( Application Migration, DevOps planning, and Automation)\nWith Technology and ever-evolving culture as top priorities, you will work with...\na Business Strategist that is highly experienced in combining business strategy and user experience to fill in the business gap we aim to solve\na UX/UI Designer that will pair consumer grade creative with intuitive interaction design to elegantly produce design solutions that engage\na Solution Architect that architects your product with the right technologies and tools keeping in mind the ever-changing IT world\na Development team that loves tech and programs the product idea to life with an innate attitude of no compromise in quality\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2012","locations":[{"headquarters":true,"address":"5030 Coggins Rd","locality":"Reno","region":"NV","postal_code":"89506","country":"United States","phone":"+1 (775)-835-4055"},{"headquarters":false,"address":"301, Prosperity Building, 1 Diamond Colony","locality":"Indore","region":"","postal_code":"542001","country":"India","phone":""}]}