{"id":"25326","name":"INCITRIO","tagline":"Start Fresh","profile":"/profile/incitrio","website":"http://incitrio.com","directory":"web-designers","page":"22","verified":"","description":"INCITRIO | a branding & marketing agency\nAt Incitrio, we pull together best-in-class, 100% USA talent to give you the highest caliber creative combined with exceptional customer service. Our team’s combined years of experience easily exceeds one hundred years and our founder’s experience working with Fortune 500 brands greatly enhances the work we do with both our local and global clients.\nWe’re a boutique agency with all the efficiencies of a smaller shop. But make no mistake about it: our team’s industry experience is rock solid.\n \nIncitrio’s founder and Chief Creative Officer, Angela Hill, brings big agency experience to all of Incitrio’s clients. Throughout her 20-years in the industry, Ms. Hill has worked with Fortune 500 brands such as: Mars Candy, Energizer, Williams Sonoma, Ford, Anheuser Busch, Merrill Lynch, PG&E, Visa, Maersk, Sun Microsystems, Intel, Foster Farms, SEGA, Jabra, Taylor Guitars, Arena Pharmaceuticals, Acadia, and more.\n \nOur agency’s growth philosophy is simple. We’re more interested in doing really great work than becoming the next Ogilvy. We’d rather invest in a long-term relationship to truly grow a brand than chase short-term monetary gains for quick hit projects. We take on clients when we truly believe we can make a difference to their bottom line and deliver real results. Likewise, we take on clients who are committed to what it takes to be successful. If you’re passionate about your business and looking for a true agency partner, then we’re the perfect fit for you!\n \nINCITRIO | a branding & marketing agency\n12526 High Bluff Drive, Suite 300, San Diego, CA 92130\nphone: 858-523-1822 | web: www.incitrio.com\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2004","locations":[{"headquarters":true,"address":"12526 High Bluff Drive, Suite 300","locality":"San Diego","region":"CA","postal_code":"92130","country":"United States","phone":"858.523.1822"}]}