{"id":"254709","name":"Designs By Mote","tagline":"Creative Solutions for Growing Business","profile":"/profile/designs-mote","website":"http://www.designsbymote.com","directory":"web-designers","page":"863","verified":"","description":"DBM know's how the advertising game works. We made the process look simple, even before the computer revolutionized this industry. And now, we have the best machines available to continue the tradition. Our excitement is contagious so prepare yourself to be thinking about DBM. \nWhy DBM - We are the go-to group. We focus our energy on your projects and objectives in a manner unsurpassed by any large agency. Tight deadline or tight budget, DBM is the one to think about for your complete visual communication demands.\nExperience - As an agency and as individuals, we bring a broad scope of experience to the table in a wide variety of industries. In today's business climate, that kind of knowledge is a powerful tool for our clients. It enables us to clearly see how each product or service our clients offer can contribute to better functionality for the end user, whether that is a general consumer or a B2B consumer. Your business is very important to us and our job is to ensure that our clients become our partners.\nWe Get Results - When the consumer feels a certain affinity to a brand, that's the result of good work. Creating solutions for companies that get results begins by coming up with ingenious ways to get people to interact with the company through its advertising and marketing programs. Number one in package design for NIKKO American, record response on direct mails for LanOptics, an image revamp Healthaxis, just to name a few. Let us do the same for you.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"Undisclosed","locations":[{"headquarters":true,"address":"7447 La Sobrina,","locality":"Dallas","region":"TX","postal_code":"75248","country":"United States","phone":"972.951.9758"}]}