{"id":"25519","name":"Cymax Media","tagline":"Helping Businesses Reach New Heights","profile":"/profile/cymax-media","website":"http://www.cymaxmedia.com","directory":"web-designers","page":"33","verified":"","description":"Cymax Media is a full service website design and development agency that was founded over 18 years ago with the goal of becoming a leading national marketing, search engine optimization and design company. We have clients from all over the country and around the world and have had the privilege of working with over 400 different clients, from visionary startups to leading commercial and industrial businesses.\nOur greatest reward is watching the success of our customers as they top the competition and grow to become greater than they ever dreamed of. \nWith a special focus on mobile website design, Cymax was one of the first companies to ride the wave of the future in developing well-built, attractive sites that glide seamlessly across any device. Everything we do is goal-oriented and taken from a marketing approach, including our digital outreach strategies. \nWe also place a high priority on search engine optimization, and building our sites to be friendly to the search engines. We understand how valuable it is to be in Google's top ten organic search results, and work tirelessly to help our clients stay on top amidst the constant changes that happen in the world of SEO. Following best practices that never include black hat techniques is our priority, both for our own business and the long-term success of our customers. \nYou can trust that you are in good hands when you hire us to do any project, whether it be garnering more traffic to your website or delivering materials for print and advertising. Whatever your task, our exceptionally qualified team of graphic artists, SEO analysts and powerful programmers are sure to take your business to new heights. \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"2 - 9","founded":"2000","locations":[{"headquarters":true,"address":"1023 Buttermilk Road","locality":"Larkspur","region":"CO","postal_code":"80118","country":"United States","phone":"303-681-2020"}]}