{"id":"25599","name":"Merge Design + Interactive","tagline":"Ready to Merge?","profile":"/profile/merge-design-interactive","website":"http://www.mergeworld.com","directory":"directory/mobile-application-developers","page":"369","verified":"","description":"The traditional advertising agency is rooted in a mindset and structure that are increasingly at odds with a fast-moving digital world. We founded Merge Design + Interactive 11 years ago because we envisioned the necessity for a new kind of agency, one that could meet brands' ever-evolving needs.\nOur Chicago shop's inherently fluid culture and mindset were designed to foster the organic growth of roles and ideas. We merge enterprise-level development skills with creative design to elevate the user experience, and this focus allows Merge to work seamlessly from ideation all the way through to back-end production. We think big--and small: Our expertise in strategy, creative, tech development and product development solutions gives us the vision and know-how to deliver the big picture as well as the many micro pixels that comprise it.\nGiven our fluid approach, our thinking is not limited to the typical agency scope, and as a result, we design and implement technology-based solutions for companies across a range of industries. We have created more-efficient, proprietary technology platforms for clients, helped start-ups disrupt their industries with Internet-based business models and even turned a toy plagued with a myriad of logistical headaches into a big-box retail success story that has captured the imagination of kids, inventors, engineers and artists.\nThe growth of our business speaks to the relevance of our business model. We’ve seen revenue growth over each of our 11 years in business, exclusively through repeat business, referral and word of mouth. Additionally, Inc. Magazine has recognized Merge as one of the 5000 Fastest Growing Companies for the past two years, last year moving up to the 1042 on the list. We've also been recognized by the Inner City 100 for our five-year growth as the 22nd fastest growing company in the country and the second fastest growing agency located in inner cities.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"600 W Van Buren St.","locality":"Chicago","region":"IL","postal_code":"60607","country":"United States","phone":"312-787-7667"},{"headquarters":false,"address":"","locality":"Boston","region":"","postal_code":"","country":"United States","phone":""}]}