{"id":"256995","name":"AsOne Digital","tagline":"Digital Business Development","profile":"/profile/asone-digital","website":"https://www.asone.co.uk","directory":"web-developers","page":"226","verified":"","description":"Based just outside of Manchester city centre, England, AsOne are a full service digital agency who boast more than a decade of experience in web development and digital marketing in a wide range of industries and sectors. For your money, you get access to SEO experts, PPC specialists, web developers and graphic design, or any combination thereof - think of us as an entire department for your business, for less than the cost of a single junior employee.\nWith AsOne, you can grow your business, build your presence and extend your reach all from one office and under one contract - and that means your digital project is as joined up as it would be if it was taking place from your own desks. Our success at AsOne is built on our close and longstanding relationship with our clients, allowing us to move from being an external aid to business to truly becoming an extension of the business plan - fully immersing ourselves in the business' vision and goals.\nWe've worked with businesses who don't know the first thing about digital, to verifiable experts that just needed their presence refreshing. We understand that handing over your digital presence and reputation to a third party can be daunting, and want to involve you in all parts of the process as much as you want to be.\nWe only succeeed when our clients succeed, and we always have your best business interests at heart. Talk to us today to discuss your digital project, however large or small, on +44 (0)161 368 9100 or at here@asone.co.uk\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2001","locations":[{"headquarters":true,"address":"Mary Street,","locality":"Hyde","region":"GTM","postal_code":"SK14 4RD","country":"United Kingdom","phone":"0161.368.9100"}]}