{"id":"25722","name":"iD EAST","tagline":"Best practices of mobile development","profile":"/profile/id-east","website":"http://id-east.ru","directory":"directory/mobile-application-developers","page":"4","verified":"","description":"We are iD EAST — a mobile software production studio. We create effective mobile solutions for business. Our portfolio includes more than 150 mobile solutions: applications for banks, restaurants, online stores, fuel networks and others.\nWe are professional team of project managers, mobile developers and Internet marketers — the best graduates of Russian universities. We provide full product cycle: analytics and consulting, design, project management, developing and testing, promotion, support.\nWe work with big and successful companies to create useful and profitable mobile applications. We participate in the implementation of promotional applications with using a variety of technologies (including augmented reality). Also we have extensive development experience in the field of mobile advertising, digital media, mobile payments, integration of software products based on SAP.\nThe aim of iD EAST is effective interaction with a customer to achieve a common goal — release of a useful and demanded software product. To achieve this goal it is required to perform certain procedures and mechanisms for formalizing all the processes of development control and reduce the risks of financial and time losses. That is we follow accepted successful practices in the field of project management and perform our obligations iteratively: as an internal standard we have adopted a Corporate project management system for regulation of the sequence and the content of each stage of development.\nWork is performed in accordance with Project Management Body of Knowledge and functional modeling methodology of IDEF. We base on well known practices and our own previous experience developing software solutions in the field of IT.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2009","locations":[{"headquarters":true,"address":"Leo Tolstoy","locality":"Moscow","region":"","postal_code":"","country":"Russia","phone":"+7(495) 795-67-78"},{"headquarters":false,"address":"Kalinina","locality":"Volgograd","region":"","postal_code":"","country":"Russia","phone":"+7(495) 795-67-78"}]}