{"id":"25873","name":"Stone Labs","tagline":"IT solution company","profile":"/profile/stone-labs-0","website":"http://www.stone-labs.com","directory":"web-developers","page":"30","verified":"","description":"To us at Stone Labs best business is a clever business. Being IT Consultancy and Custom Solution Development company, we purely believe that ongoing improvement is the only way to gain success for the businesses at today’s competitive environment.\nTo our mind, managers should use objective factors and measures for their decision making and not rely fully on their thoughts, feelings or transition of the recent experience. That’s why we propagate the so-called Data Driven Approach to significantly increase the performance of the organizations. We do that through:\nData Mining, Warehousing and Modeling – to create efficient Big Data flow;\nData Analysis and Visualizations – to find bottlenecks and advantages of the current business processes;\nPredictive Analysis and Deep Learning – to identify the best approach that will skyrocket the future efficiency;\nCombining all the mentioned Business Intelligence techniques into one IT solution – to automate the process and have a tool that will bring real value for the business.\nOur team of 30 passionate business analysts, data scientists and software engineers is always exited about new challenges, and more often we are working in the following domains:\nGeneral Marketing & Sales (customer profiling & segmenting, sales predictions & analysis);\nRetail (automatic cross/up/down-selling, supply chain optimization);\nBanking (personalized customer proposition development based on the transactions analysis);\nProfessional Sport (creating data-driven training systems for the national level federations).\nOur main tech stack is all around PHP, Ruby, Python JavaScript and Node.js, as well as Laravel, Ruby on Rails, Django, and lots of other tech frameworks.\nData is something that really drives us. And we’d love to share this passion with you! Challenge us to figure out how our approach could help you!\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"21-10 Geniu","locality":"Vilnius","region":"","postal_code":"LT11216","country":"Lithuania","phone":"+370 608 46 481"},{"headquarters":false,"address":"17 Lopatina Str.","locality":"Minsk","region":"","postal_code":"220125","country":"Belarus","phone":"+375447124061"}]}