{"id":"25925","name":"NS804","tagline":"Mobile Application Development Experts","profile":"/profile/ns804","website":"http://www.ns804.com","directory":"directory/mobile-application-developers","page":"3","verified":"","description":"NS804 is a full-service mobile application development firm based in Richmond, VA. Specializing in native iOS and Android mobile app development, NS804 has produced over 100 apps since 2012.\nWe are humble. We take the time to learn what your business does, where it’s headed, and what you want to achieve.\nWe are passionate. We work tirelessly to give you the best possible product, and treat your goals as our own, because when we succeed, we succeed together.\nWe are unified. We are a complimentary team of designers, coders, project managers, app store optimizers, testers, and writers. We work with each other to better work with you.\n \nWe are grateful. We are thankful for every opportunity that comes to us - whether you’re an appreneur with a small budget or a fortune 300 company.\nWe are here to provide a service. We recognize that your ideas are the currency we work with, and we do our very best to provide you with a clear plan from start to finish.\nWe develop for both Android and iOS platforms, with a mastery in Java, Objective C, and Swift. We use our knowledge to help our clients understand the development process, their best path to market, and their options for capitalizing on their app’s success. We pride ourselves on our expertly-honed development skill set, and our commitment to not only produce high-quality apps, but to partner with our clients, acting as their tech-liaison to help develop and grow their app with our proven user acquisition and retention strategies.\nWe’re excited about new or un-tested ideas, and are always searching for new ways to solve problems to create a better, more connected, and more efficient world. We’re here to develop for you, grow with you, and together, make great, affordable, and reliable apps.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2012","locations":[{"headquarters":true,"address":"5412 Glenside Drive Suite F","locality":"Richmond","region":"VA","postal_code":"23228","country":"United States","phone":"804-208-0676"}]}