{"id":"259698","name":"Bloominari","tagline":"San Diego Digital Marketing & Creative Agency","profile":"/profile/bloominari","website":"http://www.bloominari.com","directory":"web-designers","page":"723","verified":"","description":"Bloominari is a full service, small business marketing agency that uses a variety of online marketing strategies to enhance businesses’ online image, generate leads and make businesses bloom. We love to help growing businesses and they love our results.\nLocated in San Diego, California, we are a leading bilingual digital marketing company in the area providing business strategy, marketing, content and design solutions for small businesses nearby and throughout the country. Our firm’s passion for consulting, design, technology, working with people, and exploring the complex realm of doing business in today’s world is what drives the team to constantly seek innovative ways to help companies embrace change, grow and succeed.\nOur team has the creative ideas, the ambitious drive and the know-how that only comes with more than a decade of experience. We are proud to have been helping growing businesses bloom since 2003.\nWe would love to help you with your business goals or marketing visions!\n \nOur services include:\nBRAND & ONLINE IDENTITY\nBrand Identity & Graphic Design  \nBuilding Your Online Presence  \nPromoting Your Company & Brand  \nMARKETING SERVICES \nOnline Marketing (SEO, Digital Advertising, Email marketing, etc)\nLanding Pages, Conversion Tracking  & Analysis\nSocial Media Management & Engagement\nContent Strategy & Blogging\n \nAUTOMATION & TECH SOLUTIONS\nLead Generation, Scoring & Segmentation\nLead Nurturing via Email Marketing\nMarketing Automation, CRM & Cloud-based Solutions  \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"2159 India St.","locality":"San Diego","region":"CA","postal_code":"92101","country":"United States","phone":"619.354.1118"}]}