{"id":"259890","name":"DASH TWO","tagline":"Expert Media Buying Agency Digital and Outdoor","profile":"/profile/dash-two","website":"http://www.dashtwo.com","directory":"agencies","page":"6","verified":"","description":"Our proven approach to media buying is both simple and powerful. First and foremost, it's grounded in collecting and analyzing relevant data. With a keen understanding of what the numbers are telling us, we proceed to collaborate closely with our clients – continually checking, rechecking and refining to optimize campaigns at every possible opportunity. The result is a streamlined media plan that's properly positioned for the greatest return on investment.\nAdd this to our pride in consistently meeting tight deadlines, our insistence on extraordinary service, and the experience to work effectively with any budget, and you've got the perfect agency for any media buying challenge.\n \nThe Outdoor Advertising Experts\nWe believe in the power of outdoor advertising because we have seen it work. We sing its praises to our clients, and they become converts. Why? Because it presents the perfect balance of effectiveness and efficiency:\nFACT: People not only remember outdoor ads, they also recall the products being advertised.\nFACT: Outdoor is among the least-expensive forms of advertising.\nFACT: Outdoor ads just look cool.\n(We admit that last one’s not really science. But it’s true.)\nOutdoor advertising introduces something new and unexpected to the landscape that draws your attention. While most often outdoor advertising consists of a billboard, it also includes a variety of other formats as well. When deployed correctly with the right thinking behind them, they can become a game-changer for so many clients.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"5555 Inglewood Blvd Suite 204","locality":"Culver City","region":"CA","postal_code":"90230","country":"United States","phone":"+1.310.439.2356"},{"headquarters":false,"address":"2008 21st Ave S","locality":"Nashville","region":"TN","postal_code":"37217","country":"United States","phone":"+1.615.647.7797"}]}