{"id":"260190","name":"Lemon Business Solutions","tagline":"Call Centre Solutions with added Zest","profile":"/profile/lemon-business-solutions","website":"http://www.no-sour-business.co.uk","directory":"bpo","page":"36","verified":"","description":"Lemon is a 24/7 call management centre located in the North East of England offering bespoke call answering solutions to quality focused clients throughout the UK and internationally. We’re not your average call centre, we’re a dynamic highly professional team, eager to provide an outstanding service with integrity at its core.\nWe’re innovative and we use technology to assist us, but we don’t hide behind it and we don’t use any call scripting, it’s just real people, having real conversations. We also don’t manage our clients at arm’s length and make them deal only with an Account Manager, with Lemon the client gets direct access to the senior management team any time of the day or night. At Lemon it is all about the Team. That is why since 2003 we have been investing so much time and effort in developing our own quality mark called Operation Zest which infuses excellence into everything we do from recruitment to call handling. Our philosophy is that by investing in our team and ensuring that they have the best tools and a can-do attitude to work, will mean that they can provide our clients with the Zest service they deserve, after all why should our clients settle for anything less? Our clients tell us that we're the best at what we do so if you need a pioneering call management service, bursting with passion and integrity, to answer your calls anytime of the day or night, then look no further, because Zest is best!\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2003","locations":[{"headquarters":true,"address":"Unit 1, Lockheed Court Preston Farm Business Park","locality":"Stockton-on-Tees","region":"DUR","postal_code":"TS18 3SH","country":"United Kingdom","phone":"0800 612 7595"}]}