{"id":"260469","name":"Totally Inbound","tagline":"Call Centre and Telephone Answering Services","profile":"/profile/totally-inbound","website":"http://www.totallyinbound.co.uk","directory":"bpo","page":"73","verified":"","description":"Totally Inbound operates 24 hours a day, 7 days a week. We never close. With a current capacity in excess of 100 operator positions, a management team with years of experience, highly trained operators and a skilled, customer facing I.T.\nteam, Totally Inbound supply tried and tested call centre solutions that can be relied on to perform beyond expectation.Current proven technology is fully integrated without compromising the personal relationship between the call centre operators and callers to your business. When assessing implementation of new technology or the introduction of any new practice into the call centre operation, two questions are always considered. What value is added to the caller/client experience? What will be the impact on service level?This ‘added value' approach to call centre operations ensures that every investment and policy alteration is measured, considered and represents a genuine increase in service level and customer satisfaction.In 1996 the call centre moved into state of the art premises in Peterborough offering capacity for over 100 seats. In this central location, Totally Inbound operates an ‘open door' policy to clients and potential clients alike, promoting long term, successful relationships that stand the test of time.Advances in call centre technology coupled with the ethic of ‘quality first', helped fuel the company's growth toward its reputation today as the preferred Outsourced Call Centre and Telephone Answering Service for some of the world's leading brands.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"2 - 9","founded":"1993","locations":[{"headquarters":true,"address":"Unit 3 Bramhall Place Storeys Bar Road","locality":"Peterborough","region":"","postal_code":"PE1 5YS","country":"United Kingdom","phone":"03332.101.100"}]}