{"id":"260409","name":"Bosch Service Solutions","tagline":"Elevate your business","profile":"/profile/bosch-service-solutions","website":"http://www.bosch.com","directory":"bpo","page":"53","verified":"","description":"The Bosch Group is a leading global supplier of technology and services. It employs roughly 390,000 associates worldwide (as of December 31, 2016). In 2016, the company generated sales of 73.1 billion euros. Its operations are divided into four business sectors: Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. As a leading IoT company, Bosch offers innovative solutions for smart homes, smart cities, connected mobility, and connected industry.\nIt uses its expertise in sensor technology, software, and services, as well as its own IoT cloud, to offer its customers connected, cross-domain solutions from a single source. The Bosch Group’s strategic objective is to create solutions for a connected life, and to improve quality of life worldwide with products and services that are innovative and spark enthusiasm. In short, Bosch creates technology that is “Invented for life.” The Bosch Group comprises Robert Bosch GmbH and its roughly 450 subsidiaries and regional companies in some 60 countries. Including sales and service partners, Bosch’s global manufacturing, engineering, and sales network covers nearly every country in the world. The basis for the company’s future growth is its innovative strength. At 120 locations across the globe, Bosch employs 59,000 associates in research and development.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10,000+","founded":"Undisclosed","locations":[{"headquarters":true,"address":"100 Old Hall Street","locality":"Liverpool","region":"","postal_code":"L3 9QJ","country":"United Kingdom","phone":"44.151.2373200"},{"headquarters":false,"address":"","locality":"Berlin","region":"","postal_code":"","country":"Germany","phone":""},{"headquarters":false,"address":"","locality":"Vigo","region":"","postal_code":"","country":"Spain","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Romania","phone":""},{"headquarters":false,"address":"","locality":"Frankfurt Am Main","region":"","postal_code":"","country":"Germany","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Brazil","phone":""},{"headquarters":false,"address":"","locality":"Halle-Neustadt","region":"","postal_code":"","country":"Germany","phone":""}]}