{"id":"261","name":"City Innovates","tagline":"Walk with us into your future","profile":"/profile/city-innovates","website":"http://www.cityinnovates.com","directory":"web-developers","page":"142","verified":"","description":"City Innovates Pvt. Ltd. is a young and dynamic Company, evolving every moment, using innovation and cutting-edge technology, providing ITE and digital services and solutions, globally. From the web development to digital marketing, to app developments, comprise the robust offerings of the City Innovates.\nWe ensure highest level of certainty and satisfaction through a deep-set commitment to our clients with reliability of use of advanced technology and technological tools, quality products and timely delivery. It is this single ‘Mantra’ which has won City Innovates, a special place in the hearts of its clients. In order to meet the project deadlines, we profoundly interact with the clients during the building process, understand the exact need, and then go on to deliver such product and services which not only meet but exceed our clients’ expectations. It is for this reason that City Innovates continues to enjoy the reliability trust of its clients since the inception.\nCity Innovates has since diversified into Higher Education and Business Analytics. We enjoy national reputation for our higher education quality assurance process-building in universities and colleges and enable institutes attain accreditations in superior grades in NAAC, NBA and ABET. Our vertical of Business Analytics is enabling Corporate and individuals build competencies in the latest data scientific tools.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"E-44, ELTOP, Phase VIII , Industrial Area","locality":"SAS Nagar","region":"PB","postal_code":"0000","country":"India","phone":"+91.9501.033.888"},{"headquarters":false,"address":"14390 SW 73rd Ave","locality":"Miami","region":"FL","postal_code":"33158","country":"United States","phone":"+1.954.494.1726"},{"headquarters":false,"address":"","locality":"Gurgaon","region":"HR","postal_code":"110038","country":"India","phone":""}]}