{"id":"26124","name":"hedgehog lab","tagline":"Global App Developer based in UK, USA & Europe","profile":"/profile/hedgehog-lab","website":"https://hedgehoglab.com","directory":"directory/mobile-application-developers","page":"1","verified":"","description":"hedgehog lab is a global digital product consultancy that partners with brands and enterprises to help them achieve their business goals using emerging technologies. \n \nWith over a decade’s experience in technology, design and product development, we’re experts at delivering digital solutions that deliver real, demonstrable business impact for our partners.\n \nWhether it’s iOS, Android, web, immersive or voice, our exceptional design and engineering credentials have helped some of the world’s biggest organisations to challenge their status quo and provide digital experiences that have transformed their businesses.\n \nOur passionate and award-winning team spread across offices in London, Boston, Newcastle Upon Tyne and India has delivered industry-leading results for household names all over the globe including Santander, Microsoft, Kodak Alaris, AkzoNobel, Deliciously Ella, Mitsubishi amongst many, many more.\n \nIf you’ve got a business challenge that you’d like to discuss with our experts, get in touch today.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2007","locations":[{"headquarters":true,"address":"256-260 Old Street","locality":"London","region":"LND","postal_code":"EC1V 9DD","country":"United Kingdom","phone":"0808 164 3883"},{"headquarters":false,"address":"50 Milk Street","locality":"Boston","region":"MA","postal_code":"02109","country":"United States","phone":"617.806.6434"},{"headquarters":false,"address":"Generator Studios, Trafalgar Street","locality":"Newcastle Upon Tyne","region":"TWR","postal_code":"NE1 2LA","country":"United Kingdom","phone":"0808 164 3883"},{"headquarters":false,"address":"Unit 301 Maple Celestia, Plot 49 Jayabheri Enclave, Gachibowli","locality":"Hyderabad","region":"","postal_code":"500032","country":"India","phone":""}]}