{"id":"26137","name":"Code Brew Labs","tagline":"Turning Ideas into Business Ventures","profile":"/profile/code-brew-labs","website":"http://www.code-brew.com","directory":"directory/mobile-application-developers","page":"8","verified":"","description":"Code brew labs is a firm specializing in technological solutions for businesses - those who exist, and those who are still in their nascent stages. We have dabbled in Business Analytics, IoT based infrastructure, cloud-based computing & solutions, along with forays into AR and VR. We create a nexus of satisfied, happy clients, vendors and employees by providing exceptional products, a streamlined working experience and rigorous after sales support.\nWe extend this expertise to many industry verticals, be it Fintech, EduTech, Healthcare, Social Networking, Chat apps, Mobile Games, Marketplaces & Food Delivery to name a few. With a team of 200+ members we possess the best engineering minds for technical expertise, along with a creative zeal who strive to improve by the day. Our work can be explained by our philosophy towards customer service: to keep the user experience at the center of our focus while designing and developing apps. We are a DESIGN FIRST team - our well-crafted UI's and subsequent user experience are validated to a 100% client satisfaction and no less. We take pride in designing with the best industry standards in mind, while innovating.\nOur Recent UI/UX Design portfolio -  Here\nAfter the project completion stage - we have a powerful team of marketing specialists & product strategists who plan a course for the future of your undertaking. We have published more than 300 apps across many categories and our appetite for challenges keeps growing every day.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2013","locations":[{"headquarters":true,"address":"Code Brew Labs , Arth Prakash , Sector 29 D","locality":"Chandigarh","region":"CH","postal_code":"160030","country":"India","phone":"+14082171185"},{"headquarters":false,"address":"Level 26 , Sheikh Rashid Tower , Dubai World Trade centre","locality":"Dubai","region":"DU","postal_code":"9292","country":"United Arab Emirates","phone":"+14082171185"},{"headquarters":false,"address":"Mutuo, Av. Miguel Hidalgo y Costilla 1995, Arcos Vallarta","locality":"Guadalajara","region":"JAL","postal_code":"44600","country":"Mexico","phone":"+14082171185"}]}