{"id":"261366","name":"Kubix Digital","tagline":"A Boutique, International & Award Winning Agency","profile":"/profile/kubix-digital","website":"https://kubix.digital","directory":"seo-firms","page":"6","verified":"","description":"We Are Europe's & MENA's Best Small Integrated Search Agency.\nKubix is a search-focused Digital Marketing Agency based in Istanbul and Berlin. We are not only totally independent, but also give boutique and custom services. So if you are looking for a digital marketing agency but you say search engine traffic is your key business driver, contact us. We deliver PPC Management, SEO Services, Content Marketing, Conversion Optimization and Analytics Consultancy.\n \nFounded in Spring 2007 by former Google employees, Kubix Digital is made up of a diverse team; from account strategist to project manager, to analysts and content writer - we all work together to understand, strategize, implement, analyze, test, track and manage performance-based digital marketing campaigns and customer websites. Our focus is on generating reach, leads, sales, revenue, and actions while creating a smooth, positive digital experience for every single user.\nAs the first pure Search Engine Marketing agency in Turkey, based in Istanbul, our team has an international background, offering national as well as international search engine marketing services on a global scale. Having worked in the search engine marketing industry in various countries for many years, Kubix Digital has a deep knowledge of different country insights and search market behaviors.\nAs a company, we have 4 specific values that we believe represent a successful working strategy: Taking Ownership, Thinking & Working Smart, Communicating With Each Other; whether it's a teammate or a client, and last but not least Supporting Others. They are the essence of what we stand for as a company, and part of our success is making sure we apply them to our work ethic.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2007","locations":[{"headquarters":true,"address":"Friedrichstraße","locality":"Berlin","region":"BE","postal_code":"10115","country":"Germany","phone":"902123297963"},{"headquarters":false,"address":"Eski Büyükdere Caddesi","locality":"Istanbul","region":"IST","postal_code":"34010","country":"Turkey","phone":"902123297963"}]}