{"id":"26298","name":"Agile iSS","tagline":"We Build Data Lake on Cloud","profile":"/profile/agile-iss","website":"http://www.agileiss.com","directory":"it-services","page":"270","verified":"","description":"About Agile iSS - What does Agile iSS mean – “Agile” in our name stands for how we work and the project development philosophy and methodology we stand for, iSS stands for “Intelligent Solutions and Services” and that stands for our core area of Solutions and Services expertise being in the area of Data Engineering/ Business Intelligence and Analytics platforms.\nAgile iSS-  Agile iSS is a boutique IT solutions company providing specialized BI & No-SQL Big Data Analytic's & Engineering solutions and services. Our core business objective is to guide and service our clients’ through their BI reporting & Big Data analytic's initiatives on premise or Cloud. We have designed, built, implemented and maintain effective and robust BI & Big Data systems, on the company data centers or on the cloud. We have strong industry expertise in Media & Entertainment, Consumer Packaged Goods, Retail, and Digital Supply Chain. We currently have about 25 resources in US, 2 in UK and 50 in Chennai, India.\nWith respect to technology, we have a focus and expertise in following areas – Tableau, Amazon AWS Cloud, AWS Redshift, Hadoop ( Horton Works/ Map R/ EMR) , SQL Server & SQL Server Big Data Appliance, SQL Server SSAS & SSIS, Microsoft Azure Cloud , Informaica, Attunity, Python Scripting, MY SQL, Qubole, MicroStrategy, Business Objects.\nWe are able to help our clients with cutting edge Cloud and Big Data solutions and our competitors clearly lack expertise in that area and very slow to move as they lack the resources with right expertise and knowledge in those areas.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":""}]}