{"id":"263346","name":"Phoenix 24-7","tagline":"Telephone Answering Services","profile":"/profile/phoenix-24-7","website":"http://www.phoenix247.co.uk","directory":"bpo","page":"79","verified":"","description":"Phoenix 24-7 are a UK call centre with the right answer operating out of Aberdeen, the Granite City and UK Oil and Gas Capital. At Phoenix24-7 our business is not just about answering the phone: it’s about answering your phone, and providing support to your business. As our name suggests, we’re here for you and your business 24 hours a day, 7 days a week, 365 days a year.\nWhilst some answering services will divert your out-of-hours calls to an automated message, we think this gives the wrong impression of your business to your clients. All of your calls, regardless of time of day, or day of the week, will be answered by a live operator, who’s based in our Aberdeen call centre. After all you’re paying for an answering service, and why pay for automated messaging, when you can set that up yourself? Wouldn’t it be great to know that, right now, whilst you’re busy working, your business calls are being answered? Actually, not just answered, but taken care of by a friendly, helpful, trustworthy representative. Someone who is not only knowledgeable about your business, but who treats your customers, as you would treat them yourself. Although our answering service is based in Aberdeen, Europe’s oil and gas capital, Phoenix24-7 provides service to a wide variety of business’s across the UK. In addition we also provide International services to some clients dealing with The United States, Iran, Africa and other European destinations. This is English based only. Call on us, and we’ll share the benefits of our 25 years of experience, in the telephone answering and message handling business. Phoenix24-7 is the answer.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"Undisclosed","locations":[{"headquarters":true,"address":"Units 1/10 – 1/12 Deemouth Business Centre South Esplanade East","locality":"Aberdeen","region":"ABD","postal_code":"AB11 9PB","country":"United Kingdom","phone":"0800.999.2.247"}]}