{"id":"263460","name":"JAM","tagline":"Answering your calls so you don’t have to.","profile":"/profile/jam","website":"http://www.jam.co.uk","directory":"bpo","page":"59","verified":"","description":"JAM is an award-winning telephone answering company with an enviable industry standing and an unrivalled reputation for excellence. Established in 1977 by Jackie Ann Millman to service the needs of musicians who were losing bookings due to missed calls, JAM has evolved over the years and developed into a comprehensive, technologically advanced business capable of servicing clients on a local, national and global scale.\nWe operate 24 hours a day 7 days a week and your calls are answered by highly trained, experienced and motivated staff. We do not outsource unsociable hours call handling to lone homeworkers – in fact some call centres outsource their out-of-hours calls to JAM – and we can offer you the same level of service at 3am as we do at 3pm. As the late 80s and early 90s progressed and businesses realised the need for EVERY call to be answered and handled efficiently and professionally, our client list grew to include SMEs, blue-chip corporates and government agencies. Four decades of experience has put us at the vanguard of a very competitive and crowded marketplace and we remain confident that both our service offering and commitment to client satisfaction is second to none. Why do clients stay with JAM? It's because we do the simple things very well. We have many industry and business awards because we focus on doing a good job and making sure our clients are happy. It's not rocket science but it's a business model that has worked and continues to work.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"1977","locations":[{"headquarters":true,"address":"Unit 5 , Borehamwood Enterprise Centre Theobald Street,","locality":"Borehamwood","region":"HRT","postal_code":"WD6 4RQ","country":"United Kingdom","phone":"020.8207.0007"}]}