{"id":"263865","name":"FlexMade","tagline":"Professional Software Development","profile":"/profile/flexmade","website":"https://www.flexmade.com","directory":"directory/mobile-application-developers","page":"32","verified":"","description":"FlexMade (formerly Flexaspect) is a Software Research and Development Company with headquarters in Seattle, USA, and Sheffield, UK. Our development centers are in 2 offices: Kharkov, Ukraine, and Krakow, Poland. FlexMade is a team of experienced and talented software developers, QA engineers and project managers.\n \nOur main goal is to provide reliable, scalable and cost-efficient software products to corporate and individual clients from North America, Europe, and Asia. We do it using modern programming technologies, platforms, standards of coding, and, of course, by hiring highly experienced and qualified personnel.\nWe have 150+ developers in our offices, with 5 years experience on average. All professionals have a high level of training and qualifications confirmed by diplomas of the leading Ukrainian and Polish universities.\nAfter so many years of experience in the IT market, FlexMade has polished high efficiency of its software development process. At the same time, we offer products and services at competitive price, as FlexMade has learned how to deliver the best results in a cost-effective way.\nFlexMade offers a wide range of IT services:\nPHP development of web applications (Laravel, YII, CodeIgniter, Phalcon)\nPython (Django, Flask, Microservices)\nMicrosoft .NET technologies\nFrontend and JS development (React, Angular, Vue.js, Vanilla, Backbone, Ember, jQuery, Prototype, CanJS, LESS, SASS, Bootstrap, Foundation, Initializr)\nMobile apps development for iPhone and Android\nCMS based solutions (Wordpress, Umbraco)\nMaintenance of legacy systems, as well as migration to modern platforms\neCommerce solutions (Magento, WooCommerce, uCommerce)\nCloud-based solutions (Amazon, Azure, Google Cloud)\nQuality Assurance (test plans creation, automated testing using Selenium etc)\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"2638 134th Ave NE","locality":"Bellevue","region":"WA","postal_code":"98005","country":"United States","phone":"+1-425-247-0867"},{"headquarters":false,"address":"Celna Street 9","locality":"Krakow","region":"","postal_code":"30-507","country":"Poland","phone":"+1-425-247-0867"},{"headquarters":false,"address":"Blagoveschenska Street","locality":"Kharkiv","region":"","postal_code":"61000","country":"Ukraine","phone":"+1-425-247-0867"}]}