{"id":"26388","name":"SETA International","tagline":"EXPERIENCE THE SETA Difference","profile":"/profile/seta-international","website":"http://www.seta-international.com","directory":"directory/mobile-application-developers","page":"62","verified":"","description":"SETA International is a leader in global custom software development with a proven track record of delivering high quality solutions to companies worldwide. We provide end-to-end technology services ranging from technical consulting, graphical design, custom applications, software development, support, integration and maintenance.\n\nAs your technology partner, we will be with you every step of the way from understanding your business’ needs to building the custom software solutions you require. SETA’s Hybrid onshore offshore Development Model ensures maximum efficiency without language, cultural or skill barriers and leverages the talents of more than 400 employees globally.\nCompanies benefit from our exceptional service, unique engagement model, competitive pricing, and ability to maximize our client’s ROI. Our international team is dedicated to project success past completion with the SETA Business Partner Network Program that provides unique networking and business opportunities.\nSETA’s software solutions have contributed to the success of over 500 clients worldwide across industries such as beauty, fashion, finance, education, entertainment, gaming, travel, government, insurance, medical, manufacturing, food services, social media, toll road, and many more.\nAmazon has selected SETA as an Amazon Service Provider. Sellers can now leverage the power of SETA’s global workforce to develop software solutions and services for the cloud, web and mobile.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"250 - 999","founded":"2008","locations":[{"headquarters":true,"address":"","locality":"HANOI","region":"","postal_code":"","country":"Vietnam","phone":"(949) 480-1639"},{"headquarters":false,"address":"600 Anton Blvd. Suite 1100","locality":"Costa Mesa","region":"CA","postal_code":"92626","country":"United States","phone":"888.852.8374"}]}