{"id":"26535","name":"FS Studio","tagline":"An Innovation and Emerging Technology Company","profile":"/profile/fs-studio","website":"http://fsstudio.com","directory":"directory/mobile-application-developers","page":"66","verified":"","description":"We are enablers, our mission is to bring our client’s ambitions to market.  Emerging technology and advanced software design is our speciality.  If there’s a tough technical nut to crack, that’s what we do best.  If you need to bring something special to your product, that’s what we do.  Whether that’s using computer vision to recognize emotions for a extra special AR experience to a smart toy that can help you learn a new dance move with custom motion sensors, we have done it.\nTypes of Projects: Computer Vision Enabled Apps, Connected Devices/IoT/Embedded Devices, VR/AR/MR/XR, Alexa and Google Home\nTechnologies: iOS, Android, Unity, OpenCV, TensorFlow\nExperience\nWe have unique experience and skills that span web to native client side development, from low level firmware and driver support, through to high level application development and optimization.  We also have extensive experience with the toy and children's technology market having worked with some of the biggest toy makers in the industry, such as LeapFrog, Spinmaster, and Hasbro.\nTeam Players\nWe play well with others.  We work with you to determine the best mode of engagement.  Whether it’s a tightly integrated role where we work closely with internal teams and developers or whether we are completely self-contained and provide regular retrospectives and demos, the choice is yours.  Navigating and working well with established teams and cultures, is not a problem.  We also are happy to work independently and provide the stakeholders and product owners regular and transparent updates.  No matter the style of engagement, it’s all about the quality of the communication.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"3300 Powell St. #201","locality":"Emeryville","region":"CA","postal_code":"94608","country":"United States","phone":"+1.888.404.6115"}]}