{"id":"26644","name":"Tintash","tagline":"Dedicated Remote Development Teams","profile":"/profile/tintash","website":"https://www.tintash.com","directory":"web-developers","page":"2","verified":"","description":"Tintash is a Stanford alumni led Web, Mobile Apps,  and Games Development agency preferred by smart entrepreneurs and innovation experts.\nSince 2008, we’ve been innovation partners for startups and enterprises around the globe, and have delivered over a 100 projects. Our clients include DraftKings (a Unicorn), Bed, Bath, and Beyond (a Fortune 300 company), and LifePrint (an Apple Partner).\nOur expertise in Backend development include Python, Node.js, ROR, and PHP. On Frontend development, we have expertise in ReactJS, Angular, Bootstrap, and Ionic and other libraries and frameworks. \nOn Mobile, our expertise includes native iOS and Android Development, Cross-platform development using ReactNative, and development using Unity.\nWe also provide Concept Art, UX,  UI Design, QA Testing (both manual and automated), and Project Management.\nAs a company, we value the success of our customers above everything else and strongly believe in the correlation of customer success to regular and thorough communication, collaboration, and transparency & visibility.\nClient Testimony\n“For all of our projects, Tintash has worked hard to deliver products on time. I’d argue that the quality of their work puts them above what we could find in Silicon Valley.” \n- Head of Innovation, Bed Bath and Beyond \n\"They [Tintash] were flexible and adaptable to the problem and issues encountered, and very resourceful when dealing with issues.\"\n- CTO, LifePrint\nKey Offerings:\nPOC and MVP development for web and mobile\nPrimary development teams: We set up teams for engineering, experience design, graphic design, and QA which function as primary development for our clients\nTeam extension: We provide our resources who work with our client’s existing teams in a team extension model\nREAD MORE...","min_project_size":"$100,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"Raleigh, NC, USA","locality":"Raleigh","region":"NC","postal_code":"27604","country":"United States","phone":"650-204-9718"},{"headquarters":false,"address":"725 Shadman","locality":"Lahore","region":"P","postal_code":"54800","country":"Pakistan","phone":""}]}