{"id":"268194","name":"Web Design and Development Company","tagline":"Walstar : Your Potential Our Passion","profile":"/profile/web-design-development-company","website":"https://www.walstartechnologies.com","directory":"directory/mobile-application-developers","page":"390","verified":"","description":"Walstar Technologies Pvt. Ltd. is a quickest developing web advancement organization situated in Kolhapur India, conveying an assortment of IT administrations like website architecture and improvement, Custom Application Development, programming improvement, internet business arrangements, SEO answers for the customers around the world. We are resolved to give high caliber and inventive we administrations to our customers at focused cost to keep up the long haul relationship.\n \nWalstar Technologies should be known for giving Low Cost website composition, quality masterminded, and trustworthy Website Design organizations to clients over the globe.\n \nWe are adaptable and positive about our approach of giving a quality and result situated web arrangement including Website Design, Web Development, Flash Website outlining, E Commerce Website Designing, Domain Registration, Web Hosting and Search Engine Optimization.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2014","locations":[{"headquarters":true,"address":"1242 E, First Floor, Shahu Soot Kapad Kamgar sangh, opp. Shahu Mill, Bagal, Chowk, Kolhapur, Maharashtra 416008","locality":"Kolhapur","region":"MH","postal_code":"416008","country":"India","phone":"9637963344"},{"headquarters":false,"address":"2103/47 E, Rukmini Nagar, Front Of Datta Mandir, Maharashtra 416005","locality":"kolhapur","region":"MH","postal_code":"416005","country":"India","phone":"9637963344"},{"headquarters":false,"address":"Office No. 405, 4th Floor. Wallstreet 24, above Mc-Donald, Motiram Nagar, Warje, Pune, Maharashtra 411058","locality":"Pune","region":"MH","postal_code":"411058","country":"India","phone":"9637963344"}]}