{"id":"269715","name":"Nordia","tagline":"We make it personal.","profile":"/profile/nordia","website":"http://www.en.nordia.ca","directory":"bpo","page":"59","verified":"","description":"Nordia is the largest customer service provider in Canada and has been a leader in the telecommunications industry since 1999. Nordia operates 14 centers in 4 provinces (British Columbia, Ontario, Quebec and New Brunswick) and offers a wide range of support to help customers get the most out of their services and solve their problems.\nThese services include: customer support (billing, service, technical), sales and retention, directory assistance and teleconferencing service, and relay service to facilitate communications for customers who are hard of hearing or impaired slurred speech. Nordia is proud to attract and retain top talent by providing a stimulating and rewarding environment for its employees, as well as a global compensation of the most competitive of the industry. In a recent survey, 85% of employees would recommend Nordia as an employer to their families and friends. *** Nordia is Canada's largest provider of customer service solutions and has been an industry leader in the telecommunications sector since 1999. Nordia operates 14 centers in BC, Ontario, Quebec, and New Brunswick and provides a wide range of support to help customers get the most out of their services and resolve issues. Nordia's services include customer support (billing, service, technical), sales and loyalty, directory assistance, and teleconferencing, as well as technology-assisted relay services to facilitate communication for hearing and speech-impaired customers. Nordia prides itself on attracting and retaining top talent, providing a stimulating and rewarding environment for employees and providing the most competitive total compensation in the industry. In a recent survey, 85% of Nordia employees said they would recommend Nordia as an employer to their friends and family.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"1,000 - 9,999","founded":"1999","locations":[{"headquarters":true,"address":"3020 Jacques-Bureau, 2nd Floor , QC","locality":"Laval","region":"QC","postal_code":"H7P 6G2","country":"Canada","phone":"514.415.7088"}]}