{"id":"270054","name":"Telestar Communications","tagline":"GET MORE DONE WITH OUTSOURCING","profile":"/profile/telestar-communications","website":"https://www.telestarcom.com","directory":"bpo","page":"35","verified":"","description":"TeleStar Communications is a North American based service provider assisting companies with business process outsourcing (BPO) services. Our Canadian headquarters is located in Toronto, Ontario with USA office in Las Vegas, Nevada. Our team of experienced agents deliver award winning services from two state-of-the–art contact centers located in the Philippines.\nWith 25 years of North American call center and human resources experience, our management team has been analyzing the operational process and structuring custom calling campaigns for many businesses throughout Canada, USA, UK & Australia. We ensure a smooth seam-less transition period from the beginning stages of understanding your business requirements to the end result of producing positive returns and sustainability for your investment. TeleStar Communications has been highly successful in offering front and back end office support in the fields of lead generation, appointment setting, B2B & B2C telemarketing, pharmaceutical research, political elections, customer service, IT support, collections, surveys, email reply, chat lines, virtual assistant, blogging, and loyalty retention campaigns. We truly put our expertise at work in creating professional inbound / outbound calling services for you. TeleStar Communications is a preferred service provider for many North American Companies.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"Undisclosed","locations":[{"headquarters":true,"address":"70 Town Centre Crt, Suite 1003,","locality":"Toronto","region":"","postal_code":"M1P 0B2","country":"Canada","phone":"647.708.0601"},{"headquarters":false,"address":"8275 S. Eastern Ave,","locality":"Las Vegas","region":"NV","postal_code":"89123","country":"United States","phone":"702.979.1583"},{"headquarters":false,"address":"Chemphil Building 2nd FL Legaspi Village,","locality":"Makati City","region":"","postal_code":"","country":"Philippines","phone":""},{"headquarters":false,"address":"TNC bldg, Dacera Ave.","locality":"Davao City","region":"","postal_code":"","country":"Philippines","phone":""}]}