{"id":"27003","name":"QArea","tagline":"SOFTWARE DEVELOPMENT OUTSOURCING","profile":"/profile/qarea","website":"https://qarea.com","directory":"web-developers","page":"2","verified":"","description":"QArea was founded in 2001 as a website and web-app development firm, but has since grown into a leader in outsourcing software development with 250+ software engineers, 800+ completed projects, and a product development team appraised at CMMI-DEV Level 3.\n \nSince 2008 the core of QArea’s web development services was built around Drupal. We have developed and launched 60+ Drupal projects. We employ multiple Acquia-certified developers and are prominent members of global Drupal communities and associations.\n \nQArea unites 250 truly talented developers and testers. We deliver wide range of premium services to any company with our rates starting at $15.\nOur services:\nCustom software development. QArea has teams of Golang, PHP, JS, Python, iOS, and Android developers. We invest in R&D of practical Golang uses and streamlined DevOps. \nTesting & QA. QArea has nurtured a dedicated QA Lab, which currently consists of 100+ software testing and QA engineers. \nIT consulting. QArea loves startups. We assist them in creation of MVP, tech consulting, and starting projects from scratch. Our BI segment is also qualified to support enterprise projects at the highest level.  \n \nQArea has been independently appraised at CMMI-DEV Capability Maturity Level 3. We are the only mid-size software development outsourcing company with a CMMI-DEV appraised business unit in Ukraine.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2001","locations":[{"headquarters":true,"address":"23 Avgusta","locality":"Kharkov","region":"KL","postal_code":"61000","country":"Ukraine","phone":"380577636024"},{"headquarters":false,"address":"Petra Sahaidachnoho Str.","locality":"Kyiv","region":"KV","postal_code":"4070","country":"Ukraine","phone":"380577636024"},{"headquarters":false,"address":"Heroiv Upa Str.","locality":"Lviv","region":"LV","postal_code":"79041","country":"Ukraine","phone":"380577636024"},{"headquarters":false,"address":"Giuseppe Cali Street","locality":"Ta'Xbiex","region":"BGU","postal_code":"1423","country":"Malta","phone":"41435080794"},{"headquarters":false,"address":"Giuseppe Cali Street","locality":"Ta'Xbiex","region":"BGU","postal_code":"1423","country":"Malta","phone":"41435080794"}]}