{"id":"270387","name":"Creative Giant | Brand Design Agency","tagline":"Branding & Digital Design Agency in Norwich","profile":"/profile/creative-giant-brand-design-agency","website":"http://www.creativegiant.co.uk","directory":"web-designers","page":"906","verified":"","description":"Creative Giant is a strategy-first branding and digital design agency in Norwich. We help companies, large and small, create a results driven brand experience across digital, print and social media. We nurture new brands, turn the volume up on existing ones and always keep an eye on the business objectives and end result. Put simply, we design for your brand first not our portfolio.\nHow we can help your business:\nAt Creative Giant we work collaboratively with our clients in order to understand what you really need from your design agency, who you customers are, what they need from you and why your services and products matter to them. We call this user-first strategic approach 'Brand UX' and we use this process to deliver great experiences and engagements across all your digital, social and print based branded touch-points.\nOur Services and Capabilities:\nStrategy: Creative Strategy, Discovery and Research, User Experience, Brand Strategy and Architecture, Positioning, Content Strategy, Social Strategy, Marketing Campaigns. \nBranding: Brand Development and Rebranding, Logo Design, Brand Identity Systems, Brand Style Guides, Messaging and Tone of Voice, Collateral, Print and Packaging, Typography. \nDesign: Annual Reports, Brochures, Magazines, Presentation Decks, Illustration, Stationery and Business Cards, Exhibition Stands, Signage. \nDigital: Website Design and Development, UX, Wireframing, Social Media Assets, App Design.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"2 - 9","founded":"2005","locations":[{"headquarters":true,"address":"25 St John's House, Maddermarket","locality":"Norwich","region":"NFK","postal_code":"NR21DN","country":"United Kingdom","phone":"07515397261"}]}