{"id":"27056","name":"Clavax","tagline":"Transform Your Ideas into Innovative Solutions","profile":"/profile/clavax","website":"https://www.clavax.com","directory":"directory/mobile-application-developers","page":"23","verified":"","description":"Clavax is a leading edge software, web and mobile app development company headquartered in San Jose, California. Our top-notch services are backed by a strong team of 200+ highly skilled professionals to deliver innovative, secure and scalable IT solutions to our clients.\nWe act as technology partners by understanding your business challenges and applying the latest engineering technologies to deliver innovative IT solutions.\n \nOur Client First approach allows us to believe and empower them in finding great concepts behind everyday ideas, making us one of the most forward-thinking innovators around the world.\nOur focus lies in not only delivering more value to our clients but also in ensuring that their interests and requirements are fulfilled to the best of our technical capabilities.\nWe follow a global process delivery model to ensure that all our projects effectively meet their timelines. We are committed to delivering a high-performance and highly valuable digital solution to our clients to encounter technology challenges faced by them. Besides, they are meant to reduce costs, enhance productivity and operational agility.\nWe are a PCI DSS certified company thus meets security standards and guidelines, assuring your data is secure.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2011","locations":[{"headquarters":true,"address":"1754, #210 Technology Dr","locality":"San Jose","region":"CA","postal_code":"95110","country":"United States","phone":"844.425.2829"},{"headquarters":false,"address":"","locality":"New Delhi","region":"","postal_code":"","country":"India","phone":"844.425.2829"},{"headquarters":false,"address":"35 Glebe St, Second Floor","locality":"New South Wales","region":"","postal_code":"2037","country":"Australia","phone":"+61280745610"},{"headquarters":false,"address":"","locality":"Gurgaon","region":"HR","postal_code":"","country":"India","phone":""}]}