{"id":"270897","name":"Lead Generators International®","tagline":"Guaranteeing resuls - B2B Telemarketing since 1992","profile":"/profile/lead-generators-international%C2%AE","website":"https://www.clientfinders.com","directory":"bpo","page":"4","verified":"","description":"Lead Generators International® (LGI) is a business-to-business telemarketing firm. We generate highly qualified leads and set appointments with sales ready buyers by making skilled cold calls for each and every one of our clients. Lead Generation is all we do — it is not an “add-on” service.\nWe are professionals and dedicate all our resources to generating leads that produce an excellent return on investment for our clients. We employ a process that has been developed over 25 years of delivering effective Lead Generation programs.\nEach program we design is distinct to reflect the dynamics of the particular market conditions, economic circumstances, competitive environment and the needs of that individual customer. We take all aspects of the experience into account; it is just as important to us for a potential customer to be left with a positive impression of your company whether they decide to engage or not. We ensure your brand is maintained to the highest standards every step of the way.\nService offering: -Cold Calling Lead Generation-Appointment Setting-Event Registrations-Telephone Market Research (Telephone Surveys)-Database Data Updating-Calling/email List Procurement\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"1992","locations":[{"headquarters":true,"address":"200-4170 Still Creek Drive","locality":"Vancouver","region":"BC","postal_code":"V5C 6C6","country":"Canada","phone":"1.800.306.1365"},{"headquarters":false,"address":"401 Bay Street, 16th Floor","locality":"Toronto","region":"ON","postal_code":"M5H 2Y4","country":"Canada","phone":"1.800.306.1365"},{"headquarters":false,"address":"14 Wall Street, 20th Floor","locality":"Manhattan","region":"NY","postal_code":"10005","country":"United States","phone":"1.800.306.1365"}]}