{"id":"271939","name":"Blue Ocean","tagline":"Great People doing Great Work for Great Brands.","profile":"/profile/blue-ocean","website":"https://blueocean.ca","directory":"it-services","page":"160","verified":"","description":"Sustaining effective customer support initiatives frequently results in unanticipated complexities and challenges. From strategy and measurement to human resources and infrastructure, we understand the enormous effort it takes to build a successful multi-channel contact center. That’s why we believe in the value of call center outsourcing. At Blue Ocean Contact Centers, we’re at the front lines of customer service.\nWe know we play a key role in building brand loyalty for your organization, and we recognize how essential it is to deliver truly comprehensive customer support across all channels. If you need customized, high-quality customer experience solutions for mission-critical customers, you’re in the right place. We have an unwavering commitment to seamless customer service and efficient resolution. At Blue Ocean Contact Centers, our agents become your agents. For over 20 years, our dedication to customer service as a competitive differentiator has enabled us to build trusted partnerships with clients who are market leaders in their industries including: technology, insurance and financial service, travel and tourism, grocery and consumer packaged goods, consumer products, automotive and roadside assistance. Above all, we believe that collaboration, innovation, and customization are the foundation for effective, affordable solutions that consistently deliver on your key metrics.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"250 - 999","founded":"1994","locations":[{"headquarters":true,"address":"7051 Bayers Road, Suite 400,","locality":"Halifax","region":"","postal_code":"B3L 4V2","country":"Canada","phone":"902.722.3300"},{"headquarters":false,"address":"1850 Vanier Blvd Suite 200,","locality":"Bathurst","region":"NB","postal_code":"E2A 7B7","country":"Canada","phone":""}]}