{"id":"27242","name":"Gramercy Global Media Inc.","tagline":"Web design, SEO, Digital Marketing, Maintenance","profile":"/profile/gramercy-global-media","website":"http://gramercyglobal.com","directory":"web-designers","page":"135","verified":"","description":"GramercyGlobal Media is a cutting edge, full-service digital media agency located in Manhattan, New York. We specialize in Responsive Web Design, SEM, SEO, Data Analytics to help our clients optimize their digital foot prints and lead-generations.\nOur brand development team takes pride in designing and customizing detail oriented strategies to reach online audiences. Our core value is Transparency: Our customers are always involved in every step of the marketing strategies, as everything is custom-made. \nWe help small and medium business firms increase sales through specific marketing processes:\nWeb Development & Design: We use the latest technology and coding to create modern designed websites\nSEM: We utilize the best digital channels to display your brand by taking full advantages of the Internet.\nSEO: We adopt all relevant search engines optimization techniques to maximize your digital foot prints.\nIf you are looking for a highly experienced digital marketing team to help you improve search engine rankings, create lead-generation web sites or you need to adapt mobile interfaces to an expert level, GGM is your choice for an always customized marketing planning, strategy and execution source. Our services include:\nE-Commerce\nWebsites 2.0\nDigital Marketing\nSocial Media Management\nWeb Hosting\nWeb Translations\nDigital Strategy\n \n \n \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"167 Madison Ave. Suite #405","locality":"New York","region":"NY","postal_code":"10016","country":"United States","phone":"+1 212 686 1636"},{"headquarters":false,"address":"Jessnerstraße 20 Friedrichshain","locality":"Berlin","region":"BE","postal_code":"10247","country":"Germany","phone":"+49 (0)30 6891 79 88"}]}