{"id":"272773","name":"Jotabequ","tagline":"The Most 'Tican' Agency","profile":"/profile/jotabequ","website":"http://www.jotabequ.com","directory":"web-designers","page":"1106","verified":"","description":"We want to make our clients' brands famous, very famous. And their cash accounts fat, very fat. Our methodology synchronizes the consumers desires and needs with the brands' benefits. This method works and its been used since we started a long time ago. If you are looking for an advertising agency to sell more, hire one that wins prizes locally and abroad. Our clients can rest assured that we understand the local market as well as international tendencies.\nAt jotabequ we are honored to have won a Cannes Silver Lion, 6 EFFIE's, 2 Great Volcanos, 1 Antigua Festival Gold and 1 Eye of Iberoamérica Gold.\nEn Español: \nTenemos un método que sincroniza los deseos y necesidades del consumidor con los beneficios de las marcas. Empezamos a escribir el método desde que nacimos hace tiempales, y ha cambiado poquísimo a través de los años. El método funciona. Si usted es de quienes busca una agencia de publicidad para vender más, contrate una que gane premios en Costa Rica y en el extranjero. Las agencias que ganan premios locales como el Pregonero de Bronce o Festival Volcán, están en sintonía con la realidad del mercado y destacan entre sus pares. Las agencias que ganan premios internacionales dominan las tendencias mundiales y se enfrentan de tú a tú con las grandes agencias del planeta. Nuestros clientes pueden sentirse tranquilos que entendemos el mercado local y las tendencias internacionales. En jotabequ nos sentimos muy honrados de contar con un León de Plata en Cannes, 6 EFFIE, incluyendo 2 Gran EFFIE, 2 Gran Volcán, 1 Oro en el Festival Antigua y 1 Oro en Ojo de Iberoamérica.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"Undisclosed","locations":[{"headquarters":true,"address":"","locality":"San José","region":"","postal_code":"","country":"Costa Rica","phone":""}]}