{"id":"27356","name":"Jazzros Software Development","tagline":"AI/ML, CV, DL, Web/Desktop","profile":"/profile/jazzros-software-development","website":"https://www.jazzros.com","directory":"web-developers","page":"118","verified":"","description":"Jazzros is a software development company located in Wroclaw, Poland and Kharkiv, Ukraine. We bring talented, skillful and creative developers and IT experts to optimize our clients’ systems to help them focus on their core business with more effectiveness and efficiency.\nWe work on AI and Computer Vision software development.\nAlso, do full circle development including Python back-end (also with ASP.NET), db's logic etc.\nWe work on outstaffing basis - our engineers communicates with clients directly without middle man.\nThere are also supervisors who allocate needed staff etc.\nAs a benefit you are get a reliable and stable service with proven teamwork processes.\nAt the moment we have a few engineers available for a new interesting project.\nRegarding our expertise.\nFashion & Retail:\nFor example now we are developing fashion outfit matching solutions for retail & fashion industry with using of CNN/LSTM networks.\nThe solution gathers and generates an outfit based on cloth item user want to buy on the marketplace.\nMining industry:\nWe developed AI platform that uses advanced image based machine learning techniques to accurately analyze rock size distribution, size range and muckpile movement. This powerful tool provides instant feedback to blast engineers to further optimize their blast design and helps improve digability.\nEnvironmental protection:\nWe developed AI solution for identifying and counting of rare species of lizards on photos from the drone.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"199 D5 Moskovs'kyi Ave, off. 108.4","locality":"Kharkiv","region":"","postal_code":"61037","country":"Ukraine","phone":"+380985621978"},{"headquarters":false,"address":"Stanislava Lezhynskiy str. 4/29","locality":"Wroclaw","region":"","postal_code":"50-078","country":"Poland","phone":"+48883532787"}]}