{"id":"274008","name":"MoneyIQ","tagline":"Financial Services Agency Stratford","profile":"/profile/moneyiq","website":"http://www.moneyiq.ca","directory":"bpo","page":"80","verified":"","description":"MoneyIQ Canada is a Customer Management and BPO Business Process Outsourcing Provider in the Canadian financial services sector. Utilizing the latest technology we support the loan administration and outsourcing needs of Canadian loan, lease or mortgage originators and servicers. We are able to originate and service loans, leases, residential mortgages and commercial finance as well as any other type of lending or financial product imaginable.\nMoneyIQ is able to provide virtual, retail or institutional lending services in any market on an infinitely scalable platform from 5 to 2500 users or more working in one office, 5 branch offices or 1000 regional offices across Canada. Our platform provides completely customer centric origination and servicing that is independent of any individual loan product.  Thus we are able to adapt to changing market trends and deploy new or improved origination and servicing solutions in a cost effective manner. Regulatory or industry changes can be implemented quickly without the need for programmer intervention and the associated costs. CRM, account and document management, loan life cycle management, payment processing, default management and third party integration are all managed through ONE platform, ONE redundant database and ONE client interface.  Time to market, training, system downtime and support costs are drastically reduced. Using our integrated web client we help our customers substantially reduce costs to connect with their clients throughout the entire life cycle of the loan or lease. Further to this, by integrating the platform to third parties such as Equifax or Trans Union allows us to automate credit scoring and 'Know Your Client' identity verification to reduce staffing levels and make better decisions.\n \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2005","locations":[{"headquarters":true,"address":"356 Ontario St., Suite 321","locality":"Stratford","region":"ON","postal_code":"N5A 7X6","country":"Canada","phone":"1.866.578.7210"}]}