{"id":"274336","name":"Virtual Assistant Talent","tagline":"DON'T LET YOUR BUSINESS RUN YOU.","profile":"/profile/virtual-assistant-talent","website":"https://virtualassistanttalent.com","directory":"bpo","page":"62","verified":"","description":"Virtual Assistant Talent was established by John Davern, Jr., MBA as a result of his own experience and business needs. John has a BA in Labor & Industrial Relations from Pennsylvania State University and an MBA in Human Resources from Duquesne University. In graduate school, John was an active member of the International Student Organization, where he developed contacts and friendships with people from all over the world, and established an appreciation for other cultures.\nIn addition, John is a Certified Internet Technology Webmaster, received at Illinois Institute of Technology, and has also spent thousands of dollars in personal development and training on Social Media/Web 2.0 and using it to grow his businesses. John is also the Managing Principal of Bay Area Home Buyers, LLC and GP Investment Network, LLC, which buys, sells, and holds real estate. These businesses maintain an excellent standing with the Better Business Bureau. He has been involved in real estate investing for over 9 years and owns investment properties in multiple states. John is active in his local Real Estate Investor Associations, including Bay Area Wealth Builders and San Jose Real Estate Investors Association. John became involved in real estate investing while still in the corporate world so he quickly saw the need and importance of leveraging his time most effectively. As a result, he began using VAT LLC to help support and grow his real estate business, thus practicing what he preaches. Now he is using what he has learned to help others improve their businesses and quality of life through VirtualAssistantTalent.com.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"3984 Washington Blvd Suite 110","locality":"Fremont","region":"CA","postal_code":"94538","country":"United States","phone":"866.596.9041"}]}