{"id":"274920","name":"Complete Admin Solutions","tagline":"Virtual Services CANADA","profile":"/profile/complete-admin-solutions","website":"http://completeadminsolutions.ca","directory":"bpo","page":"69","verified":"","description":"My name is Chrissy Hobbs, I’ll be your professional virtual assistant, and I am the owner and founder of Complete Admin Solutions. With over five years in the emergency communication sector, two years as a virtual assistant and several years on data entry, I have over ten year’s experience. I guarantee no project is more important to me than my client’s project. I guarantee no project is more important to me than my client’s project.\nWe have all heard that old saying that there are only so many hours in a day, well, not any longer. By hiring virtual assistant services, you free up more of your valuable time to work on what you want or spend time with friends and family. I can take care of your business needs, and you can rest easier knowing that you’re receiving a professional and confidential virtual assistant service. As a professional, I understand the very hectic and stressful schedules in your business and even in your personal life. Complete Admin Solutions is here to help your life all easier and stress-free. It is our goal to ensure that our valued customers will have more time to enjoy their lives while we take care and manage all of the small concerns their businesses may have. I could do the same thing for you! Complete Admin Solutions offers administrative support services to local businesses and also operates throughout the world. Whatever your company deals with, and how far or near you are from us, you can always be sure that you have come to the right place where you can get the best administrative support services to have a smoother and faster operation process for your business.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"Undisclosed","locations":[{"headquarters":true,"address":"Barker Street","locality":"London","region":"ON","postal_code":"","country":"Canada","phone":"1.519.318.6510"}]}