{"id":"276243","name":"Frontier Technology","tagline":"A Cloud Computing and Managed Services Provider","profile":"/profile/frontier-technology","website":"http://www.frontiertechnology.co.uk","directory":"it-services","page":"154","verified":"","description":"Frontier is a leading IT Infrastructure and cloud solution provider focused on providing data security and management solutions. Clients are increasingly looking to the cloud as a method of delivering cost efficient and agile IT services, we offer objective and pragmatic advice to help you select appropriate approaches, wherever that data may be; public, private and hybrid cloud platforms, on-premise infrastructure or combinations of these.\nFounded in 2005 by a team of experienced IT professionals, we design, implement & support data centre solutions that secure client’s data, while accelerating business processes, simplifying management & reducing costs. We offer solutions from leading technology vendors, including traditional server, storage & network systems, data security applications, such as email security, identity & privilege access management, automated pen testing & unified communications, plus our own suite of managed services, e.g.:\nFrontier Hosting Service: IaaS\nFrontier Vault Service: Backup, Archive & Compliance\nFrontier Continuity Service: Business Continuity & Disaster Recovery\nFrontier Monitoring Service: Proactive system monitoring, management & reporting\nFrontier operates its own data centres, providing secure hosting, data management & business continuity services to clients, giving us valuable perspective that is leveraged reviewing IT infrastructure, data security & management requirements with clients.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"Undisclosed","locations":[{"headquarters":true,"address":"290 – 294 Latimer Road","locality":"London","region":"LND","postal_code":"W10 6QW","country":"United Kingdom","phone":"+44 (0)845.603.6552"}]}