{"id":"277164","name":"Fat Media","tagline":"Full Service Digital Agency","profile":"/profile/fat-media","website":"http://www.fatmedia.co.uk","directory":"web-developers","page":"213","verified":"","description":"Fat Media is a multi-award-winning website design and digital marketing company recognized as the ‘go to’ company for high-end website design, development, and tactical digital marketing campaigns.\nAt Fat Media, we understand that what our clients want are websites that really catch the eye – that work precisely the way your business needs them to; that your clients and customers love to come to and, crucially, that bring your company real results.\nFat Media’s award-winning web design and digital marketing experts have helped hundreds of local, national and even international clients achieve new levels of success through superb new site launches, innovative digital marketing campaigns, and intelligent, measurable search engine optimisation strategies.\nWorking with us, you’ll soon start to view Fat Media as a valuable extension of your own marketing team.\nWith an in-house team of more than 100 specialists always keeping an eye on the latest web development technology, design, and marketing techniques, we’ll constantly deliver new solutions that fit precisely with your ever-changing digital requirements and keep you one step ahead of your competitors.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"Harpers Mill","locality":"Lancaster","region":"LAN","postal_code":"LA1 4XF","country":"United Kingdom","phone":"+44.1524.548948"},{"headquarters":false,"address":"Harling House,47-52 Great Suffolk Street","locality":"London","region":"LND","postal_code":"SE1 0BS","country":"United Kingdom","phone":"+44.203.198.7766"},{"headquarters":false,"address":"Vintry Building Wine Street","locality":"Bristol","region":"BST","postal_code":"BS1 2BD","country":"United Kingdom","phone":"+44.117.971.2499"}]}