{"id":"27775","name":"Rlogical Techsoft Pvt. Ltd.","tagline":"Web,Mobile App,POS/Kiosk software Development","profile":"/profile/rlogical-techsoft","website":"http://www.rlogical.com","directory":"directory/mobile-application-developers","page":"40","verified":"","description":"Rlogical Techsoft is leading IT service provider with existence experience of more than 8 years with strength in delivering end-to-end Web and Mobile app solutions. We bring superior technology experience as per precise needs: be it a new idea or a business bottleneck holding you back or a technology team requirement to achieve your business goals.\nHaving immense experience in this industry with endeavors of numerous business visionaries who constructed their fruitful products and organizations with a true concentrate on their clients. We at Rlogical, has bunch of brilliant and dedicated professionals with vision to tint the vivid future for the businesses working on digital landscapes.\nWe always believe that “my current customer is most likely to be my next customer.”\nTechnologies in which we are working: -\n• Web Design\n• Mobile app Development (Native iOS & Android, Cross Platform) - Android Studio, X code (Objective c, Swift)\n• ASP.NET, MVC 3 (Razor), Sql Server 2008, .Net Framework 4.0, EntityFramework 4.1, JavaScript, NodeJS, Angular JS, JQuery, JSON, HTML5)\n• PHP (Joomla, WordPress, Opencart, Magento, Drupal, Shopify, PrestaShop, Zen Cart, Open Cart, Oscommerce, Cake PHP, CodeIgniter, Design including Responsive, NINJA FRAMEWORK, SMARTY PHP)\n• Windows Application (C# , .NET , WPF 4.0 ,Telerik control ) • POS Software development.\n• Scraping, Data Mining\nThank you very much for review our Company Profile.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"701 Satkar Complex, Opp Tanishq Showroom,Behind Lal Bungalow,","locality":"Ahmedabad","region":"GJ","postal_code":"380009","country":"India","phone":"+919824601707"}]}