{"id":"277951","name":"Screaming Frog","tagline":"Social Media Marketing Services Agency","profile":"/profile/screaming-frog","website":"https://www.screamingfrog.co.uk","directory":"seo-firms","page":"134","verified":"","description":"Screaming Frog is a search marketing agency drawing on years of experience from within the world of digital marketing. We deliver our search expertise to companies worldwide.\nFocussed on providing great service through excellent communication, we will work with you, internal teams and with your external agencies to ensure that your business excels.\nOur Services Include:\nThe Screaming Frog SEO Spider- A small desktop program which spiders websites' links, images, CSS, script, and apps. It also fetches key onsite page elements for SEO, presents them in tabs by type and allows you to filter for common SEO issues, or slice & dice the data how you see fit by exporting/ importing into Excel. You can view, analyze and filter the information as it's gathered and updated continuously in the program's user interface.\nSearch Engine Optimisation - A focussed approach, providing a great return on your investment using simple, effective & transparent techniques. Our team is extremely experienced at working in the most competitive industries with small to medium-sized businesses as well as large brands.\nPay Per Click - Results driven PPC management, providing transparent & measurable campaigns that allow you to evaluate the success against your own targets. We are hugely experienced across a wide range of industry verticals and offer a proactive, strategic and highly communicative service. We know that the success of a campaign comes down to continual optimisation and refinement.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"6 Greys Road, Henley-on-Thames","locality":"","region":"","postal_code":"RG9 1RY","country":"United Kingdom","phone":"44 (0)1491 415070"}]}