{"id":"279375","name":"Social Media Ltd.","tagline":"SEO, PPC London Marketing Agency","profile":"/profile/social-media","website":"https://social-media.co.uk","directory":"seo-firms","page":"156","verified":"","description":"We are a results-driven online marketing agency specializing in providing integrated search engine optimisation (SEO), social media marketing (SMM), pay per click campaigns (PPC) and brand reputation management (BRM) solutions to a broad range of clients.\nCompanies we have worked with include those in the travel, healthcare, legal, finance, retail and IT industries and range in size from small local businesses to those listed on the FTSE.\nThe success we have had with these clients is down to our attention to detail in spotting which online marketing techniques are working for them and which are not. Our dedicated search engine optimisation and pay per click specialists monitor the success of campaigns very closely and are constantly on the lookout for ways to maximise their effectiveness. Social media marketing consultants work in conjunction with this team to boost the exposure of our clients' businesses to potential customers on Facebook, Twitter, LinkedIn, YouTube, Pinterest, Instagram, Flickr, StumbleUpon and other social media platforms.\nIn addition to these experts, we also have a team of developers and content writers who ensure our clients' brand image is maintained and has an even more prominent place in the market. This is achieved through the use of blogs, forums and viral marketing methods to generate traffic for our clients' websites.\nAll round, our scrupulous monitoring of the success of our marketing strategies together with our tight-knit team of experts means that our clients receive a service that drives new business to their companies.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"71 St John Street, Farringdon","locality":"London","region":"","postal_code":"EC1M 4NJ","country":"United Kingdom","phone":"+44 0203 811 6475"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"","phone":""}]}