{"id":"2802","name":"MentorMate","tagline":"Offshore Custom Software Made Easy","profile":"/profile/mentormate","website":"https://mentormate.com","directory":"directory/mobile-application-developers","page":"35","verified":"","description":"If you’re looking for a cheap offshore production shop, that’s not us. If a long-term partnership with a highly-efficient, easy-to-work-with global leader is more your style, you’ve landed in the right place. By enrolling the best and brightest minds in Bulgaria, we deliver innovative custom software solutions with a personalized touch.\n \n \nWe recognized the potential of Bulgaria back in 2001 and helped it grow into the tech hub it is today. Along the way, we built long-term relationships with global clients, scaling with them as their technology needs grew. Employees in our five Bulgarian offices are 100% fluent in English and work noon–8pm local time (4am–noon CST). This makes communication a breeze and gives us four hours of daily overlap in working hours for meetings and exchanging ideas. We conduct daily standups that keep everyone on the same page even if they’re not in the same office, city, or even country.\n \n \nTechnology is constantly evolving, making it daunting to navigate. We pride ourselves on our ability to demystify digital trends and cut through the jargon. We’ll guide you through the best options to fulfill your business needs in the most efficient way possible.\n \n \nOur company’s flat structure allows the opportunity to work directly with your development team as well as our senior leadership team. You’ll work, learn, and celebrate successes together while connecting on a personal level. Swap music recommendations, geek out about movies, and discuss weekend plans as you would with someone in your own office.\n \nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"250 - 999","founded":"2001","locations":[{"headquarters":true,"address":"3036 Hennepin Ave S","locality":"Minneapolis","region":"MN","postal_code":"55408","country":"United States","phone":"+1.612.823.4000"},{"headquarters":false,"address":"67 Prof. Tsvetan Lazarov Blvd.","locality":"Sofia","region":"","postal_code":"1592","country":"Bulgaria","phone":"+359.2.862.2632"},{"headquarters":false,"address":"Pepparedsleden 1","locality":"Göteborg","region":"","postal_code":"431 50","country":"Sweden","phone":"+46.31.776.1000"}]}