{"id":"28020","name":"Lunar Logic","tagline":"We make your product come true.","profile":"/profile/lunar-logic","website":"http://www.lunarlogic.io","directory":"directory/mobile-application-developers","page":"41","verified":"","description":"Lunar Logic is a web development company specializing in Ruby, JavaScript and mobile technologies. While we care deeply about craftsmanship – it is one of the crucial attitudes we look for when hiring – that’s not what make us different. Our biggest differentiator is how far we take transparency.\nThere’s no professional relationship that will last in the long run without trust, and transparency is the best way to build trust.\nTherefore, transparency is the cornerstone of how we work. We deliver features to our clients’ target environments as soon as they are finished, as frequently as daily, so our clients know exactly how their project is progressing.\nEven if it means less work for us in the short term, we regularly advise our clients to send us less work than they initially plan to when it's less risky and more cost effective for them to validate their business idea with a smaller feature set. \nOur teams are made up of software developers, graphic designers, UX experts and testers. These project teams work collaboratively and the result is less rework and better results, e.g. we discourage doing design upfront, etc. We also expect our clients to be involved in this daily collaboration because short feedback loops help us deliver products that customers love.\nLunar Logic operates as a fully self-organized company, i.e. there are no managers or formal leaders. This means that even strategic decisions are made collectively. Everyone has huge autonomy and contextually acts as a leader. This results in motivated and effective project teams that step in whenever an issue needs to be addressed.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"al. Krasinskiego 17/3","locality":"Krakow","region":"","postal_code":"31-111","country":"Poland","phone":"+48 12 430 22 88"}]}