{"id":"280934","name":"MedRec Technologies","tagline":"Custom App Development based in UK, Europe & USA","profile":"/profile/medrec-technologies","website":"https://medrectech.com","directory":"directory/mobile-application-developers","page":"12","verified":"","description":"MedRec Technologies is a London, UK based software development company. We have development facilities located in UK, USA, Europe, Middle East, Central and East Asia. Currently, we comprise of a team of over 60 + software engineers, technology consultants, creative designers and scientists with expertise in different technical domains. From Healthcare to Robotics, Finance to Autonomous mobility, Education to Manufacturing; \nWe are working on disruptive technologies such as Big Data Analytics, AI, Machine Learning, Deep Learning, Cognitive Computing, Internet of Things, Cloud, Security, SDN-NFV, RPA, Blockchain etc. \nWe deliver these services across industry sectors such Automation and Robotics, Retail, Banking, Insurance, E-Commerce, Education, Manufacturing, Travel, Transport, Hospitality and Maintains etc.\nOur highly qualified staff offer expert skills in project support. Our team spirit and the company's management proficiency are successfully combined with creativity, dedication, and a development culture to produce solid, effective technological results. Our commitment is to deliver high-performance and scalable products to industries.\nGet a free consultation, fill up this form or email us at hello@medrectechnologies.com\nOur Services:- \n- Automation and Robotics\n- Web and E-Commerce \n- Mobile Application\n- Chatbot- Enterprise Software\n- Real-Time Application\n- Custom Application\n- IoT and Cloud-Based\n- Software Testing and QA\n- Maintenance and Support of product\n- Outsourcing IT Consulting\n \n \n \n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2015","locations":[{"headquarters":true,"address":"","locality":"London","region":"","postal_code":"E1W 1UN","country":"United Kingdom","phone":"+44.7466035003"},{"headquarters":false,"address":"","locality":"Udaipur","region":"RJ","postal_code":"","country":"India","phone":""}]}