{"id":"28322","name":"Eltrino","tagline":"Rock your eCommerce!","profile":"/profile/eltrino","website":"http://eltrino.com","directory":"it-services","page":"45","verified":"","description":"We are a full-service eCommerce solutions provider\neCommerce Solutions development is our passion and what we do best.\nWe serve B2B & B2C webshops for the development of useful extensions for Magento and OroCRM. We are creating own help desk software (DiamanteDesk) for organizing all of your incoming customer requests from all sources in a single place.\nOur team consists of some of the first employees of Magento/Varien who took part in the development of the platform since the very beginning.\nCurrently, we have 20 team members and are constantly growing. Our team is balanced and we have experienced Magento developers, QA engineers, front-end developers, a system administrator, and a project manager. Also, most of our people are Magento Certified Plus Developers or Magento Certified Front-end Developers. Our main strength is our combination of Magento knowledge, experience, code quality, and development speed.\nWhen we start a new project we try to deprive our clients of unnecessary worries by providing consultation and explaining how we will effectively implement a solution.\nOur relationship with clients are long term and as usually convert from a strictly professional collaboration to friendship.\nOur grateful customers generously share their impressions from our cooperation with their partners and due to this, we gain new happy customers.\nOften we are sought out for improvement and support. People want to get rid of the persistent problems or permanent threat of their occurrence, so we give them happiness, providing calmness and confidence.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"Obolonsky ave. 22B, Suite 59","locality":"Kyiv","region":"KV","postal_code":"04205","country":"Ukraine","phone":"+380.96.648.648.3"},{"headquarters":false,"address":"5348 Vegas Drive, Suite 653","locality":"Las Vegas","region":"NV","postal_code":"89108","country":"United States","phone":"+1.702.727.3738"}]}