{"id":"283268","name":"Mango IT Solutions","tagline":"eCommerce Solutions Provider","profile":"/profile/mango-it-solutions","website":"http://www.mangoitsolutions.com","directory":"directory/mobile-application-developers","page":"81","verified":"","description":"Mango IT Solutions, previously referred as AnyLinuxWork, is an ISO 9001 certified web company working exclusively on PHP-MySQL and mobile development. We specialize in web applications including eCommerce, shopping carts, CMS, LMS, rental, custom and SAAS applications; server management, and mobile applications. We work on Frameworks/CMS like:\n1. Zend 2.0, CodeIgniter, CakePHP, Symfony, Laravel\n2. WordPress, Joomla, Drupal\n3. Magento 1.x & 2.x, WooCommerce\n4. Mobile App Development with Android and iOS\nMango IT Solutions has been catering to a wide client base across the world since 2006 thanks to 60+ IT professionals team working under one roof. We have projects from 20-1000 man-days of work, including 1-10 member dedicated teams. We offer end to end web development services including designing, coding, mobile development and server management.\nWith 98%+ successful project completion rate, we generate 60%+ repeat business. We are an exclusive PHP-MySQL reliable, professional, timely, and communicative and value for money provider. Please visit Mangoitsolutions for portfolio details and client testimonials.\nMangoIT is among top 10% providers on Upwork and has clocked 200,000+ hours with 97% job success rate and nearly zero dispute. We understand the rules and regulations of the platform and in addition to work screen-shot tracking, we offer project monitoring on Asana, BaseCamp, staging servers, and daily email reporting, and are available on Skype/Hangout or phone for client communication. Our team members are always updated with the latest PHP technologies/versions and are among top rated providers.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"15/3 Old Palasia behin Sarda House","locality":"Indore","region":"","postal_code":"452001","country":"India","phone":"1-347-809-3480"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"","phone":""}]}