{"id":"283370","name":"Telesens","tagline":"Enterprise Software Solutions. Professionally!","profile":"/profile/telesens","website":"http://www.telesens.ua","directory":"directory/mobile-application-developers","page":"387","verified":"","description":"Telesens is a global provider of enterprise level software products and solutions for telecom and other business domains. We have been operating since 1998 and serve customers in more than twenty countries worldwide. The company headquarters is located in London with the development center in Ukraine.\nTo support the growth of our customers’ businesses and their reliable operation, we offer a wide range of services:\nCustom software development\nTailoring and implementation of own software products at telecom operators and other business domains\nAssembling turn-key solutions on platforms of leading telecom software vendors\nOver 600 projects have been successfully implemented for our clients all over the world.\nTelesens is a certified partner of Oracle and Microsoft corporations and we work in close partnerships with the world’s leading telecom solutions vendors like NOKIA (Finland), SIEMENS (Germany), Comptel (Finland), DigitalRoute (Sweden), Bercut (Russia).\nHigh corporate culture and ISO 9001:2015 certified business processes allow us to satisfy the most demanding customers with excellent quality solutions and support services. More than 100 highly qualified technical specialists are working for the company with the potential for rapid corporate growth due to our own educational center and close cooperation with leading technical universities in Ukraine.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1998","locations":[{"headquarters":true,"address":"Molochna Str., 38","locality":"Kharkiv","region":"","postal_code":"61001","country":"Ukraine","phone":"380577199471"},{"headquarters":false,"address":"Molochna Str., 38","locality":"Kharkiv","region":"","postal_code":"61001","country":"Ukraine","phone":"+380 57 719 9471"}]}