{"id":"28396","name":"Eureka Software","tagline":"Custom Software, Cloud, Mobile Apps, Strategy","profile":"/profile/eureka-software","website":"https://eurekasoft.com","directory":"directory/mobile-application-developers","page":"26","verified":"","description":"Eureka Software (Eureka) is a custom software and technology engineering firm based in Austin, Texas.  For 30+ years, the company has consistently provided an array of software and project management services, focusing on three strategic areas:\nTurnkey software and application design, development, integration, maintenance and support\nCost-effective strategic technology planning, product design, and full lifecycle project management\nQuality assurance planning, verification, and automated testing\nFew organizations can offer the breadth of technology know-how that we do, even fewer can actually follow through. We have worked with and continue to work with legacy and leading edge software technologies used for object-oriented development, cloud-based computing and storage, web development, mobile and mobile app development, and many others. \nEureka believes in becoming a strategic technology partner with its customers.  We provide our services to a broad range of organizations in a variety of industries, having successfully partnered with a host of customers, ranging from global corporations, Fortune 500’s, small-to-mid-sized firms, high tech startups, and many others.  Sample customers include worldwide firms such as Dell, Motorola, AMD, Siemens, Samsung, 3M, SBC, Tektronix, Progressive Insurance, NCR, Schlumberger, Sears, and Sprint. Smaller firms include many software product developers and high technology companies such as Trilogy, Micro Focus, and Baron Services.   \n At Eureka we live to solve problems with software.  Providing world-class service to the small start-up or a large, multi-national corporation, our goal is the same:  to exceed your expectations.  We believe software product development is a blend of technical artistry and high-end engineering – we go far beyond programming.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1986","locations":[{"headquarters":true,"address":"3305 Northland Drive, Suite 305","locality":"Austin","region":"TX","postal_code":"78731","country":"United States","phone":"512-459-9292"}]}