{"id":"284001","name":"Bee Social Marketing","tagline":"Digital Marketing Agency","profile":"/profile/bee-social-marketing","website":"http://beesocialmarketing.co.uk","directory":"seo-firms","page":"244","verified":"","description":"Listed in Top 25 Social Media Agencies in UK - Social Media Management ★ Social Media Training ★ Social Selling ★\nHow good is your online presence? How do you stand out from the competition? Do you get results from your social media?\nMy career in marketing started 20 years ago where I have worked for some of the leading Marketing Agencies in the UK and globally. I was part of the team when Groupon made 1 Billion Dollars faster than any other company in the world Including Google.\nI pride myself on delivering results, customer satisfaction, creativity, strategy and going above and beyond for your business. Over the last 4 years, Bee Social Marketing has grown purely through recommendation to be one of the leading Social Media Agencies in the UK, listed by Klout in the Top 10 Social Media Agencies in the UK in 2015 Top 500 Social Media Agencies UK (#SMAUK500).\nI hear so many stories that social media doesn't work and this is why I made Bee Social Marketing purely a specialist in Social Media rather than a jack of all trades like so many other agencies.\nWE HELP BUSINESSES IN A NUMBER OF WAYS:\nSOCIAL MEDIA MANAGEMENT - Outsourcing your social media will save you not only time but money overall. In a busy business, social media will always get pushed to the back of tasks, but not by us. Your social media accounts will have our highest priority and it won't be long until you are seeing the results coming in from our monthly reports. I don't like to blow our own trumpet, but the social media software we purchase has so many features and benefits that will get your business results, this is where we can really make a difference.\nSOCIAL MEDIA TRAINING - Learn from the best as we create a tailored strategy for your business.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"Windsor House, Cornwall Road","locality":"Harrogate","region":"","postal_code":"HG1 2PW","country":"United Kingdom","phone":"+44 01423 297009"}]}