{"id":"284331","name":"The Cabinet","tagline":"Design Agency London","profile":"/profile/cabinet","website":"https://www.thecabinetagency.com","directory":"web-designers","page":"738","verified":"","description":"Not unlike the ‘other’ Cabinet, we’re a London-based collective decision-making body, acting in a strategic advisory capacity to our clients… creating, developing, delivering and protecting brands across all sectors and disciplines. At The Cabinet we're big fans of Winston.   Not just because he saved our country or was partial to the occasional killer quip… no, we love the man for his passion, his intelligence and his stamina.\n All vital qualities we believe brands must have today to be successful and leaders in their field. As our name suggests, the 3 founding ‘cabinet’ members jointly hold office, exercise the same powers and share one vision… to work with our clients to build successful brands.   Everything creative we deliver is realised through the levels of craftsmanship that have traditionally been used in cabinet making.  Yes, another inspiration for our name… albeit our craftsmanship is executed through 21st century technologies. Regardless of the potency of today’s tools and techniques, at its core, each and every brand opportunity we work on is constructed on 3 fundamental pillars: A uniquely defined CAUSE Built with, and around, COMMUNITIES Delivered through the highest levels of CRAFTSMANSHIP And because we’re a collective, we’re masters at collaborating… creatively, commercially and through top-notch client servicing.   It's the ‘two heads are better than one’ principle.  Its rooted in the knowledge that we can’t do what we do without you, and that you’re better at what you do when you do it with people like us.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"Atlantic House, 351 Oxford Street","locality":"London","region":"","postal_code":"W1C 2JF","country":"United Kingdom","phone":"44.20.7101.3939"}]}