{"id":"284753","name":"JeraSoft","tagline":"Agile Billing Solutions","profile":"/profile/jerasoft","website":"https://www.jerasoft.net","directory":"it-services","page":"367","verified":"","description":"The JeraSoft Billing Platform is a multifunctional billing solution for Mobile and Business Telecoms (Retail VoIP, Mobile VoIP, Wholesale VoIP and SMS, Business Telephony, MNO/MVNE/MVNOs, OTTs), ISPs, CSPs, CLECs, ILECs, Data, and IoT/M2M service providers. It is designed for billing of practically all kinds of services. The platform automates billing, rating, routing and mediation processes and manages hundreds of thousands of subscribers at once.\nA real-time solution that supports a wide variety of business models, JeraSoft VCS can help IoT developers to automate their processes with a full-featured Internet of Things (IoT) billing solution, empowered with rating and mediation features. It supports the implementation of the Internet of Things (IoT) and inter-machine interaction (M2M) in an industry, enabling remote monitoring and management of connected assets (technological objects, devices, SIM cards). JeraSoft IoT Billing Platform easily collects and manages data from sensors, devices, cloud platforms and from other agricultural and power supply equipment for IoT services to bill (air, water, soil, weather and other related utilities and meters).\nFull-featured Billing System for telecom providers supports Retail VoIP, Mobile VoIP, Business Telephony, MVNO, OTT, Wholesale VoIP, and SMS Wholesale. The Billing System offers a wide variety of modules that are aimed at automating common tasks for Telecom operators such as Retail Services, Dynamic Routing, Rates Management, Jurisdictional Billing, CDR Disputes Modules, A-Number Billing. Multi-functionality of JeraSoft VCS creates an avenue for much more meaningful experience and deeper data analysis for our clients. At the same time, the software is highly compatible aimed to cover customers' needs with a completely flexible system.\nFor more information, please visit https://www.jerasoft.net/ or contact sales department.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"153 The Parade High Street","locality":"London","region":"","postal_code":"WD17 1NA","country":"United Kingdom","phone":"+44 (203) 129-9126"}]}