{"id":"285982","name":"Vavatech","tagline":"Experienced Java developers","profile":"/profile/vavatech","website":"http://vavatech.eu","directory":"web-developers","page":"94","verified":"","description":"Helpfulness and experience. These two perfectly describe Vavatech which have delivered remarkable Java and JEE solutions since 2005.\nOur employees are Java/JEE specialists holding a Computer Science degree from the University of Warsaw - the leader of European schools of technology.\nThe company is focused on creating customised IT systems solving problems in big corporations, public administration, small businesses and start-ups.\n \nHow can we help you?\n1. Create customised IT system perfectly adjusted to your needs.\n2. Outsource our experienced programmers.\n3. Carry out a training course about one of programming language.\nWhy can we help you?\n1. We have 15 years of experience in software development.\n2. We created complex systems for corporations and government as well as simple solutions for small businesses.\n3. We specialize in Java but we know variety of technologies which can improve system and business efficiency.\nHow we work?\n1. A client gives us requirements and specification of a system.\n2. We make a in-depth analysis and make a free estimation to the client which consists of: time, costs and technology.\n3. We make a deal.\n4.Our programmers are familiar with the Agile model, therefore you can see the project results at its every stage.\n5. We finish the product and provide further maintenance and improvement if necessary.\nOur biggest success is maintaining fruitful relationships with many clients over the years, so if you are considering cooperation with us you have a proof that you will get premium experience with no risk and high costs.\nWant to know more? Look at our website: vavatech.eu\nWant to estimate a project? Contact us at: office@vavatech.pl\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2003","locations":[{"headquarters":true,"address":"Olesińska 21","locality":"Warsaw","region":"","postal_code":"02-548","country":"Poland","phone":"+48 22 845 09 70"}]}