{"id":"286366","name":"Search Engine People","tagline":"Canada's Top SEO & PPC Agency Since 2001","profile":"/profile/search-engine-people","website":"https://www.searchenginepeople.com","directory":"seo-firms","page":"47","verified":"","description":"Some people are cat people. Others are dog people. Well, we are Search Engine People, a close-knit team that is borderline obsessed with all things SEO & PPC.\nWhen it comes to digital marketing, we know our stuff! Since 2001 we have helped 2,000+ Canadian businesses big and sall. We are a 100% full service agency, that means your level of involvement is up to you.\nOur team of 60+ marketers are all 100% Canadian based and working our of Pickering, Ontario. Except for Matt, he moved south of the border but we kept him around.\nWe are Google's first ever and longest standing partner in Canada, but we didn't stop there. Beyond our Google Premier Partnership we hold top level partnerships with Microsoft, Facebook, Instagram, LinkedIn, Pinterest, Waze, Snap Chat and dozens of other lesser known but very cool niche platforms.\nThat's a lot about us, and to be honest, all of that bragging feels a little un-Canadian of us. So lets talk about you. Is your business Global, National or Local? Are you the Owner, President, CEO, CMO or Marketing Manager? We genuinely want to learn more about you, your business, your pesky competitors and your goals. From there we can build our a custom strategy for you. No smoke and mirrors. We show you exactly what we plan to do along with transparent and easily understood pricing.\nGive us a call or drop us a line today. We are always excit to talk digital!\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2001","locations":[{"headquarters":true,"address":"1305 Pickering Parkway, 5th Floor","locality":"Pickering","region":"","postal_code":"L1V 3P2","country":"Canada","phone":"877.486.7875"},{"headquarters":false,"address":"","locality":"Toronto","region":"ON","postal_code":"M4B 1B4","country":"Canada","phone":""}]}