{"id":"287560","name":"Tridence Marketing Agency","tagline":"Digital Marketing | Brand Development | SEO","profile":"/profile/tridence-marketing-agency","website":"http://tridence.com","directory":"seo-firms","page":"359","verified":"","description":"Digital Marketing | Web Design and Mobile | National Brand Development | Social Media | Technology | Hispanic Marketing | SEO | ChatBots | Coaching\nMission: We specialize in helping Entrepreneurs, Businesses, and Non-Profits create unique brands to captivate, engage and convert customers. We help businesses humanize their brand with their target audience.\n\nOur Responsive Websites along with Social Media and Digital strategies help guide businesses small and large to dominate your market. We are a proven, award-winning company with exceptional talent that delivers measurable results. Our professional experience has revolved around helping Brands, Companies, Non-Profits, and Political Campaigns to connect, adapt, and engage with the Hispanic / Latino audiences.\nAlso, our massive development team excels at combining exceptional graphic design, dynamic and current Web programming technologies with powerful digital marketing agendas. We are results-oriented in every aspect of our work and take pride in our reputation for providing insightful, strategic communications counsel as well as the meticulous execution of our digital marketing campaigns.\nAgencies and Independents use Tridence as their #1 outsourced Web Development team (Whitelabel). For the past 20 years, we specialize in all levels of software development and programming languages with the mobile marketing of fresh interactive media - from inception to build-out.\nTo all our clients past and present, Thank You for Trusting Tridence as your partner and the valuable friendships we have over the years. 20 yrs Helping People and Businesses Grow!\nHow can we Help You?\nminority-owned and operated business.\nChicago, Illinois & Jacksonville, Florida\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2000","locations":[{"headquarters":true,"address":"830 3rd St. South Suite","locality":"Jacksonville Beach","region":"FL","postal_code":"32250","country":"United States","phone":"904.701.4619"},{"headquarters":false,"address":"111 w Wacker","locality":"Chicago","region":"IL","postal_code":"60601","country":"United States","phone":"312.601.8525"}]}