{"id":"289181","name":"Fayrix","tagline":"Custom software development & Big Data services","profile":"/profile/fayrix","website":"http://www.fayrix.com","directory":"directory/mobile-application-developers","page":"25","verified":"","description":"Fayrix provides world-class custom & offshore software development. Relying on 14 years of experience and a talented team of 1500+ IT professionals including 700+ developers, we are ready to execute software development projects of any scale.\nWe provide to our clients flexible terms, competitive rates & different models of partnership - time & materials, dedicated teams or project-based full outsourcing. \nFayrix key values:\n★ Guarantees and transparency. We work in full compliance with the highest international legal & financial standards.\n★ Availability. With 10 R&D centers in key educational and technology hubs of Eastern Europe, Fayrix has a direct access to the top IT talents. We are ready to provide at least 3 developer CVs for each position in 3 business days.\n★ Flexibility. We can allocate a full-time dedicated team with temporary relocation to our clients, work under Time & Material approach or develop custom projects with fixed deadline, price and a detailed tech specs.\n★ Dedication. Fayrix works under a documented methodology, elaborated in 14 years of our experience, with weekly project progress reports, regular calls and discussions with our clients.\nSPECIALITIES:\n▬▬▬▬▬\n» Big Data services. Fayrix's Big Data team unites highly-motivated and professional data scientist, who were awarded Kaggle Master and Grandmaster titles (only 108 people on the planet hold this title).\n» Front-end development (HTML, CSS, Bootstrap, JavaScript, ReactJS, BackboneJS).\n» Back-end development (PHP, RubyonRails, Java, Hadoop, Oracle, PostgreSQL, NodeJS, mongoDB, C#, Go Lang, Oracle, MySQL).\n» Mobile development (Kotlin, Java, Swift, Obective-C, C++, C#).\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"1,000 - 9,999","founded":"2005","locations":[{"headquarters":true,"address":"4 Maskit, Herzliya","locality":"Pitu'akh","region":"","postal_code":"4614001","country":"Israel","phone":"97293740180"},{"headquarters":false,"address":"","locality":"Curitiba","region":"","postal_code":"","country":"Brazil","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Russia","phone":""}]}