{"id":"28946","name":"DeSmart Software House","tagline":"Change your Idea Into Amazing Digital Product!","profile":"/profile/desmart-software-house","website":"https://desmart.com","directory":"directory/mobile-application-developers","page":"26","verified":"","description":"DeSmart is an Agile Software House. We Change Ideas Into Amazing Digital Products People Love. We Partner With Digital Agencies, Startups, and Brands.\nWe work for companies all over the world - Berlin, NYC, London, LA, and many others. We always put the Stakeholders in the center of our project. With the Design Thinking methodology, we understand business goals and then fit the product to it. We use the Impact Mapping, Design Sprint, Business Model Canvas, Product Canvas, Evenstorming, and User Story Mapping.\nWe use agile methodologies, work in weekly periods called sprints, and we're trying to deliver an MVP within 2-3 months of creation.  \nWe are a team of almost 30 people, and we build products from scratch. DeSmart is well experienced in working with both early stage ventures as well as corporates but let's be honest we have startups in our veins. We have co-founded several ventures, some of them failed, some succeeded like UXPin.com. Check us out what this experience means to you!\nWorking with Desmart:\n16 years experience in delivering almost 200 digital tools\nworkshops to use this extensive knowledge from day one\nfocus on outcome and your business impact\naccurate time logs for the work done\nconstant contact with the team over video and Slack\ncollaboration in different time zones\nWe build Digital Products (Web/Mobile Apps) in the following technologies:\nReact, React Native\nJavaScript\nVue.js\nPHP (Laravel)\niOS (Swift)\nNode.js\nMySQL, PostgreSQL, MongoDB, ElasticSearch\nLet us help you boosting your business with new digital products that people will love!\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2003","locations":[{"headquarters":true,"address":"Abrahama 37","locality":"Gdynia","region":"","postal_code":"81-366","country":"Poland","phone":"+48 661995405"},{"headquarters":false,"address":"Craven House 40-44 Uxbridge Road","locality":"London","region":"LND","postal_code":"W5 2BS","country":"United Kingdom","phone":"+447547813975"}]}