{"id":"289796","name":"Aira","tagline":"We help you get noticed online. Simple.","profile":"/profile/aira","website":"https://www.aira.net","directory":"seo-firms","page":"170","verified":"","description":"Aira is a fast growing team of passionate digital marketers. We have a wealth of experience, working with businesses ranging from SMEs to the world's best known brands. Our services include digital, inbound & content marketing, social media, digital PR, web design and development.\nWe are a digital marketing agency with experts who deliver results. By getting to know your business, we work in partnership with you to build and implement strategies that truly make a difference. Whether it’s paid search, SEO, content marketing, or social media, we focus on your objectives to achieve real-world results.\nSearch engine optimisation doesn’t have to be the ‘dark art’ that’s impossible to understand. Our SEO services are understandable, transparent, and really work.\nPPC comes down to two things: data, and creativity. Our services are designed to constantly optimise performance, delivering the results you need.\nGreat content is, by far, the most important thing when it comes to getting your business noticed online. Our content marketing campaigns get you in front of the people that matter.\nSocial media can be the quickest and strongest way for your company to reach out to your audience. Our campaigns have your brand and customers at their heart, utilising the most effective networks and technologies.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2015","locations":[{"headquarters":true,"address":"Aira, 2nd Floor, Norfolk House, 110 Saxon Gate West","locality":"Milton Keynes","region":"","postal_code":"MK9 2DN","country":"United Kingdom","phone":"01908 669526"},{"headquarters":false,"address":"3M Buckley Innovation Centre, Firth St","locality":"Huddersfield","region":"","postal_code":"HD1 3BD","country":"United Kingdom","phone":"01484 290288"}]}