{"id":"290213","name":"Hatimeria","tagline":"E-Commerce development company (Magento, ReactJS)","profile":"/profile/hatimeria","website":"http://www.hatimeria.com","directory":"web-developers","page":"88","verified":"","description":"We are Hatimeria, a Web Development Agency that is specialized in developing e-commerce solutions based on Magento, and we are located in Switzerland, Poland, and The Netherlands.\nWe develop online stores for small and large organizations, and help our clients by providing the following services:\nProjection and technical Project Management for the development of new Webshops based on Magento\nMaintenance of existing Webshops\nMigrations of Magento 1 >> Magento 2\nOngoing development, for example the implementation of ERP systems, and other third-party systems\nDevelopment based on our Headless Single Page Application Front-end, in conjunction with Magento 2 (and WordPress, if requested)\nQA (testing, etc.)\n(Besides, we have partners that offer complementary services, such as, Hosting, UX/UI-Design, E-Commerce Law and Digital Adverting.\nWHY HATIMERIA?\nWe consult you competently, based on years of experience, which helps you achieve your e-commerce goals\nThe in-house development with developers that are mainly in Poland, at our main location, makes our services more cost-effective\nYou get a direct line of communication to our team leaders and developers who are working on your store\nWe take the needs of our clients seriously, and adapt our offerings accordingly. That means, you can focus on your core competencies, and leave the complex development problems to us\nWe know how to attract and keep the best developers on the market, which results in a competitive advantage for both you and us\nWe offer an industry-leading headless single page application front-end. This is a premium solution which allows for increased speed, user experience, security, adaptability, and an easier way of creating an app to your website\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"Undisclosed","locations":[{"headquarters":true,"address":"Radzikowskiego 3","locality":"Kraków","region":"","postal_code":"31-305","country":"Poland","phone":"+48.126.337.149"},{"headquarters":false,"address":"Bahnhofstrasse 9","locality":"Baar","region":"","postal_code":"6340","country":"Switzerland","phone":"+41.33.533.38.83"}]}