{"id":"29167","name":"XIM, Inc.","tagline":"mobile development, web development, smarthome","profile":"/profile/xim","website":"http://ximxim.com","directory":"directory/mobile-application-developers","page":"15","verified":"","description":"XIM, Inc. is an experienced provider of mobile app and web development services.  For over 21 years we have helped businesses to meet the demands of the modern world of information technologies.\nOur headquarters are located in San Francisco. Our 7 development centers are allocated in Belarus and Russia.\nOur team includes specialists from each stage of app creation: skilled developers, talented designers and artists, professional UX/UI designers, experienced QA-engineers, qualified data analysts. Each member of the team collaborates closely with yours to study the business and develop the app you need.\nWe have been successfully collaborating with solid brands like OpenWave Mobility, NOKIA, Intresys, BAI and many others, providing them with high-quality IT services and business solutions.  Our expertise extends to mobile games, business apps, smart home systems applications and other kind of software. \nWhy XIM?\nReliability. With Agile development process, our work is structured and transparent for the clients.\nQuality. We are proud of our happy and satisfied customers.\nSecurity. Any information provided by our customers is under the protection of the U.S law and, thus, is completely safe.\nProfitability. We do a deep app analysis in order to get more revenue.\nPrice. Time & Material contract allows us to offer a competitive pricing structure\nFeel free to contact us via e-mail contact@ximxim.com to discuss any idea you have.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1994","locations":[{"headquarters":true,"address":"400 Beale Street, Suite 103","locality":"San Francisco","region":"CA","postal_code":"94105","country":"United States","phone":"(415) 222-9909"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Belarus","phone":""},{"headquarters":false,"address":"","locality":"Kaluga","region":"","postal_code":"248000","country":"Russia","phone":""}]}