{"id":"294026","name":"Spindogs","tagline":"Your Digital Best Friend","profile":"/profile/spindogs","website":"https://www.spindogs.co.uk","directory":"web-developers","page":"297","verified":"","description":"Since 2004, we have developed a unique team of 27 highly trained creative and technical individuals who love nothing more than creating elegant online solutions backed up by amazing technology.  We love solving problems, developing solutions and coming up with creative and alternative ideas to help our clients. Day in and day out...Digital is our business. We strategise, design and build websites and marketing campaigns that meet our clients objectives and exceed them whenever possible.\nOver the years we have delivered hundreds of digital projects, varying in size and budget, and we always have the same focus on building long lasting relationships with the people that we work with. Before commencing a project we do everything we can to get to know you so that we understand how your online presence will compliment and represent your organisation whilst making sure we can use our experience and expertise to add value and help you achieve your online goals.  Working hard to ensure that we have total alignment from the outset of any new relationship has been the foundation of how we have grown our business. We listen to the needs of our clients and have grown our team based on those needs.  We have seen our support and account management teams grow in size, so that we can ensure our clients get the support they need to become more successful online. We also have a dedicated content team that can work with you to define your audience and tell your story. We are really proud that many of the clients who joined us back in 2004 are still working with us and that over 85% of our work comes from our existing clients. We would love you to join that club! \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"Pascoe House, 54 Bute Street","locality":"Cardiff","region":"GLA","postal_code":"CF10 5AF","country":"United Kingdom","phone":"+44.02920.480720"},{"headquarters":false,"address":"31-35 Kirby Road","locality":"London","region":"LND","postal_code":"EC1N 8TE","country":"United Kingdom","phone":""},{"headquarters":false,"address":"Magdalen Centre The Oxford Science Park","locality":"Oxford","region":"OXF","postal_code":"OX4 4GA","country":"United Kingdom","phone":""}]}