{"id":"294074","name":"Dakota Digital","tagline":"Digital is our DNA.","profile":"/profile/dakota-digital","website":"https://www.dakotadigital.co.uk","directory":"directory/mobile-application-developers","page":"361","verified":"","description":"Welcome to a boutique PR and digital agency that is redefining the concept of online communications. We have produced content for clients including Calpol, Acuvue, Listerine, Neutrogena, Splenda, Compeed, Rogaine, Aveeno, Sudafed and James Haskell. We also work with start-ups and small to medium sized businesses in a range of niches.\nWe help both established and emerging businesses and brands from across Europe, USA and UAE to get the most out of their marketing and brand building endeavours. In an ever innovating world of new technologies and rapidly changing consumer behaviour, Dakota Digital combines cutting edge digital marketing with the ability to captivate through meaningful messaging and killer content production to help our clients truly build their brand and connect with their audience. We specialize in digital channel mastery. Building robust, best in class campaigns which deliver outstanding results for your business through vigorous, intelligent planning and flawless execution. Modern day consumers simply won’t endure the mediocre or the hollow. We help brands to tell their story and share their personality through unique and engaging content creation for the web, social media, advertising and offline needs.Our PR and copywriting prowess is second to none, with client coverage in every major news influencer – from the New York Times to Vogue, TIME, Glamour and GQ to name but a few, alongside all broadsheet and tabloid newspapers in the UK, major TV channels and radio shows. \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2011","locations":[{"headquarters":true,"address":"Suites 4 -5, 6 White Hart Street","locality":"Nottingham","region":"","postal_code":"NG18 1DG","country":"United Kingdom","phone":"+44.1623.428.996"},{"headquarters":false,"address":"","locality":"Sioux Falls","region":"","postal_code":"","country":"United States","phone":""}]}