{"id":"29415","name":"Havas Canada","tagline":"Creating Meaningful Connections","profile":"/profile/havas-canada","website":"http://ca.havas.com","directory":"agencies","page":"9","verified":"","description":"The corporate culture at Havas Canada is built around the talent and engagement of its teams, and is backed by a worldwide network that supports its strategies with international best practices. Today, the agency employes more than 250 professionals working out of offices in Montreal and Toronto. This strength is made possible thanks to our understanding of local realities, as well as the challenges of national and international brands.\nIn June 2016, Havas acquired TP1, a digital agency located in Montreal. With this acquisition, Havas increased its full-service integrated offering in Quebec, with the enhanced digital capabilities of TP1. Founded in Montreal in 2005, TP1 was among the first digital agencies to adapt the agile methodology for the creative and marketing world.\nTen professionals from the Havas Media team round out the Montreal office, enabling us to offer strategy, planning and media purchasing services all under one roof. Dynamic, flexible and always receptive to client needs, Havas Media places digital expertise at the heart everything we do in order to better respond to the changing needs and innovation of brands. Skilled in both traditional media  and digital media, Havas Media focuses on efficiency and relevancy.\nHavas Canada also owns Plastic Mobile, a Toronto-based agency specialized in building applications and developing digital solutions for the mobile market. \nHavas is the sixth largest global communications group in the world. Founded in 1835 in Paris, the Group now employs 19,000 people in over 100 countries. Havas is committed to being the world’s best company at creating meaningful connections between people and brands through creativity, media and innovation. Havas is also the most integrated Group in its sector, with most of its creative and media teams sharing the same premises, the Havas Villages, designed to increase synergies and creativity for all its clients and agencies.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"1986","locations":[{"headquarters":true,"address":"1253, McGill College 3rd floor","locality":"Montreal","region":"QC","postal_code":"H3B 2Y5","country":"Canada","phone":"514-845-7256"},{"headquarters":false,"address":"473 Adelaide Street West, 3rd Floor","locality":"Toronto","region":"ON","postal_code":"M5V 1T1","country":"Canada","phone":"416.920.6864"}]}