{"id":"294203","name":"NB Communication","tagline":"DIGITAL MARKETING AGENCY LERWICK, SHETLAND","profile":"/profile/nb-communication","website":"https://www.nbcommunication.com","directory":"web-designers","page":"598","verified":"","description":"SHETLAND, EDINBURGH AND WORLDWIDE\n\nNB is proud of its Shetland roots, and we have been serving clients successfully in the islands for over a decade and a half. Today, our core team of skilled and highly experienced digital marketing experts is still based in Lerwick. However, our work has been picked up on by organisations out-with the islands, and we now also have an office in Edinburgh, from which we serve a growing number of clients all over Scotland. In addition, we have spent a decade building a worldwide network of specialist experts that we can call upon to deliver the best possible results for every client. NB’s full team offers a formidable range of digital marketing skills, from strategy, planning and project management through to user interface design, HTML/CSS coding, content management system configuration, bespoke programming and integration, testing, and much more besides. This model allows us to achieve a level of quality and sophistication normally only provided from city-based agencies many times our size. Our loyal customer base and incredible client retention levels are a testament to how well this works. (We currently serve over 200 clients, a number which grows steadily every year). Although we choose not to enter industry awards, we are on the Recommended Agencies Register, an industry wide accreditation for creative agencies with a high level of client satisfaction. Furthermore, in 2015 NB was rated as one of the top ten digital agencies in the UK for customer satisfaction in The Drum’s Digital Census.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2002","locations":[{"headquarters":true,"address":"+ Stewart Building, Esplanade","locality":"Lerwick","region":"","postal_code":"ZE1 0LL","country":"United Kingdom","phone":"+44.0.1595.696155"},{"headquarters":false,"address":"CodeBase, 38 Castle Terrace","locality":"Edinburgh","region":"","postal_code":"EH3 9DZ","country":"United Kingdom","phone":"+44.0.131.610.6155"}]}