{"id":"295254","name":"StitchDX","tagline":"Boston Digital Agency","profile":"/profile/stitchdx","website":"https://www.stitchdx.com","directory":"web-designers","page":"385","verified":"","description":"StitchDX is a digital experience agency focused on helping organizations reach and engage all their customer audiences—internal and external. Our brand-first approach delivers services and solutions that help our customers optimize user experience, improve marketing, and leverage technology to achieve high-impact growth goals around customer acquisition and employee engagement. \nOur philosophy is centered on driving engagement and communicating with all stakeholders that propel organizational success. Whether your objectives are focused on driving strategic marketing efforts or improving work management and collaboration, we help organizations navigate the dizzying landscape of technology choices, and leverage the right digital experience platforms for their needs. Our solutions delight and deliver integrated digital experiences that unify company mission, vision, and goals, with action, results, and revenue.\nOur Work \nAn Akumina Gold Partner and HubSpot Silver Certified Agency, StitchDX threads together expertise in brand strategy, digital marketing, lead generation, employee engagement, digital workspaces, content creation, UX/UI design and website development for a diverse client roster including: Arden Building Companies,  Columbia Bank, Destination XL (DXL), ECS Learning Systems, Expertek Systems, Fletcher Spaght, MeTEOR Education, Minuteman Trucks, MoveUP, Rhode Island Council for the Humanities, Thrive Operations, University of Massachusetts – Lowell, and Viacord. \nOur team is passionate about the success of our client partners. We deliver solutions that leverage marketing technology platforms that include HubSpot, Sharpspring, and Pardot, and content management and ecommerce solutions including WordPress, WooCommerce, Magento, Shopify and more. \n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"2 - 9","founded":"Undisclosed","locations":[{"headquarters":true,"address":"116 John St., Suite 410","locality":"Lowell","region":"MA","postal_code":"01852","country":"United States","phone":"800-535-1314"}]}