{"id":"29571","name":"Matellio","tagline":"Mobile & Web Apps Development Company","profile":"/profile/matellio","website":"https://www.matellio.com","directory":"directory/mobile-application-developers","page":"18","verified":"","description":"Matellio LLC is a software engineering studio with a decade-long experience and knack for providing innovative and leading edge software solutions. Our clientele ranges from small startups to large enterprises and corporations across the globe.\nWe are a full-stack engineering team that is driven by zeal to design, develop, and create technology solutions and products. Time and again with our proficient engineering skills and industry expertise, we have developed the state-of-the-art technical solutions that have made a profound impact.\nAt Matellio, we work closely with our customers to utilize our expertise to make a great idea come alive. We emphasize on building a long-term strategic partnership with our clients while taking pride in exceeding their expectations using our in-depth engineering skills, and advanced design aesthetic. Matellio is headquartered in the United States of America (USA) but has a truly global presence including UK, France, and Germany.\nWe are GE Digital Alliance Partner, AWS Network Partner & HPE Silver Technology Partner. Our extraordinary yet simple combination of strategic planning and leading-edge technical understanding has helped us launch a record 500+ successful projects over the past decade.\nWe serve a wide range of verticals including but not limited to:\n• Web application development\n• Mobile application development\n• GIS application development\n• Enterprise application management\n• Embedded solutions\n• IoT\n• Cloud implementation\n• Engineering skills set augmentation\n• Startup and incubation support\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"675 North First Street Suite 1240","locality":"San Jose","region":"CA","postal_code":"95112","country":"United States","phone":"+1.408.675.6740"},{"headquarters":false,"address":"89 Manor Farm Road","locality":"Wembley","region":"MDX","postal_code":"HA0 1BA","country":"United Kingdom","phone":""}]}