{"id":"29998","name":"Molaboo Development","tagline":"Software development, outsourcing services","profile":"/profile/molaboo-development","website":"https://molaboo.com","directory":"directory/mobile-application-developers","page":"39","verified":"","description":"Molaboo Development is a one-stop shop for software development\nMolaboo is a software development company that specializes in outsourced managed services for companies world-wide.\nWe understand what it takes to make good software and how important and business-critical deadlines and IT budgets are.\nWe combine our software development expertise with a deep understanding of real life needs, keeping up with ever-evolving technologies and trends.\nWe're flexible enough to adapt pretty much to any customer and to fit in the tight budgets.\nWe are open to negotiate and agree upon any type of arrangement preferred.  Usually, our engagement models are:\n Turnkey full life-cycle solutions;\n Ongoing development;\n Time and material;\n Fixed quote.\n \nTechnical Background and Experience\nOur technical team has extensive experience with various web frontend technologies.\nMolaboo Development offers high quality software development outsourcing services at a reasonable price. We have an expertise in the following technologies: PHP (mainly WordPress), .Net (C#, ASP.NET, etc), Java (MySQL, Java EE, Java SE), Mobile (Android/IOS/Windows), Python/Django, other (C++, Javascript, JQuery, etc).\nWe have specialists of different profiles on our team, who can provide software architecture, software development, quality assurance, UI/UX design, deployment, support and maintenance, management and communication.\nOver the past years, we have elaborated bullet-proof testing process with thorough QA. Our QA engineers, besides testing manually, automate using Selenium, TestComplete, Apache JMeter, etc.\nNabus became the part of Molaboo since 2018.\nWe are proud to provide highest quality solutions at a reasonable price!\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"","locality":"Kiev","region":"","postal_code":"04073","country":"Ukraine","phone":"+380.445.802.139"}]}