{"id":"30276","name":"Starcode","tagline":"Outsource dev: E-commerce, CRM/ERP, Digital","profile":"/profile/starcode","website":"http://en.starcode.ru","directory":"web-developers","page":"47","verified":"","description":"We offer a custom software development based on the deep analysis of business processes and goals of our clients since 2009. Now Starcode has over 50+ full-time employees in two offices in Russia with an experience of developing a wide range of Digital projects on different markets for such companies as Audi, VW, Renault, Peugeot, Scania, OBI, Philips, Philip Morris, Royal Canin, EKF Electrotechnica.\nWe have already launched over 100 of projects and our solutionsare daily used by millions of people in 12 countries.\nCheck out our Media Kit to see some cases studies.\nAdvantages of partnership with Starcode:\nAccording to growth of EUR and USD currency in comparison to Russian Rouble, contracting us could save a significant part of your budgets in software development;\nOur company has 50+ full-time professionals with strong and relevant experience. We are really demanding in this matter;\nThe customer receives not only a fine team, but also the company's huge experience in IT project implementation;\nYou don't need to take dev's in the staff, so you are saving social taxes, eliminating HR searches and don't think about dev's loading;\nWe have just 1 hour time difference with Central Europe, so we can work online and communicate effectively accoridng your project during the day, which is very important for final result.\nOur technological stack:\nMobile: iOS, Android.\nBack-end: PHP (MVC, OOP, Yii2, Symfony, Laravel, Drupal, WordPress, Bitrix), Java (EE, SE, Spring, JSP), .NET, C#, Python, Node.js\nFront-end: HTML, CSS, JavaScript (jQuery, ExtJS, Backbone.js, Underscore.js, Angular.js, Marionette.js)\nDatabases: MySQL, PostgreSQL, PL/SQL, MSSQL, SQLite\nContact us and we will provide you free evaluation of your project based on our expertise.\nPhone: +7 938 484 11 01\nAgency Email: info@starcode.ru\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"< $25 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Peredovaya st, 32","locality":"Krasnodar","region":"","postal_code":"350020","country":"Russia","phone":"+7.938.484.11.01"}]}