{"id":"30389","name":"Romexsoft","tagline":"Engineering talents to empower your business","profile":"/profile/romexsoft","website":"https://www.romexsoft.com","directory":"it-services","page":"9","verified":"","description":"Romexsoft is a Ukrainian outsourcing provider of cloud and software engineering services with over 15 years of experience in the rapidly growing tech industry. During this time we've developed and successfully delivered more than 100 projects to our clients in Fintech, HealthCare, and Broadcast Media industries.\n \nOur core IT services:\n \nCloud Infrastructure management\nSoftware engineering\nIntegration\nManaged IT Services\n \nWe are obsessed with innovations and their implementation into our processes, so we could provide effectively and market competitive solutions to industry leaders and startups with creative ideas.\n \nAs a part of Managed IT Services, we provide proactive monitoring and maintenance services with flat-rate prices. We not only monitor and maintain your AWS infrastructure but keep it updated and well functioning 24/7/365. \n \nOur company delivers remarkable results, which generate immediate value for your business: \n \nOn-time. \nUp to your specs. \nAccording to the budget.\nAWS certified professionals \n \nWe offer creative, elegant and cost-efficient solutions even for the most complex business problems. By partnering with Romexsoft, you experience the benefits of a high-performing in-house team with no overhead costs involved.\n \nLearn more at romexsoft.com or request a free project estimation.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"7B Naukova St.","locality":"Lviv","region":"","postal_code":"79060","country":"Ukraine","phone":"+44-207-183-92-37"},{"headquarters":false,"address":"1st floor, 14 Bowling Green Lane","locality":"London","region":"","postal_code":"EC1R 0BD","country":"United Kingdom","phone":"+44-207-183-92-37"}]}