{"id":"30481","name":"Softarex Technologies","tagline":"Software outsourcing & custom software development","profile":"/profile/softarex-technologies","website":"http://softarex.com","directory":"web-developers","page":"34","verified":"","description":"Softarex Technologies founded at the dawn of the 21st century in Alexandria, USA, is a software development company, with R&D offices in Minsk, Belarus and Kharkiv, Ukraine.\nAs per Software Magazine 2016 Softarex is among 500 software outsourcing providers in the world.\nOur richest experience has given us a unique perspective to custom software development. Our methodology results in minimal defects in the post-deployment phase and high customer satisfaction. We develop software for following industries:\nHealthcare\nwe have 10+ HIPAA certificates\nFintech\nseveral own products, incl. financial chatbot, 15+ years of extensive experience\nevery day we consult thousands of consumers to make smarter financial decisions\nIoT\nsupport of all major operating systems, incl. embedded and RTOS's\n100 000+ end users are served yearly with our Energy Management System\nWe also have enough knowledge in:\nData Science & Computer Vision\n100+ published scientific articles in Computer Vision\nextensive experience and expertise in implementing Computer Vision algorithms in real-life applications\nour developed solutions are implemented in restaurants chains, sports analytics, healthcare, manufacturing\nMachine Learning\nsolutions for predicting the condition of patients and their needs for treatment and hospitalization in future\nAI-based algorithms for adaptive changes in processing scenarios\nsporting analytical solutions for training US baseball team\ndata analysis for energy sector for prediction utility consumption\n \nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2000","locations":[{"headquarters":true,"address":"177 Nezavisimosti ave.","locality":"Minsk","region":"","postal_code":"220141","country":"Belarus","phone":"+375 17 393 03 56"},{"headquarters":false,"address":"901 N. Pitt Street, Suite 170","locality":"Alexandria","region":"VA","postal_code":"22314","country":"United States","phone":"703.836.18 60"}]}