{"id":"3055","name":"Oxagile","tagline":"Next Gen OTT Solutions Partner","profile":"/profile/oxagile","website":"https://www.oxagile.com","directory":"web-developers","page":"18","verified":"","description":"Since 2005, Oxagile has been tooling up SMEs and high-profile corporations with a skilled engineering talent across all major platforms and tech domains. Today, we are focused on building robust platforms for video streaming, WebRTC, big data, business intelligence, as well as AI-powered computer vision solutions.\nWhat We Do\nCustom Software\nWe provide end-to-end custom software services with a focus on online video management and delivery, adtech, real-time communication, eCommerce, eLearning, big data, and business intelligence.\nOTT 2.0\nVideo-related solutions are the key element of our domain expertise. Throughout the years, we have honed our know-how by working with trusted technology partners and media industry leaders to build state-of-the-art OTT platforms, video conferencing systems, and multi-screen apps.\nR&D and Consulting\nOur robust R&D investigates new technologies, such as programmatic advertising and computer vision, to define the company’s approach to market challenges. Continuous innovation paves the way for the development and QA departments while adding tangible product value.\nOxagile is a Microsoft Gold Certified company, which has been recognized by such industry experts as International Association of Outsourcing Partners (IAOP) in its Global Outsourcing 100 list and Inc Magazine in its Inc 5000 ranking.\nGet a Free Quote at contact@oxagile.com\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"250 - 999","founded":"2005","locations":[{"headquarters":true,"address":"77 Water Street, 8th Floor","locality":"New York","region":"NY","postal_code":"10005","country":"United States","phone":"855.466.9244"},{"headquarters":false,"address":"","locality":"Minsk","region":"","postal_code":"","country":"Belarus","phone":""},{"headquarters":false,"address":"","locality":"London","region":"","postal_code":"","country":"United Kingdom","phone":""}]}