{"id":"30716","name":"Orion eSolutions","tagline":"One Stop for Technology","profile":"/profile/orion-esolutions","website":"http://www.orionesolutions.com","directory":"directory/mobile-application-developers","page":"366","verified":"","description":"Orion eSolution is not only a one stop shop for technology but also a software boutique specialised in development of web applications, mobile apps, desktop application or customization of already built technology upto the par of best practice in the market.\n \nOrion eSolutions was established in 2012 and since the establishment of orion, it has worked on 500+ projects with all size of companies to design, develop and grow their digital product.\nOrion eSolutions is a multi-national company with offices in USA and India. In USA, Orion eSolutions is registered as a Limited Liability Company in the State of Arizona, doing business as Orion eSolutions LLC. In India, we are registered as a Private Limited Company, doing business as Orion eSolutions, with offices in Mohali, Punjab. Our multi location allows us to provide high quality services at an affordable cost.\n \nInnovation and Uniqueness being the key to a winning technology, Orion eSolutions has built a team of most creative minds, bringing simplicity and power to whatever it makes. Our expertise in web and mobile technologies, including Agile and Lean practices, will take your business venture from an idea to reality. Orion eSolutions excels in bridging the “cultural divide” by providing professional engagements to the end clients and shielding them from the complexities of off-shore development. Orion has 100+ Full Time Employees including Senior Software Developers, Project Managers, Front End Developers and Senior System Administrators serving clientele across the world.\n \nIndustries we focus on :-\n* Website development* Desktop application development* Android app development    * IOS app development* Graphic designing* Server management    * Custom app development    * Devops and cloud management\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"E-261, Level 1, Industrial Area, Phase 8B, Industrial Area, Sector 73","locality":"Mohali","region":"PB","postal_code":"160055","country":"India","phone":"1724668170"},{"headquarters":false,"address":"570 E, William Street","locality":"San Jose","region":"CA","postal_code":"95112","country":"United States","phone":"2092574648"}]}