{"id":"30779","name":"Appformation","tagline":"Transfoming ideas into applications","profile":"/profile/appformation","website":"http://appformation.pl","directory":"directory/mobile-application-developers","page":"164","verified":"","description":"We develop business applications for the web, iOS and Android– bringing you flexibility, responsiveness and quality.\n \n \nAppformation is a polish-british company, which provide the highest quality services concerning app development for startups and businesses. We like to be there for our customers - and with our headquarters in Wroclaw, Poland and a sales office just outside London, we’re handily placed for businesses across Europe.\nWe have a great team of professional experienced in mobile technologies (iOS and Android) and Web technologies such as PHP, Python, JavaScript frameworks like AngularJS and many more.\n \nMobile technologies\nWe help you prepare a business case for your new app. Understanding your market, drafting the project specification, developing a visual identity and planning the launch – these are only a few of the ways in which we add value to your investment. From day one, you benefit from our experience, our responsiveness and our single-minded attention to detail.\n \nWEB technologies\nYou expect cutting-edge technology, delivered by highly skilled developers, designers and project managers. So do we. We select the right tools for your project; you get an app that looks great, makes life easy for the user and works exceptionally well.\n \nTesting\nOur product testing is completed in-house, not on your users. You’ll see that at every step of the project, we make time for automated testing and peer review; for us, exceptional quality isn’t optional. It’s one of the reasons our customers rate us so highly; when it comes to meeting expectations, we know that while cost is important, quality is essential. Work with us and you’ll notice the difference.\n \n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2014","locations":[{"headquarters":true,"address":"Aleja Jarzębinowa 24/26","locality":"Wrocław","region":"DO","postal_code":"53-120","country":"Poland","phone":"+44 (0) 118 336"},{"headquarters":false,"address":"1 Paddock Road","locality":"Reading","region":"BRK","postal_code":"RG4 5BY","country":"United Kingdom","phone":""}]}