{"id":"30846","name":"Rademade","tagline":"We bring your ideas to life!","profile":"/profile/rademade","website":"https://rademade.com","directory":"directory/mobile-application-developers","page":"37","verified":"","description":"Discuss. Think. Analyze. Design. Develop. Test. Care. Improve. It is important.\nRademade custom software development company creates and develops IT solutions that contribute to the success of customers' business from around the world. We provide a full range of services for consumer apps and business apps (Web/Mobile) development, as well as CRM, ERP systems and Online Marketplaces.\nOur team consists of the best specialists in Web App Development, Mobile App Development, application integration, strategic and technological consulting, testing, software maintenance, and support.\nRademade' clients have at their disposal professionals with system' thinking and a creative approach, as well as a wide range of Ruby, AngularJS, Node.js, jQuery, HTML5, CSS3, PhoneGap and other technologies. And within the team, there are effective debugged project management methodologies, in particular, Scrum. Therefore, we are absolutely confident in the functionality and reliability of each of the completed projects and thorough quality control.\nOur turnkey software solutions work successfully in the Fintech, Healthcare, E-Commerce, Trading, Food delivery, Legal Tech, Security, Travel, Blockchain, and some other industries and bring tangible profits to their customers. Consider that our company prefers to include projects in our portfolio and develop their skills, the better it will be made.\nWe communicate in English, and despite the time, we are very responsive. So if you have any questions or want to discuss cooperation, just email us on welcome@rademade.com.\nTechnologies: Ruby, Ruby on Rails, React Native, Elixir, AngularJS, Node.js, Backbone.js, Ember.js, CoffeeScript, jQuery, HTML5, CSS3, SASS, Stylus, Rupture, Jade, Bootstrap, PhoneGap\nSpecialties: Web App Development, Mobile App Development, UX/UI Design, Project Maintenance, Consulting services\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2011","locations":[{"headquarters":true,"address":"31B, Spaska St","locality":"Kyiv","region":"","postal_code":"04070","country":"Ukraine","phone":"+380 (44) 333 47 80"},{"headquarters":false,"address":"4433 Merlin Way","locality":"Soquel","region":"CA","postal_code":"95073","country":"United States","phone":"+1 (650) 996 2875"}]}