{"id":"30856","name":"Lift Interactive Inc.","tagline":"Unleash new potential: start digital.","profile":"/profile/lift-interactive","website":"https://liftinteractive.com","directory":"web-designers","page":"5","verified":"","description":"Recognized as one of the top creative agencies in Canada, Lift is a talented and tightly-knit group of designers, strategists, and technologists. Our specialties lie in brand identity development, user-centred design, web development and online strategy and marketing. Our objective is to always push pass ordinary as we craft noticeably simple, elegant, and ultimately usable digital experiences and brands.\n\nDuring our 15 years, Lift has been the recipient of multiple awards and accolades both for our growth as a business as well as for our skills as designers and developers. Our own web presence, along with some we’ve created for clients, have been recognized on an international scale for design and use of modern web technologies.\nLift has a proven track record of delivering innovative and meaningful projects that get noticed. We are driven to create work that we can look back on with pride and a sense of accomplishment. That goes beyond just a good visual design and extends to the experience. If it looks good but doesn’t work, it’s not a success in our books.\nWe solve problems, define strategies, and design and implement solutions. Whether you need to develop your brand identity and visual communications, enhance or establish your online web presence, or rethink your strategic approach to the ever expanding online ecosystem, we can help.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2002","locations":[{"headquarters":true,"address":"10139 81 Avenue NW","locality":"Edmonton","region":"","postal_code":"T6E 1W9","country":"Canada","phone":"780.426.1176"},{"headquarters":false,"address":"","locality":"Calgary","region":"AB","postal_code":"","country":"Canada","phone":""}]}