{"id":"32002","name":"Sannacode","tagline":"Mobile, Web, IoT, Business Analysis, UI/UX, QA","profile":"/profile/sannacode","website":"http://www.sannacode.com","directory":"directory/mobile-application-developers","page":"18","verified":"","description":"We make web and mobile products that meet demand and exceed expectations. With expertise in every step of the creation process, our team has the talent and focus to create customized solutions that fit your needs. We are specializing in Android, iOS, Unity, Web (front- and back-end) development and IoT & Embedded solutions.\nWe work in deep collaboration with our Clients, making research, strategy and business analysis, UI/UX and graphic design, development, quality assurance and deployment as well as maintenance services.\nOur specialists have working experience with complicated projects for such companies as Avid, Samsung, Telcordia, Ericsson, Kyivstar, Chrysler, Digi, PocketBook, Bebar, PwC and much more other great clients.  We will bring all the best holding expertise to your products.\nDifferent size companies and persons are equally important for us.\nOur Services:\nAndroid and iOS mobile apps development\nFull-stack web development\nQuality assurance and testing\nUI/UX and graphic design\nSupport and maintenance\nResearch\nBusiness analysis\nProject management\nWe can source talents to work with the technologies you need if it occurs we don't have already some. Sannacode looks up for the qualified candidates on your demand in the areas of software and hardware development.\nOur passionate recruiting team has the capability to explore a wide range of existing contacts and engage the perfect engineer in the development of your project.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2013","locations":[{"headquarters":true,"address":"86 Kazimira Malevicha","locality":"Kyiv","region":"","postal_code":"03680","country":"Ukraine","phone":"+380663195993"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Ukraine","phone":""}]}