{"id":"32624","name":"Vitamin Group","tagline":"Mobile apps. Websites. Explainer videos.","profile":"/profile/vitamin-group","website":"http://www.vitamin-group.com","directory":"directory/mobile-application-developers","page":"183","verified":"","description":"We are Vitamin Group – a team of 30, working for global brands from Perm, industrial Russian city. Established in 2005, we've been working hard in digital production to reach the level we can be proud of. Startups, digital agencies and enterprises worldwide choose our cost effective digital development.\nWe love to create value in three areas of specialization:\n— Web & Product Development\nFrom landing pages and promo sites to corporate portals and adaptive multiplatform web projects – our team develops with customers in mind, focusing on user experience. We ensure that all our websites work on a wide array of operating systems, browsers and devices. We work using PHP, MySQL, Javascript and HTML5/CSS3.\n— Mobile & Multiplatform Apps\nA skilled team of iOS and Android developers will design, develop and deliver an app that reaches customers and brings them a new experience. We develop native and hybrid apps to engage consumers effectively across devices.\n— Explainer Video\nAn explainer video is a perfect presentation tool for any product or service. We specialize not only in production but work with initial project briefs, concept development, script writing, storyboarding and execution of the final product. Our in-house post-production capabilities include character animation, 2D/3D animation, compositing, CGI, product demos, trailers and more. Watch video to learn more.\nWhy is our production cost-effective? Because we are a regional agency, so an average salary is lower that in Moscow, for example. But the quality still stays high. We guarantee. \nCheck out our portfolio on behance and digital showreel.\nWe will be happy to work with you.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2005","locations":[{"headquarters":true,"address":"Reshetnikovskiy spusk 1, Office 9","locality":"Perm","region":"PER","postal_code":"614000","country":"Russia","phone":"+7.499.995.12.26"}]}