{"id":"33487","name":"SITSL","tagline":"A Global CMMI Level 3 Appraised Company","profile":"/profile/sitsl","website":"https://www.sitsl.io","directory":"directory/mobile-application-developers","page":"33","verified":"","description":"SITSL is a global CMMI Level 3 Appraised, IT Solutions Integrator Cum Consultancy Company having a presence in over 16 countries.\nOur leading-edge and creative digital services have encapsulated numerous awards, appreciations and have ubiquitous coverage in a distinctly short span of period.\nOur clientele comes from nearly every part of the globe and involves small startups to large-scale enterprises and government organizations such as Coca-Cola and UNICEF. Their requirements also differ from mobile app & web development to Artificial intelligence, BI, data analytics, IoT, and chatbots.\nSubtle presence in 13 countries (5 Continents) empowers us with exceptional responsive capabilities to all our clients regardless of their locations. Our clientele prefers us for winsome UX/UI, flawless performance, and effective communication. Here's what they say about us:\n\"Thank you so much for getting it done Shubhashish. With the App you've built, the tracking and monitoring of AADs have certainly become effortless.\"- Coca-Cola\n\"The application remarkably improves the quality, effectiveness, and timeliness of the delivery of quality services, specifically to rural populations, to ensure better healthcare for women and children.\"- UNICEF\nOur Core Offerings:\nMobility (iOS & Android)\nFull-Stack Development (Web)\nBlockchain, Business Intelligence\nArtificial Intelligence\nData Analytics\nCloud Computing\nSalesforce\nChatbots\nCyber Security\nInternet of Things (IoT)\nSITSL develops prolific, smart, and next-gen software solutions that solve your actual business problems, no matter how trivial or significant it is.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2015","locations":[{"headquarters":true,"address":"10685-B Hazelhurst Dr. # 20096","locality":"Houston","region":"TX","postal_code":"77043","country":"United States","phone":"1-877-693-6033"},{"headquarters":false,"address":"Shubhashish Corporate Tower 12-13 Rathore Nagar, Queens Rd, Vaishali Nagar","locality":"Jaipur","region":"RJ","postal_code":"302021","country":"India","phone":""}]}