{"id":"33526","name":"Future Mind","tagline":"Building reliable web and mobile products","profile":"/profile/future-mind","website":"https://www.futuremind.com","directory":"directory/mobile-application-developers","page":"13","verified":"","description":"We’d love to develop your mobile or web project from the ground up or join your team when you need us\nIn 2008, we set out to build a company that was focused on using every opportunity to create something of value. Today, after having completed over 100 projects and employing several dozen people (iOS, Android, Python, Node.js developers), we continually strive at fulfilling that goal.\nFrom the outset, our focus is on taking your idea and making it a reality. The process begins with workshops, where specifications are set out and expectations established, leading to the creation of prototypes, where we gather opinions from users. With that set, a complete development team is assembled, parameters of the project established, and work started. Upon completion, we work to refine the product, based on user feedback and analysis, and ensure a high level of quality through long-term maintenance and updates.\nSmart development team would be enough?\nOur project management experience and dedicated full-stack team, ensures that we’re flexible enough to jump into and accommodate the specific needs of your project at any point. Whether that be assisting with design, development, management, or testing, we can help!\nHere’s a look at just some of the industries and fields we’ve worked in:\nTelematics, Finance, Social media, Telecommunications, Helthcare, Services, E-commerce, Electronics, Video communication, Transportation, Education, FMCG, Real estate, Security, Entertainment, Games, Travel\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"Puławska 182","locality":"Warsaw","region":"","postal_code":"02-670","country":"Poland","phone":"+48 22 253 38 31"},{"headquarters":false,"address":"Owczarska 9","locality":"Tychy","region":"","postal_code":"43-100","country":"Poland","phone":""}]}