{"id":"34244","name":"Appy Monkey","tagline":"London App Developers","profile":"/profile/appy-monkey","website":"http://www.appymonkey.com","directory":"directory/mobile-application-developers","page":"18","verified":"","description":"Appy Monkey is a company made up of amazing Mobile App Developers. The headquarters is based in London and we are a fresh & vibrant mobile application development studio based in the UK with other offices in Newcastle and Manchester (New). We are very proud of the creative team that we have put together and with years of experience in a wide variety of different app projects.\nAll of our team members are extremely passionate about designing, developing and managing stunning smart phone Apps\nOur approach is like no other and from the very moment that you get in contact with us you will feel like we actually care about your project and what it takes to get it done right for you. \nInitially we will strategically plan and design your app before moving on to the UX/UI and wire framing stage. We them implement everything from front-end development, integrate back-end management, test, tweak and improve all the attributes until its perfect. We have now an impressive proven record of delivering Project after Project – On time, On Budget and On Point! \nOur Experienced Team members come from a number of different skill sets including but not limited to iOS, Android & Windows developers, mobile web developers, designers, user interface (UX/UI) experts, marketing creatives, video producers, content writers, ASO consultants, project managers and business directors. \nWe create apps for multi-platform devices including the iphone, ipad, android, windows phone and MORE. We have produced some stunning apps over the years and our portfolio will stand up against any other competitor out there.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"0ne Mayfair Place","locality":"London","region":"LND","postal_code":"W1J 8AJ","country":"United Kingdom","phone":"07776 131313"}]}