{"id":"34381","name":"Myplanet","tagline":"Inspire wonder. Inspire purpose. Work, inspired.","profile":"/profile/myplanet","website":"https://www.myplanet.com","directory":"web-developers","page":"16","verified":"","description":"Myplanet is a software studio. We make smarter interfaces for the workplace that empower employees and engage customers, combining strategy, design, and development to bring end-to-end experiences to life.\nAs an integrated team of designers and developers, we implement leading software platforms for the world’s most influential companies including Cisco, Google, New Balance, and Warner Music.\nDesktop and mobile are just the start— we work across interfaces to help you meet your users where they are, building experiences for IoT, wearables, AR/VR, and CUI, as well as traditional web-based interactions. We focus on making everyday experiences more enjoyable, specializing in employee tools, workplace products, and marketing and commerce platforms.\n“Having worked with the Myplanet team in the past, I trusted their ability to craft the right experience for our customers and to empower my team with world-class marketing technology,” says Shoretel CMO Mark Roberts. “And they delivered.”\nOur work has global reach, with international partners in the US, Europe, and beyond. Myplanet is also B Corp certified. We'd love to hear more about your project and how we can lend a hand. Get in touch.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2009","locations":[{"headquarters":true,"address":"252 Adelaide Street East","locality":"Toronto","region":"ON","postal_code":"M5A 1N1","country":"Canada","phone":"1-866-232-7456"},{"headquarters":false,"address":"155 North Wacker Drive","locality":"Chicago","region":"IL","postal_code":"60606","country":"United States","phone":"1-866-232-7456"},{"headquarters":false,"address":"312-510 West Hastings","locality":"Vancouver","region":"BC","postal_code":"V6B 1L8","country":"Canada","phone":"1-866-232-7456"}]}