{"id":"35322","name":"Major Tom","tagline":"Find clarity in chaos.","profile":"/profile/major-tom","website":"https://www.majortom.com","directory":"web-developers","page":"33","verified":"","description":"Major Tom is full-service digital agency that’s been purpose-built to help organizations thrive in an increasingly complex landscape. \nOur industry-leading specialists have been hand-picked from across the globe. We’ve been serving our partners from our offices in New York, Toronto, and Vancouver since 2000. We combine the top-level strategy you’d find at an established consultancy with the implementation and technological capabilities you’d find at a leading agency.\nMade up of some of the brightest minds on the web, we humanize modern marketing, cutting through the noise to bring clarity to our clients.\nThe marketing landscape is constantly evolving. Every day there are new technologies, new opportunities, and new tactics you can employ to engage with your audience.\nBut knowing where to be and how to act can be overwhelming – being everything to everyone isn’t always the answer. Instead, the key is to change perspective. To take a step back and look at the bigger picture.\nWe believe in focus. In cutting through the noise to find clarity.\nIt’s about doing the right thing, not just anything. We work to understand the entire scope of an organization so that we can not only recommend the right solutions, but implement them consistently across all mediums.\nBy taking a strategic approach we’re able to help organizations see the whole forest before picking the right trees: identifying the channels, tactics, and technologies that will drive your business forward.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2000","locations":[{"headquarters":true,"address":"434 West 33rd Street, #841","locality":"New York","region":"NY","postal_code":"10001","country":"United States","phone":"+1 212 603 9667"},{"headquarters":false,"address":"801 - 317 Adelaide St W","locality":"Toronto","region":"ON","postal_code":"M5V 1P9","country":"Canada","phone":"+1 416 892 6767"},{"headquarters":false,"address":"548 Beatty St","locality":"Vancover","region":"BC","postal_code":"V6B 2L3","country":"Canada","phone":"+1 604 642 6765"}]}