{"id":"35388","name":"Codiant Software Technologies Private Limited","tagline":"Mobile App Development Company","profile":"/profile/codiant-software-technologies-private","website":"https://www.codiant.com","directory":"directory/mobile-application-developers","page":"18","verified":"","description":"Codiant is “a revolution, a reliable partner, responsible service provider, loyal friend, and your inspiration” that has donned a big feather for world-class Mobile App and Web App Development, UI/UX Development, Enterprise Mobility Solutions, and Application Maintenance Services across various platforms.\nWith a strong global presence in the USA, UK, Australia and India, Codiant is hailed as the most sought after company in the mobile app development space that pillars the disruptive ideas of startups, SMEs and large organizations with our skilled team of mobility and web experts that pursue strong expertise in diverse industry verticals including Healthcare & Telemedicine, Fitness, Travel & tourism, Ecommerce and Mcommerce, On-demand App Solutions, Insurance, Social networking, , Digital Wallets, Crypto currency, Bit Coin, Augmented Reality and Artificial Intelligence, Big Data and iOT and other globally changing industries.\nGet in touch with us on Skype: vikrantkjain\nVisit us at: www.codiant.com\nQUICK INSIGHTS\nAverage hourly rate: $15+ depends on size and complexities involved.\nNumber of employees: 250+\nISO 9001:2008 and ISO/IEC 27001:2013 certified company.\nProspective clients: Startups, small to mid-size enterprises, large organizations.\nPopular apps: Careclix, SIX, TaxiApp UK, GandhiStreet, Groopylife, Fantopias, Connect, Fourwalls.\nCompany Products: TaxiWheel, Grofee, XpertChats, TeleDocto, Chuzee, TaxiOnGo.\nAchieved 100% success rate on Upwork, as counted by client’s satisfaction and on-time delivery of projects.\nMultiple centers of technology innovation and excellence.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2010","locations":[{"headquarters":true,"address":"455 Avenue of the Cities","locality":"East Moline","region":"IL","postal_code":"61244","country":"United States","phone":"+1-3092780633"},{"headquarters":false,"address":"101, Bansi Trade Center, 581/5 MG Road","locality":"Indore","region":"","postal_code":"452001","country":"India","phone":"0731-4291704"},{"headquarters":false,"address":"3 St Helen’s Place","locality":"London","region":"","postal_code":"EC3A 6AB","country":"United Kingdom","phone":""},{"headquarters":false,"address":"Suite 701, Level 7, 171 Clarence Street,","locality":"Sydney","region":"NSW","postal_code":"2000","country":"Australia","phone":""}]}