{"id":"35382","name":"Glorium Technologies","tagline":"Digital healthcare product development","profile":"/profile/glorium-technologies","website":"http://gloriumtech.com","directory":"directory/mobile-application-developers","page":"77","verified":"","description":"Glorium Technologies is the first healthcare-focused full-cycle app and software development company. Since the year 2010 Glorium helps digital health companies bring their new software products to market or add new features to the existing ones - all while reducing their development budget by providing resources from our development centers based in Ukraine and Belarus.\nSome of the projects include EHR/EMR/HIS systems and its modules, HL7 integrations, DICOM/PACS imaging, chronic disease management and diagnostic platforms, analytics and dashboard solutions, telemedicine, devices connectivity and more.\nThe technology stack for the applications developed includes over 70 frameworks/technologies like .NET, Angular, JavaScript, ExtJS, iOS, Swift, MySQL, CSS,  PHP, Xamarin, ASP Core, PostgreSQL, Ruby, Ruby on Rails, Unity, AWS, GCP, Azure, Android, ReactJS, NodeJS, Express, ElasticSearch, Microsoft SQL Server, ASP.NET, MVC, Angular Material, Java, Stripe JS and more.\nWhat makes us different?\nWe focus solely on the healthcare industry and know how to deal with HL7, CHI, FHIR, HIPAA, HITECH, DICOM, NCPDP, LOINC, UMLS, ANSI, FDA, EMA, MU along with any other healthcare-specific standards/formats/regulations.\nStart with a small pilot project to minimize risk and develop trust before we jump into a long-term engagement.\nNo charge for professional project management, it's on us.\nProduct advice based on our experience and background.\nAgile approach with proper Scrum, this means frequent deliveries of your product to see the progress.\nThe dedicated project team, no out-of-the-blue people replacement.\nTop-notch UX/UI by having the business analyst and designer to work together on your product.\nFull transparency by sharing the project management and code repository tools with your team.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2010","locations":[{"headquarters":true,"address":"300 Craig Rd, Ste 215","locality":"Manalapan","region":"NJ","postal_code":"07726","country":"United States","phone":"888.354.0883"}]}