{"id":"35422","name":"Cybercom Group","tagline":"software house with Swedish roots & agile approach","profile":"/profile/cybercom-group","website":"http://www.cybercom.com","directory":"directory/mobile-application-developers","page":"24","verified":"","description":"Cybercom is a multinational company consisting of over 1200 people. We are proud to employ over 300 software engineers in Poland (Łódź and Warsaw) and 1000 talented people working for us around the globe. As an agile technology company we work within the Automotive, Telecom R&D and Digital industries. We are thrilled to be able to change the world by leading innovation within the Industrial sector by means of IoT.\nBy delivering custom, cutting edge solutions to our clients worldwide, we help shape the reality around us. We are influencers when it comes to the ways society communicates, works and experiences the world. As contributors to the Smart Society, we (modestly) like to think of ourselves as game changers. Most of all, we use our core values of trust, honesty and integrity to govern our business.\n \nWe are also an agile software house focused around .NET, Java/JEE and mobile technology. Our Polish team consists of over 200 people including developers, agile people, QA (manual and automatic), business architects and advisors.\n\nOur Swedish roots combined with Polish expertise and technical know-how guarantee optimal results in delivering cutting edge solutions. While we use Swedish best practices to exceed expectations and provide impeccable quality, we maintain our Polish pricing and geeky attitude.\nAgile is how we run our business. It affects our decisions and ways of dealing with problems. We adapt and change quickly, using agile methodology to move things forward faster and more efficiently for a better customer experience.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"250 - 999","founded":"1997","locations":[{"headquarters":true,"address":"Hrubieszowska 2","locality":"Warsaw","region":"","postal_code":"01-209","country":"Poland","phone":"+48 607 676 766"},{"headquarters":false,"address":"","locality":"Stockholm","region":"","postal_code":"111 21","country":"Sweden","phone":""},{"headquarters":false,"address":"","locality":"Tampere","region":"","postal_code":"33100","country":"Finland","phone":""},{"headquarters":false,"address":"","locality":"Helsinki","region":"","postal_code":"00100","country":"Finland","phone":""},{"headquarters":false,"address":"","locality":"Gothenburg","region":"","postal_code":"411 01","country":"Sweden","phone":""},{"headquarters":false,"address":"","locality":"Lodz","region":"","postal_code":"31-535","country":"Poland","phone":""},{"headquarters":false,"address":"","locality":"Bydgoszcz","region":"","postal_code":"61-052","country":"Poland","phone":""}]}