{"id":"35465","name":"Charu Interactive, Inc.","tagline":"Be Found | Be Known | Be Visible | Be Relevant","profile":"/profile/charu-interactive","website":"http://charuinteractive.com","directory":"web-designers","page":"105","verified":"","description":"Charu Interactive opened the doors 2013 in Chicago.  We have a full range of digital marketing services.  \nWe are a digital marketing agency that focuses on quality service for a limited amount of clients. Our value proposition is that we have a highly experienced, creative and talented digital marketing team that focuses a large part of their daily routines on our client's needs and goals.  \nWhen you hire Charu as your full service digital marketing firm, you are essentially hiring your own digital marketing department.  We basically become an extension to your company, following your mission and vision of your company.  We are not just another greedy SEO or online marketing firm that tries to get as many clients as possible as fast as possible and after some decent SEO work hope that some stick around.   For us, integrity and results is what we want our clients to remember us by and what we want to be known for.\nWhile we don't like to offer services standalone (but rather as recommended combined solutions to reach specific KPI goals), some of the core services we offer to our clients are:\n- Search Engine Optimization\n- Google Compliance\n- Online Reputation Management\n- Pay Per Click Optimization\n- Local Listing Management\n- Local SEO\n- Social Media Marketing\n- Social Media Advertising Optimization\n- Display Awareness\n- Display Retargeting\n- Website design (wordpress)\n- Website management, hosting and security (wordpress)\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"1765 N Elston Ave","locality":"Chicago","region":"IL","postal_code":"60643","country":"United States","phone":"773.715.1483"}]}