{"id":"35695","name":"ToXSL Technologies Pvt Ltd","tagline":"Leading Towards Excellence!","profile":"/profile/toxsl-technologies","website":"https://toxsl.com","directory":"directory/mobile-application-developers","page":"10","verified":"","description":"ToXSL Technologies is one of the most renowned Web and Mobile App Development company in India. Incorporated in the year 2012, we are an ISO:9001:2015 certified Software Development company and an official member of NASSCOM. We take great pride in our wide client base across the globe and gaining their trust has made us popular in the world.\nWe deal with a wide range of latest web and mobile app development services, namely- Web and Mobile App Development Services, Web Development Frameworks, ERP Software Development, Automation Testing, Website Designing, Digital Marketing, IOT, Artificial Intelligence(AI), and Internet of Things.\nWe have been providing our best-featured services to foster the growth of our clients. We are a community of experts who have in-depth knowledge of the latest technologies and trends practiced in the mobile app development sector. Having served more than 1300 clients worldwide and successfully delivering 1800+ projects. We have a team of 200+ employees who work with determination for the company's growth and help in turning client's expectations into reality. We are a proud award winning company and have been recognized for our efficient work by NASSCOM, Clutch and GoodFirms. We move forward with an objective to help our clients by offering the best web and mobile solutions. \nWe understand the client's business needs and offer genuine services to suffice their all kind of requirements. From startups to large businesses, we lend our services to all business segments and offer affordable services. \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"Phase 8, Industrial Area, Sector 72","locality":"Mohali","region":"","postal_code":"160072","country":"India","phone":"+919569747788"},{"headquarters":false,"address":"Phase 8, Industrial Area, Sector 72","locality":"Mohali","region":"","postal_code":"160072","country":"India","phone":""},{"headquarters":false,"address":"Phase 8, Industrial Area, Sector 72","locality":"Pathankot","region":"","postal_code":"160072","country":"India","phone":""},{"headquarters":false,"address":"Phase 8, Industrial Area, Sector 72","locality":"Yamunanagar","region":"","postal_code":"160072","country":"India","phone":""}]}