{"id":"35779","name":"Deep Core Data","tagline":"Human-focused IT for growing companies","profile":"/profile/deep-core-data","website":"http://www.deepcoredata.com","directory":"it-services","page":"222","verified":"","description":"Since 2014, Deep Core Data has been using technology to improve the lives of business leaders, employees, and consumers. Unlike many other IT providers out there, we believe that hardware and software solutions are not goals, but rather tools to help humans create an effective and meaningful work environment. We make it our mission to provide the education, services, and products you need to feel comfortable and fully in control of your company.\nWe are based just outside of Boston in Waltham, MA, though we help businesses around the country, as well as internationally.\n \nOur Services\nOn-call and Emergency Support\nTechnical Support\nTicketing systems, email support, and off-hours staffing\nData Recovery\nEmergency response to hacking, ransomware, power outages, and data corruption\nDisaster Prevention\nServer security, network and power redundancy, disaster and recovery protocols\n \nNetwork and Managed Services\nEmail and Software Setups\nConsolidate and convert your current business technology to enterprise-level suites\nClouding/Unclouding\nBackups and secure data transfer\nServer Migration and Hosting\nTake advantage of our safe and controlled data center storage\n \nEffective Workflow Scaling\nProcess Automation\nData entry, management, and computations\nCustom Software Development\nFrom web portals to employee management programs and VPN environments\nDatabase Development & Administration\nGet more value from your data with scalable, clean, and intuitive databases\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2014","locations":[{"headquarters":true,"address":"24 Crescent St","locality":"Boston","region":"MA","postal_code":"02454","country":"United States","phone":"1-844-567-3100"}]}