{"id":"35912","name":"Leale Solutions","tagline":"Full Service Digital Solutions Provider","profile":"/profile/leale-solutions","website":"http://lealesolutions.com","directory":"directory/mobile-application-developers","page":"63","verified":"","description":"Leale Solutions is a Florida based Software Development firm. Leale Solutions is a collection of lifetime technologists that specialize in \"business to geek\" translation. This means that we take pride in translating the desires of the project stakeholders to the managers and developers that actually perform the implementations. We are a full service software development firm. This means that we are full lifecycle.\nWe understand and will communicate the entire process and full requirements from hardware or cloud needs to custom component or Github components to QA and UAT testing and appstore deployment if needed. We have the experience to give you the full picture of what your software solution will entail. Right from the start. We are there for you everystep of the way. We have expertise specializing in Mobile Development using Xamarin, now a Microsoft product. We generally use the Microsoft stack for Enterprise Development, Business Intelligence and Reporting.  We have provided innovative solutions for the Financial, Insurance and Retail industries for more than a decade.  We cater to large and small businesses through various industries. Please consider contacting us to discuss your challenges and concerns. While no two problems are exact, we have seen many variations in our decades of experience in the indusrty. \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"2200 NW Corp Blvd, Ste 404","locality":"Boca Raton","region":"FL","postal_code":"33431","country":"United States","phone":"561.600.0470"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Ukraine","phone":""}]}