{"id":"36098","name":"Codedose","tagline":"Bespoke software experts and Java consultants.","profile":"/profile/codedose","website":"http://www.codedose.com","directory":"web-developers","page":"114","verified":"","description":"About us:\nWe are a boutique software house specialising in building bespoke solutions and integration systems for clients located in the Western Europe and the US. Our development centre is located in the beatiful city of Wroclaw, Poland.\nOur long standing vision is to apply software solutions to resolve real-world business problems with top-notch technology choices.\nWhy CODEDOSE?\nSolid track record of delivering complex software projects\nComprehensive service starting from analysis to deployment and support\nAgile development approach with SCRUM\nAffordable rates at nearshore location\nOur services:\nCustom software solutions\nNearshore outsourcing of Java developers\nBig data, data analytics and grid computing solutions\nSalesforce integrations and custom solutions\nWe are certified MuleSoft (Mule ESB) developers\nCooperation models:\nProject team: we build and manage the project team to execute your project\nStaff augmentation: our developers join your team led by your technical manager\nThe rules are simple:\nYou can build or extend your software team with experienced developers at affordable rates\nWe usually start with a few days on-site visit to kick off the project\nNo time wasted on recruitment and training, we are ready to jump into your project\nAll developers have excellent English communication skills\nDaily Skype and IM make your team work together\nTransparent cooperation terms: daily rate, NDA agreement, satisfaction guarantee, no lock-ins\n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"Łaciarska 4","locality":"Wrocław","region":"","postal_code":"50-104","country":"Poland","phone":"+44 (0) 20 3322 8684"}]}