{"id":"37276","name":"MAGNETIC Global","tagline":"Global Branding & Consumer Engagement Agency","profile":"/profile/magnetic-global","website":"https://www.magneticcreative.com","directory":"web-designers","page":"26","verified":"","description":"We are a Global Branding and Consumer Engagement Agency focused on creating authentic relationships for brands. \nWe leverage brand intelligence to develop meaningful content and engage people with actionable brand experiences that spark human connection. Turning stories into conversations, impressions into relationships and campaigns into results. Our proven methodology is agnostic to industry, product, service or individual.\nWe partner with companies to bring clarity to their brand, offering, and customers in order to build a personalized marketing plan and foster genuine customer experiences.\nGlobal Branding & Marketing with Local Expertise\nMAGNETIC has offices in North America, EMEA, and APAC. Our team has specific experience bringing brands to market in the US from other regions as well as extending brand presence from the US into rest of world. \n \nWhile our teams employ big business strategy for global brands, we simultaneously focus our attention on local branding and advertising. This approach enables us to strategically position, market, and win for brands of all sizes. \nPeople Buy Brands, not Products\nWe believe people buy brands not products/services and we focus on creating and building relationships with customers. B2B, B2C, B2G, and most importantly human to human. \nArtists, Strategists, and Makers\nWe Are... Adventure Seekers. Brand Builders. Strategic Thinkers. Content Creators. Creative Monsters. Technology Whisperers. Horizon Chasers. Truth Finders. Straight Shooters. And Genuine Down to Earth Folks. Sound like your kind of tribe? Let’s create something amazing together.\n#MAGfam\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"41955 4th St. Suite 300","locality":"Temecula","region":"CA","postal_code":"92590","country":"United States","phone":"+1.951.506.7662"},{"headquarters":false,"address":"Shop 6 Mount Joy Corner - 2 Main Road","locality":"Knysna","region":"","postal_code":"6571","country":"South Africa","phone":"+27.044.382.0565"},{"headquarters":false,"address":"2580 E Harmony Rd","locality":"Fort Collins","region":"CO","postal_code":"80528","country":"United States","phone":"(858) 602.8186"}]}