{"id":"37605","name":"VRP Consulting","tagline":"Consultants with a passion for Salesforce","profile":"/profile/vrp-consulting","website":"https://vrpconsulting.com","directory":"it-services","page":"9","verified":"","description":"Consultants with a passion for all things Salesforce.\nWe are VRP Consulting. A global full-service Salesforce consulting, development and outsourcing partner delivering across the entire Salesforce platform. With over 500 people, across 12 offices in 8 countries, we think globally and deliver locally.\nVRP Consulting has provided consulting and application development services since 1998 to clients ranging in size from SMB to large enterprise. Since 2008 we have been fully focused on the Salesforce platform, successfully delivering over 1,000 projects.\nAs both a Silver Partner and Product Development Outsourcer (PDO) we are one of the few Salesforce partners to have the technical scale and expertise to design and deliver both core Salesforce implementations and AppExchange applications.\nToday, we are at the forefront of the digital transformation wave, empowering our clients to innovate more rapidly, maximize business productivity, and optimize customer engagement — delivering business outcomes that move markets.\nConsulting\nOur local CTA-inspired architecture and consulting teams work hand-in-hand with business stakeholders to create achievable roadmaps, deliver incremental benefits and maximise the value of Salesforce investments. We have the technical excellence and experience of delivering solutions across all Salesforce clouds, for all sizes of companies in a wide array of industries.\nDelivery\nWith 500+ Salesforce professionals located in our 6 EMEA-based delivery hubs we utilise the latest Salesforce technologies and dev ops to rapidly deliver incremental benefit to our clients.\nOutsourcing\nWe have the scale to provide dedicated teams of developers and consultants to our GSI and ISV partners. Since 2013, Salesforce Services has used VRP’s development expertise on over 20 of their most strategic, enterprise accounts.\nPlease reach out and say hello!\n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"250 - 999","founded":"1998","locations":[{"headquarters":true,"address":"268 Bush Street, #3836","locality":"San Francisco","region":"CA","postal_code":"94104","country":"United States","phone":"+14154298565"},{"headquarters":false,"address":"3rd Floor, 10 Foster Lane","locality":"London","region":"","postal_code":"EC2V 6HR","country":"United Kingdom","phone":"+44 744 192 1443"},{"headquarters":false,"address":"Starowislna 46,","locality":"Kraków","region":"ML","postal_code":"31-035","country":"Poland","phone":"+48 667 017 048"},{"headquarters":false,"address":"K.P. van der Mandelelaan 68-70","locality":"Rotterdam","region":"","postal_code":"3062 MB","country":"Netherlands","phone":"+31(0) 6 24 80 83 73"},{"headquarters":false,"address":"Francyska Skaryny 2","locality":"Minsk","region":"MI","postal_code":"220114","country":"Belarus","phone":""}]}