{"id":"37615","name":"Livatek","tagline":"Software Development Teams as a Service","profile":"/profile/livatek","website":"http://www.livatek.com","directory":"directory/mobile-application-developers","page":"391","verified":"","description":"We work for software companies which have more ideas than abilities, knowledge, and skills to realize them.\nIn Europe, there are many companies developing innovative software solutions. And they have growing needs and demands on new technology and expertise. However, it is hard to find IT experts with the relevant background in the home city. In this case, companies usually hire freelancers or outsourcing their projects.\nWe understand that companies want more control over the development process than the outsourcing model could offer, and less risk and overheads than with freelancers.\nSo, Livatek provides an engaging model of cooperation which allows you to choose specialists you need to add to your in-house team through remote collaboration. You could start setting tasks and communicate with them directly, while we cope with all operational issues.\nToday, we are the software development partner for more than 20 companies in Europe. Since 2013, we are helping our clients build high-performance teams from 5 to 25 people, with a wide range of expertise from SaaS to machine learning. Livatek operates three offices, in Aabyhøj, Hamburg and Kyiv. Our development center is located in the capital of IT talent - Ukraine.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"Chr Winthersvej 96","locality":"Aarhus","region":"","postal_code":"DK-8230","country":"Denmark","phone":"+45 7734 3090"},{"headquarters":false,"address":"Admiralitatsstr. 58","locality":"Hamburg","region":"","postal_code":"DE-204579","country":"Germany","phone":"+49 40 60946277"},{"headquarters":false,"address":"Holosiivskyi Ave 42","locality":"Kyiv","region":"","postal_code":"UA-03039","country":"Ukraine","phone":"+380 44 5805550"}]}