{"id":"37693","name":"pb+j","tagline":"Made for each other.","profile":"/profile/pbj","website":"http://www.addpbj.com","directory":"web-designers","page":"1","verified":"","description":"pb+j is an Entrepreneur Empowerment Agency helping brave brands crush their growth goals through design and digital. \nWe’re a lot of things; normal is not one of them.\nWe partner with trail-blazing professionals who want a sure bet for a new level of success and confidence with their company.\nWe're the world’s most sought-after and prolific Squarespace Specialist. We’ve been a Squarespace Specialist since before there were Squarespace Specialists. As one of the ‘Original 10’ specialists and having built more than 400 of the most groundbreaking websites on Squarespace, you might say we know a thing or two (or 400).\nWe are also loyal Shopify Experts and Hubspot Partner Certified. So, if you need brand-building, conversion-driving, or money-making, we have it in the bag.\n-----\n👉 DOES THIS SOUND FAMILIAR...\n- you have difficulty attracting high-paying clients\n- you don't know where your next lead or project is coming from or when\n- you're losing out to your competitors because you can't clearly communicate why you're the better choice\n- you're not getting found online and you’re in need of a breakthrough\n- you are not seeing the results from your website and marketing that you need to be\n- you've hired a creative team before but it took 2X as long as they said it’d take and it cost 3X more\nIf you can relate to any of these... we should talk.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"180 John Street","locality":"Toronto","region":"ON","postal_code":"M5T 1X5","country":"Canada","phone":"855-523-3725"},{"headquarters":false,"address":"17 William St. N., Suite 4","locality":"Lindsay","region":"ON","postal_code":"K9V 3Z9","country":"Canada","phone":"855-523-3725"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":""}]}