{"id":"38102","name":"GREENLOGIC","tagline":"HIGHLY EFFECTIVE SOFTWARE HOUSE","profile":"/profile/greenlogic","website":"https://greenlogic.pl","directory":"web-developers","page":"709","verified":"","description":"Greenlogic, established in 2009 in Wroclaw/Poland, is the e-commerce agency and software house focused on web, design, programming, digital marketing, data analysis and sales growth. We are proud that projects we implemented for our customers have hundreds of thousands of users every day.\nMelbourne Branch\nIn 2018, we opened our company branch in Melbourne (10a Mitford Street, St Kilda VIC 3182, Australia). Now we can be closer to new customers and better respond for their needs, including design, software development, and data analysis. In the meantime, we build an Australian team of consultants and English support for our platform Firecrux.com.\nRange of activities\nGreenlogic is a technology company that operates on the b2b market in the are of software development, design, digital marketing and data analysis, e-commerce growth process implementation and development of hi-tech projects in the field of mechanics, medicine and behavioural analysis of WWW users.\nOur technology department is responsible for software development in Java, Python, C/C++, Bash, including dedicated applications based on machine learning algorithms and analysing big data sets of user activity and marketing campaign performance. Our long-term relationships with investment funds MCI Capital, Hartenberg Holding, and companies Roche Holding AG, Milarex, Euro Industry and Travelplanet, gives us the possibility to participate in modern and technologically advanced projects.\nOur e-commerce department specializes in user activity research, user testing, e-commerce consulting and implementation of real-time personalised customer journey management tools. We also help e-commerce departments in A/B testing, marketing campaigns data analysis and sales channel efficiency.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Krupnicza 13","locality":"Wrocław","region":"DO","postal_code":"50-075","country":"Poland","phone":"48505020036"},{"headquarters":false,"address":"10a Mitford Street 3182 St. Kilda","locality":"Melbourne","region":"VIC","postal_code":"3182","country":"Australia","phone":"61490235843"}]}