{"id":"38739","name":"codequest","tagline":"We turn ideas into awesome software products!","profile":"/profile/codequest","website":"https://codequest.com","directory":"directory/mobile-application-developers","page":"24","verified":"","description":"codequest is a group of software engineers, designers and growth hackers who design, develop and deliver successful software products.\n \nWe build MVPs for startups and enterprises by offering design, development and deployment and can help develop and maintain more mature products for SMBs. We specialise in remote work and currently cooperate with clients from USA, UK, Scandinavia and Germany. \n \nTo craft top-notch web and mobile applications, we master the following technologies and tools:\nRuby on Rails: Making programming of backends of applications easier. Delivers extremely fast results and is therefore often chosen by startups with a fast time to market strategy.\nAngular:Created by Google and therefore very robust and frequently updated with new features. Used to craft high quality web frontends.\nReact: Another JavaScript framework that aims primarily to provide speed, simplicity, and scalability.\nSwift: The main weapon of choice to craft great working native iOS applications.\n \nSpecial areas of interest:\nMachine Learning\nFacial Recognition\nFintech apps\nInternet of Things (IoT)\nUX and UI Design\n \nWhat differentiates us from other software agencies is not only our experience in creating products but also the emphasis we put on the quality of our work. We make sure that every line of code we deliver is robust, secure and easily maintainable.\nWe've taken our quality addiction to such lenghts that we even constructed codebeat.co, a SaaS for automated code review that is used by development teams from all over the world.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Plac Jana Henryka Dąbrowskiego 1","locality":"Warsaw","region":"MZ","postal_code":"00-057","country":"Poland","phone":"+48602123249"}]}