{"id":"38756","name":"App Partner","tagline":"Award-Winning Apps Created By a Team You'll Trust","profile":"/profile/app-partner","website":"https://www.apppartner.com","directory":"directory/mobile-application-developers","page":"6","verified":"","description":"App Partner is a NYC-based app development firm that works with Fortune 500 brands, leading retailers, funded startups and more to craft digital products and strategies that solve business problems and drive measurable results.\n \nThere's a reason \"Partner\" is in our name. We exist to help organizations achieve sustainable, long-term success. That means acting like part of the team, not just a vendor. That means offering insight and candid counsel at every stage of the engagement. And that means continuing to provide strategic value in the days, weeks, and years after an app's launch.\nApp Development & Digital Strategy\nWe have experience building apps for every relevant platform, from stalwarts like iOS and Android to emerging technologies like VR, AR and wearables. That makes us uniquely suited to help clients thrive in today’s omnichannel world.\nClose Collaboration\nOur 25-person team in Brooklyn consists of award-winning designers, cutting-edge engineers, and some of the top minds in digital strategy. We don’t outsource, and we don’t offshore; we believe that great work only happens when everyone – your team and ours – can closely collaborate throughout the entire project. \nFocus on Flexibility \nWhether your needs are big or small, we’re there as your partner. We’ve helped startups write their business plans and make their first hires. We’ve helped some of the world’s most recognizable brands better connect with their customers. And we’ve done everything in between.\nLong-Term Vision\nA digital strategy is never finished. We pride ourselves on building long-term relationships with clients. New business challenges will always arise; we help our clients meet them, every day.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"32 Court Street","locality":"Brooklyn","region":"NY","postal_code":"11201","country":"United States","phone":"212.913.9626"},{"headquarters":false,"address":"","locality":"New York City","region":"NY","postal_code":"","country":"United States","phone":""}]}