{"id":"39002","name":"OSO Web Studio","tagline":"We Engineer Your Ideas","profile":"/profile/oso-web-studio","website":"http://www.optimumsystemsonline.com","directory":"web-developers","page":"64","verified":"","description":"OSO Web Studio is a fully integrated web design and marketing agency located in Danbury, Connecticut. Our resources provide us with the ability to service clients in the tri-state area, nationally and globally.\nThe technical staff at Optimum Systems Online (OSO Web Studio) consists of creative graphic designers, engineers and programmers with years of design and development experience. Our in house staff works in conjunction with partners from around the world enabling us to provide a range of services at a value that fits most small business budgets.\nAdvanced Design Applications:\nAdobe InDesign, Adobe Flash, Adobe Photoshop, Adobe Illustrator, Adobe Fireworks State-of-the-Art Programming Applications PHP, MySql, HTML, CSS, Javascript, ASP, Content Management Systems (CMS), XML, DHTML, XHTML, HTML 5\nCutting Edge Web Solutions:\nE-Commerce, search engine optimization (SEO), custom development, hosting, social networking development, online marketing, video, secure Logins, database development, search Indexers, RSS Feeds\nIntegrated Marketing Solutions: \nEmail Marketing, corporate identity, marketing collateral, Mobile application development, banner advertising, animation\n \nOur goal is to establish long term relationships with our clients. As a result we set out to exceed client expectations daily. We accomplish this by learning and understanding client needs and then delivering on our promises.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2008","locations":[{"headquarters":true,"address":"36 Mill Plain Rd, Suite 302","locality":"Danbury","region":"CT","postal_code":"06811","country":"United States","phone":"203-942-2883"},{"headquarters":false,"address":"","locality":"Lviv","region":"","postal_code":"","country":"Ukraine","phone":""}]}