{"id":"39983","name":"Zudu","tagline":"Award Winning Apps - Design, Develop, Market","profile":"/profile/zudu","website":"http://www.zudu.co.uk","directory":"directory/mobile-application-developers","page":"4","verified":"","description":"Zudu is a pioneering digital agency based in the heart of Scotland with a flair for development, conceptualisation and digital marketing. We are experts in web and app development and have worked with clients ranging from individuals with great ideas to multinational organisations looking to reinvent and optimise their digital assets.\n \nUnlike many Digital Agencies, Zudu has more than just the technical knowledge to build websites, apps and software. Our team also demonstrates a full breadth of expertise in the fields of strategy, design, marketing, data analytics and security. This allows us to focus on end results which not only have a stunning aesthetic appearance but also achieve the measurable, tangible results which we feel digital assets should be expected to deliver.\nWorking with the dedicated team at Zudu will ensure you look good online, engage with your audience on a deeper level and gain valuable insight into your target audience’s behaviour. We seek to be more than just your suppliers; we aim to be your digital partners helping you to navigate the constantly changing digital landscape.\nYour success is a prerequisite for ours.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2014","locations":[{"headquarters":true,"address":"Nethergate","locality":"Dundee","region":"","postal_code":"DD1 4ER","country":"United Kingdom","phone":"+44 1382 690 080"},{"headquarters":false,"address":"6A Wardie Avenue","locality":"Edinburgh","region":"","postal_code":"EH52AB","country":"United Kingdom","phone":"+44 131 471 0957"},{"headquarters":false,"address":"34/5 Queen's Row","locality":"London","region":"","postal_code":"SE17 2PX","country":"United Kingdom","phone":"+44 20 3129 2735"}]}