{"id":"40257","name":"Virtual Employee","tagline":"1st Online Employee Supermarket","profile":"/profile/virtual-employee","website":"https://www.virtualemployee.com","directory":"directory/mobile-application-developers","page":"33","verified":"","description":"Virtual Employee Pvt. Ltd. (VE) is India’s premier remote staffing company and the only one which is completely centered on this model. It offers affordable and scalable virtual employment solutions for businesses around the world in over 150 domains. Founded in 2007 with the single-minded objective of helping SMEs (Small and medium enterprises) hire dedicated offshore remote employees and gain efficiency, save time and increase their bottom-line, Virtual Employee Pvt. Ltd.\ntoday has a growing client base of 2021+ clients in 30 countries across 5 continents.\nHeadquartered in the prestigious Noida Special Economic Zone (NSEZ) of the National Capital Region area near New Delhi, India, Virtual Employee Pvt. Ltd. has six offices across India, US, and the UK. Its staff of almost 1000 skilled and competent professionals work for clients in domains ranging from Web and Software Development, Graphic Designing, Content Writing, Digital Marketing, Mobile App Development, Engineering, Animation, Legal Processes, Finance and Accounting, and much more as dedicated virtual workers. \nA CMMI Level 3 appraised and an ISO 9001-27001-Certified company, Virtual Employee Pvt. Ltd. meets stringent global quality standards in all its service offerings. In addition, it takes data security and confidential client information with utmost seriousness with the mandated Non-Disclosure Agreements (NDA) as part of its internal policy. Virtual Employee Pvt. Ltd. has also received extensive media coverage in the UK and Australia and has the largest repository of client video testimonials in the outsourcing industry.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"1,000 - 9,999","founded":"2007","locations":[{"headquarters":true,"address":"Breakwater Marketplace, 91 Camden Street, Suite 312","locality":"Rockland","region":"ME","postal_code":"04841","country":"United States","phone":"(877) 697-8006"},{"headquarters":false,"address":"S.D.F Block - K1, NSEZ, Dadri Road, Phase 2","locality":"Noida","region":"UP","postal_code":"201305","country":"India","phone":"+91.120.662.8502"}]}