{"id":"40786","name":"Profil Software","tagline":"Python, Django, JS Development Company Poland","profile":"/profile/profil-software","website":"https://profil-software.com","directory":"directory/mobile-application-developers","page":"85","verified":"","description":"Profil Software (Python Software House) leverage deep technical experience and proven development processes to ensure successful outcomes and confidence in product development.\nIn more details that is taking idea to code to actual product in the customers hands\n \nOur Python Development Company is hiring 30+ inhouse developers, got 10+ years of experience.\nCompany provides premium software solutions for SMB and startups across 10+ countries on 4 continents.\nWe build innovative and high-value products and specialize in creating products with the highest return on investment versus risk.\n \nWhen we approach a project we always start from onboarding a well structured team to build a great pace for the project and bring expertise from the company experience. Plus having a transparent process for development we are able to manage it effectivelly and bring results in all developments stages.\n \nBringing talent, experience and processes to build a controllable development enviroment and future product success, using:\n \nBackend: Python, Django, Flask, Pyramid, Tornado, Celery, REST API, WebSocket, TensorFlow, Keras, SciPy, NumPy, GraphQL  \nDatabase: MySQL, NoSQL, PostgreSQL, MongoDB, Redis\nFrontend: Angular, TypeScript, AngularJS, ES6, React, JavaScript, AJAX, jQuery, Less, Sass, CSS3, HTML5\nOther: AWS: S3, Cloudfront, Lambda, EC2; Google Cloud, Heroku\nCI/CD: Gitlab CI, Circle CI, Jenkins, Docker\nMobile: React Native \nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"Zygmunta Augusta 11B/0107","locality":"Gdynia","region":"","postal_code":"81-359","country":"Poland","phone":"+48 506 385 326"}]}