{"id":"40853","name":"Cheeky Monkey Media Inc.","tagline":"Web Solution Specialists","profile":"/profile/cheeky-monkey-media","website":"https://cheekymonkeymedia.ca","directory":"web-developers","page":"5","verified":"","description":"Cheeky Monkey Media is a troop of digital experts helping our partners create, execute, deliver and market kickass digital experiences. The monkeys believe in a world where every organization has the power and confidence to share their identity and strengthen their business online - Simply. Effectively. Thoughtfully.\nFor over a decade now the monkeys have helped our clients solve more than 100 website, design, marketing, and search engine optimization challenges. \nWe’ve spent more than 200, 000 hours helping clients kick some serious monkey butt online. Of course, every spacialist on our team has loads of experience outside of Cheeky Monkey Media too.\nWe figure that we’ve spent\nmore 100, 000 hours working with Drupal\nmore than 50,000 hours working with Wordpress\nmore than 25,000  hours designing fun and informative graphics and layouts\nmore than 35,000 hours creating and executing innovating and engaging marketing strategies\nWhat We Are About\nwe believe designing, developing and marketing websites can be fun\nwe belive simple elegant solutions can solve complicated business challenges\nwe believe open, consistent, and curious communication make successful web projects\nwe believe technology (a.k.a geek speak) can be translated into english\nwe believe in growing from our mistakes and building on our successes\nwe believe our success is defined by our employee and client successes\nwe belive in keeping our promises to our clients\nwe believe our clients can leverge the web for business success\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"2280 Leckie Rd, Unit C","locality":"Kelowna","region":"BC","postal_code":"v1x6g6","country":"Canada","phone":"1-778-484-1519"},{"headquarters":false,"address":"31 Mark Av e, Unit C","locality":"Moncton","region":"NB","postal_code":"E1C7h1","country":"Canada","phone":"1-800-818-4564"}]}