{"id":"41123","name":"Eden Agency","tagline":"Yorkshire's finest digital agency","profile":"/profile/eden-agency","website":"http://createdineden.com","directory":"directory/mobile-application-developers","page":"59","verified":"","description":"We’re on a mission to deliver solutions with high impact and grow your business with bloomin’ amazing marketing and digital products.\nChatbot Masters\n2017 will be the year of the bot and brands that leverage AI properly will be the first to access the 3 billion users worldwide who are already using messaging apps. We are ready to help you make the leap and bring conversational user interfaces and social AI into your marketing campaigns, products and services.\nVirtual Reality developers creating amazing VR solutions\nWe design and develop bespoke VR games and experiences for our clients. These solutions can be used to increase brand awareness, engagement or for in-store entertainment.\nWe're incredible app developers\nWe've been developing apps for longer than any of our competitors, written critically acclaimed books to help other app developers and done Ted talks on the topic from our offices in Knaresborough near Harrogate. Our app development, design and delivery services are unrivalled and trusted by the worlds biggest brands and startups alike.\nOur team is made up of UX designers, native Android developers, native iOS developers, web developers and marketeers.\nWe build incredibly engaging experiences on mobile along with well planned marketing campaigns to launch apps with gravity and retain consumers well into an app's lifecycle.\nWe're wonderful web developers\nWe're Yorkshire's leading app developers and we do wonders with the web too. As a web development agency, we will work with you to create your perfect responsive website. Come one, come all- from big brands to tech startups, every website is a welcome challenge.\nAs a multidisciplinary agency, we like to keep things as streamline as possible. Whether it's an e-commerce or a catalogue site, our web process can be moulded to suit your needs. \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"Knaresborough Technology Park","locality":"Manse Lane","region":"NYK","postal_code":"HG5 8LF","country":"United Kingdom","phone":"+44 14 2359 3010"}]}