{"id":"41607","name":"Praxent","tagline":"Digital Innovation Agency | 300 projects delivered","profile":"/profile/praxent","website":"https://praxent.com","directory":"directory/mobile-application-developers","page":"24","verified":"","description":"Digital product design & development, built with you, not for you.\nDigital innovation is a required core competency for tomorrow’s market leaders – it cannot be outsourced long term. To keep up with the digital demands of your customers, your organization must internalize design thinking, research-backed UX design, customer centricity, rapid, incremental testing, user validation and, agile development to inform and accelerate your digital roadmaps.\n \nOver 20 years, we have launched more than 300 digital products, creating game-changing value for our clients with new websites, sales enablement tools, customer portals, and mobile apps.\nWe have a proven record of serving startup, mid-market, and enterprise clients including NRG, Flex, Sysco Foods, Keller Williams, Amherst, Dimensional Fund Advisors, Kinder Morgan, Jack Link’s, The City of Houston, World Market, Keller Williams, and Cisco. Our project results speak for themselves:\nNRG generated $80M in new revenue\nThe City of Houston saved $40M\nBrief Media acquired 19,000 monthly active users, 91% of the addressable market\nInteractive Health Technologies scaled to over 1M users in 5 countries\nWe inform your roadmap with user research so that all ideas for features are evaluated against a trove of user insights, assumptions are validated and the backlog is prioritized based on which features create the most value.\nWe build it with you, not for you by leveraging your existing resources, assets, and ideas. We then organize ourselves around you to uncover the shortest possible path without redundant services.\nWe work ourselves out of a job leaving you with the core competency of digital innovation to accelerate your progress toward a best-in-class customer experience.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2000","locations":[{"headquarters":true,"address":"4330 Gaines Ranch Loop, Suite 230","locality":"Austin","region":"TX","postal_code":"78735","country":"United States","phone":"+1.512.553.6830"}]}