{"id":"42564","name":"Alconost Inc.","tagline":"Localization, translation & video production","profile":"/profile/alconost","website":"https://alconost.com","directory":"seo-firms","page":"19","verified":"","description":"We localize websites, software, apps and games into 70+ languages. Our team consists of 700+ professional native-speaking linguists. For shorter texts try Nitro — an online human translation service.\nWe create and maintain multilingual PPC campaigns, SEO, landing pages, and content marketing.\nWe make advertising clips, trailers, teasers, pre-rolls, videos for App Store/Google Play and provide voice-over services.\nWrite to us about your project at alconost.com.\nWe use professional localization software, CAT-tools, cloud platforms, translation memories, and glossaries. We can do in sync continuous localization, proofreading, and QA. Our project managers are available 24/7.\nFor shorter texts, we’ve developed Nitro — an online professional translation service. Nitro is quick — 50% of orders are completed within 2 hours, 96% — in less than 24 hours. There is no minimum order — we will translate as little as 1 word. Register with Nitro and send your text for translation with just a few clicks.\nWe can develop an international promotion strategy, perform SEO and create a multilingual PPC advertising campaign for your website. Your personal project manager, digital marketer, web-analyst, content manager, programmer, usability specialist, link builder, PPC-manager, and copywriter are always available for your needs.\nOur videos increase conversions, sales, and sign-ups and also look very cool! Videos by Alconost are dubbed by professional native-speaking voice actors. Our video managers take care of the entire process and are happy to come up with a couple of out-of-the-box ideas.\nTo date, we've completed over 2,000 thriving localization projects and created over 500 videos.\nTell us about your need at alconost.com  — and we'll come back to you with a custom-tailored solution.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"250 - 999","founded":"2003","locations":[{"headquarters":true,"address":"901 N. Pitt Street Suite 170","locality":"Alexandria","region":"VA","postal_code":"22314","country":"United States","phone":"+1 (571) 357 3985"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Belarus","phone":""}]}