{"id":"4299","name":"Christian Webmaker","tagline":"Where Web Design Is Inspired By Our Maker","profile":"/profile/christian-webmaker","website":"http://www.christianwebmaker.com","directory":"web-developers","page":"145","verified":"","description":"Christian Webmaker began in January 2003 as a small home-based business specializing in affordable, professional web design services for Christian entities: churches, ministries, non-profits, small businesses, schools, professionals, individuals, etc. I contine to work out of my home office thereby allowing me to offer affordable web design pricing.\nChristianWebmaker understands most churches and small Christian organizations do not have the funds to be able to afford the costs often associated with most web design firms. Several pricing options are available to meet any budget. Each website design is His creation so ChristianWebmaker strives to glorify God by: providing Christian web design of the highest quality at competitive and affordable prices; keeping the company Christ-centered adhering to Christian principles and treating all clients with courtesy and respect; maintaining high moral and ethical standards concerning anything created or published; promoting the love and saving grace of Jesus Christ wherever possible. Design features include: free unlimited consultation for contracted clients; website design and layout with custom masthead incorporating logo; navigation menus; your photos and other images; your copy (text) with editing, if needed; links to external sites; stock and royalty-free illustrations and photos; search engine optimization (SEO), including META tags for title, description, keywords and phrases; site check in multiple browsers and screen size resolutions; website submission to top search engines and directories; follow-up support for up to 30 days after website completion; dynamic content; copyright credit; one submission form. Domain name registration and website hosting are not included in our pricing, but assistance is offered in obtaining those services. I will not take on a project for which I have no expertise and try to muddle through, however, I can outsource or make referrals to those who are more competent.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"2 - 9","founded":"2003","locations":[{"headquarters":true,"address":"","locality":"Winterville","region":"GA","postal_code":"30683","country":"United States","phone":"706.742.7411"}]}