{"id":"43061","name":"Midnight Oil","tagline":"CREATING EXPERIENCES THAT INSPIRE.","profile":"/profile/midnight-oil","website":"http://www.moagency.com","directory":"agencies","page":"27","verified":"","description":"Midnight Oil is a dynamic marketing agency dedicated to creating meaningful connections through experiences that inspire. A team of strategic thinkers, creative artists and expert craftsmen, we take seriously our role as brand caretakers and culture-makers. With an unquenchable thirst for realizing the impossible, we view every challenge as an opportunity for innovation and take pride in exploding the status quo.\nRather than simply responding to consumer demands, we insist on going beyond the bottom line to INFLUENCE + SHAPE + REDEFINE cultural values with insightful messaging that elevates and engages the world around us. WHAT WE DO At Midnight Oil, we DIG DEEP into a brand’s intrinsic value to create high-concept, platform-agnostic solutions to suit each unique challenge brands face. Our passion for all things culture takes shape in the form of the tangible experiences we create, which reach to the heart of people’s emotions and desires for connection and community. Our fluid agency model and vast network of strategic partners allow us to customize campaigns to take only those steps that will lead to authentic emotional connections, persistent cultural significance and, most importantly, meaningful success for our clients. Leveraging our nearly 40-year history with a diverse team of premium talent and state-of-the-art workshop, we have earned a reputation as premier thought partners our clients can trust. Headquartered in Burbank, CA., the Midnight Oil team comprises 250+ agency professionals and partners with clients such as Disney, Netflix, Sony Pictures Television, Microsoft, Warner Bros. Pictures, Activision, EA, and Universal Pictures, among others. Midnight Oil has received numerous accolades from the CLIO Key Art Awards, Game Marketing Awards, OMA Awards, Effie Awards, the Golden Trailer Awards, and more. For more information visit www.moagency.com or call 818.295.6100\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"250 - 999","founded":"2004","locations":[{"headquarters":true,"address":"3800 Vanowen Street","locality":"Burbank","region":"CA","postal_code":"91505","country":"United States","phone":"818.295.6100"}]}