{"id":"43410","name":"VisualRocks","tagline":"Interface Design for Mobile Products","profile":"/profile/visualrocks","website":"https://visualrocks.co","directory":"web-designers","page":"1380","verified":"","description":"We design app interfaces for mobile products — iPhone, iPad, Android Smartphones, and Tablets. We offer full-cycle design services, starting from idea validation to implementation testing.\nOur workflow includes following stages:\n— Research\nWe dive into product’s domain. Get knowledge about the target audience and their needs, find what value we can bring them. Research business goals, market, and competitors.\n\n— UX Design\nWe start with building a list of features that will create a good value for the target audience and will meet the business goals. We create an interactive prototype and make user tests to refine the idea and build the best user experience.\n\n— Visual Design\nWe work on the final look of the product, define a style for all interface elements to create solid and consistent visual experience. We create supplement graphics for marketplaces and promo needs. \n\n— Motion Design\nWe design interface animations and screen transitions since they can drastically improve user experience. And of course, custom transitions delight users and help to stand out among competitors.\n\n— Guidelines and Assets\nGood collaboration with development team is extremely important, so we prepare graphic assets, visual guidelines, and redlines for developers. For complex interfaces, we create comprehensive documentation.\n\n— Implementation Testing\nWhen the interface is implemented by development team we test the product for design implementation consistency and compliance to design guidelines. All visual defects are reported to developers.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"2 - 9","founded":"Undisclosed","locations":[{"headquarters":true,"address":"","locality":"Kiev","region":"","postal_code":"07100","country":"Ukraine","phone":""}]}