{"id":"43433","name":"Graphic Evidence","tagline":"Builders of Beautiful Brands","profile":"/profile/graphic-evidence","website":"http://www.graphicevidence.co.uk","directory":"web-designers","page":"123","verified":"","description":"In 2003 a group of elite creatives were brought together to fight crimes against design and marketing. Today, they are known as Graphic Evidence, a team who have made it their mission to engineer stunning brands, develop engaging websites, produce perfect packaging and create remarkable marketing literature - striving to put right what was once shabby, dull and outdated.\nIn this ten year mission the Graphic Evidence creative collective have helped companies large and small from around the world, from simple local website design to a full global rebrand and marketing campaign. Graphic Evidence are always enthusiastic and proud of the work they create, no matter the project sector or size. The versatility and creativity of the work throughout the portfolio is testament to that. Graphic Evidence’s ideas and creativity doesn’t just lie in branding and design, as a creative marketing agency we offer: web development, email marketing, website maintenance, social networking, copy writing and print management. If the right medium to connect and inspire your consumers is a brochure for example, we can write the copy, source photography, design the layout and commission the most efficient and economical print suppliers. We are based in Essex and London and have clients throughout the world and in a multitude of sectors. To find out more about Graphic Evidence and our services please call 020 8508 7870 or visit our website.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2003","locations":[{"headquarters":true,"address":"151 High Road","locality":"Loughton, Essex","region":"","postal_code":"G10 4LF","country":"United Kingdom","phone":"+44 020 8508 7870"},{"headquarters":false,"address":"29 Throgmorton Street","locality":"London","region":"","postal_code":"EC2N 2AT","country":"United Kingdom","phone":"+44 020 7206 2320"}]}