{"id":"44986","name":"Black Antelope","tagline":"Website and interactive design and development","profile":"/profile/black-antelope","website":"http://www.blackantelope.com","directory":"web-developers","page":"58","verified":"","description":"Black Antelope is a design-focused and engineering-focused digital creative agency. We started the agency in 2009 in the San Francisco Bay Area, and ever since then we’ve been engaged with creating elegant solutions for interesting projects and amazing clients. Nowadays our team hails from Seattle, Washington to Sacramento, California to London, England.\nWe are technologists with broad experience with various platforms. Adapting to new or obscure tech is easy for us, and we're not at all religious about any technology. Having experience with many technologies allows us to be objective when choosing a platform for a new project.\nOur framework experience includes Drupal 8 (as well as Drupal 6 and 7), Wordpress, Symfony, CodeIgniter, CakePHP, Zend, Django, Vue, React, and Angular. In terms of languages we've worked mostly with PHP, JavaScript, Ruby, Google's Go (Golang), and Python. We've worked in many industries including enterprise / B2B, tech startups, non-profits, higher education, and e-commerce.\nMuch of the work we do is highly custom and requires a good amount of heavy lifting, in areas such as e-commerce (Drupal Commerce, Ubercart, Magento, payment gateway integrations), site/data migration, RESTful API design and development, social media design and implementation, 3rd party integrations (Salesforce, Marketo, Pardot, Hubspot, Eloqua, etc), design/dev of microsites and partner portals, multi-site and multi-language, geospatial and geo-relevant apps (MongoDB, Solr, Elasticsearch), etc.\nOur approach to problem solving is very organic and we use the best tools for the job. Sometimes it can mean an agile methodology and sometimes it can mean pure creativity. We are often pulled into a bigger team to augment architecture, engineering and design capabilities. It’s also quite often that we stay engaged for a long period, and stay on a valuable and consistent partner.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2009","locations":[{"headquarters":true,"address":"","locality":"Seattle","region":"WA","postal_code":"","country":"United States","phone":"415.944.1905"},{"headquarters":false,"address":"","locality":"Sacramento","region":"CA","postal_code":"","country":"United States","phone":""},{"headquarters":false,"address":"","locality":"London","region":"","postal_code":"","country":"United Kingdom","phone":""}]}