{"id":"48554","name":"Ignitho Technologies","tagline":"Digital Application & Innovation Services","profile":"/profile/ignitho-technologies","website":"http://www.ignitho.com","directory":"directory/mobile-application-developers","page":"73","verified":"","description":"Ignitho is a Digital Technology Solutions company, recognized as a preferred partner for Digital Applications & Innovation for enterprises using Frugal Innovation methodology – “the ability to do more with less” – developed in collaboration with a world-renowned thought leader from the University of Cambridge.\nIgnitho specializes in:\nInnovation Services – The ability to start small and deliver quick outcomes on limited budgets for the web, mobile and cloud\nInnovation Labs – Ability to nurture business ideas on limited budgets into viable prototypes & MVPs for Enterprise Innovation Leads\nIgnitho’s delivery strength lies in its robust pool of experienced, technically competent resources across Microsoft, Open Source, Mobile and Cloud technologies. Through a strongly established brand as a “desirable place to work”, Ignitho is able to attract and retain the best technical talent in the industry. Our customers have been delighted by our honest and transparent approach and our ethos of a “One Team” partnership with customers through a Distributed Agile project methodology. Ignitho has thereby built up an enviable track record of delivering top-tier service quality at a competitive price, with a niche player attitude to customer care.\nHeadquartered in the USA, Ignitho services its customers through its offices in New York, USA & London, UK, and its innovation labs & development centers in Richmond, USA, Brighton, UK and Kochi, India.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2013","locations":[{"headquarters":true,"address":"125 Park Avenue","locality":"NYC","region":"NY","postal_code":"10017","country":"United States","phone":"+1 646 205 3440"},{"headquarters":false,"address":"2400 Old Brick Road","locality":"Glen Allen","region":"VA","postal_code":"23060","country":"United States","phone":"+1 804 503 9888"},{"headquarters":false,"address":"SINC, 12-16 Addiscombe Road, Croydon,","locality":"London","region":"","postal_code":"CR0 0XT","country":"United Kingdom","phone":"+44 20 8090 1461"},{"headquarters":false,"address":"Sussex Innovation Centre, Science Park Square,","locality":"Brighton","region":"","postal_code":"BN1 9SB","country":"United Kingdom","phone":"+44 12 7390 0062"},{"headquarters":false,"address":"Second Floor, Jyothirmaya Building, Infopark Phase II","locality":"Kakkanad, Kochi","region":"KL","postal_code":"682303","country":"India","phone":"+91 484 699 9970"}]}