{"id":"48960","name":"RAD4M","tagline":"RAD4M – We make your dreams come true!","profile":"/profile/rad4m","website":"http://www.rad4m.com","directory":"directory/mobile-application-developers","page":"36","verified":"","description":"We are new to Clutch yet we are very experienced in the field of IT. Our company was founded in 2008, which means that we’ve already been present on the market for 9 years. We have realized countless projects so far, our clients including SKANSKA, CEZ, Deutsche Bank and Asseco.\nWe come from Poland and we are proud of it. It is our country that e.g. Nicolaus Copernicus, Marie Curie, Frédéric Chopin, Antoni Patek (founder of Patek & Co) or Karol Wojtyla (Pope John Paul II) came from. According to the findings of KPMG IT Outsourcing Service Provider Performance & Satisfaction Study, Ernst&Young Attractiveness Survey as well as Tholons Top 100, Poland is one of the most attractive regions for the IT sector! Applications designed by Polish developers are appreciated for their high quality going together with favourable price.\nWe really encourage you to try the services of Polish developers and we can guarantee that you won’t be disappointed! Feel free to see our portfolio and contact us. Why? The answer is very simple: we are exceptional! We do not only focus on quality and precision when working on our projects but always do our best to make our clients have a good time with us. \nBeing in IT industry for so many years, we are perfectly aware of the importance of good communication, which often is the key to the success of a project. We can assure you that with us it is possible to discuss your needs directly.\nOur motto: „We make your dreams come true” reflects the spirit of our company. We want to give you something more than simply a mobile app. We want to make you happy and turn your dreams into reality. We want the cooperation to be rewarding for both parties. We do our best to make our projects the key to success for each of our business partners. It is the main objective that we never lose sight of when working for our clients.\nContact us even today and make your dreams come true!\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"Aleja Pokoju 3","locality":"Krakow","region":"","postal_code":"","country":"Poland","phone":"+48 664338118"},{"headquarters":false,"address":"Landmark House, Hammersmith Bridge Rd","locality":"London","region":"","postal_code":"W6 9DP","country":"United Kingdom","phone":""}]}