{"id":"5174","name":"Software Associates","tagline":"Pioneers of web application development since 2000","profile":"/profile/software-associates","website":"http://www.softwareassociates.in","directory":"directory/mobile-application-developers","page":"75","verified":"","description":"Software Associates started as a venture offering web development services, specifically building e-commerce portals, social media websites, intranets and extranets. Our portfolio has increased and we have added web application testing,  Android app development and online marketing services to our list of offerings.\nWe follow the associate model, building trusted business partnerships with web design firms, media and advertising agencies, and small & medium sized IT firms. We bring to our associates some of the best practices in the industry, a decade of project handling expertise, cross cultural understanding, and access to some of the sharpest brains in the IT industry. Our vision is to be the preferred business partners for our associates worldwide and not just another technology vendor. Ethics, Innovation, and performance are the cornerstone of our venture which has helped us grow from a team of 4 resources in 1999 to 100+ strong talented pool.\nWe have successfully completed more than 1000 projects for individuals and small & mid sized organizations and have client presence in 12 countries across the globe with major focus on US (New York, Boston, Seattle) United Kingdom (London, Manchester, Brighton and Leicester) and Singapore.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1991","locations":[{"headquarters":true,"address":"Software Associates “Mascot”, Zilla Bunglow Road, Nadakkavu","locality":"Calicut","region":"KL","postal_code":"673011","country":"India","phone":"7907159353"},{"headquarters":false,"address":"Ripples IoT PTE. LTD, 60 Paya Lebar Road, #04-57, Paya Lebar Square","locality":"Singapore","region":"","postal_code":"409051","country":"Singapore","phone":""}]}