{"id":"53037","name":"HTML Pro","tagline":"NYC's Top Digital & Software Solutions Company","profile":"/profile/html-pro","website":"http://www.htmlpro.net","directory":"web-designers","page":"16","verified":"","description":"Headquartered in Heart of Manhattan, HTML Pro is among NYC's Top Ten Digital Agencies & IT Solution Providers helping Enterprises, SMBS, Multinational Corporations, Web Agencies & E-Commerce Businesses with their Digital Transformation & Development of High Performing Information Technology Solutions.\nOur expertise is spread across the board ranging from emerging technologies such as Block chain, Dev Ops and Cloud computing to the traditional practices of the World Wide Web; transforming businesses functions digitally for continued success in the modern era.\nHTML Pro is equipped with modern tools and award recipient teams which has allowed to venture into the unexplored world of IT solutions providing: Product Management Services (Product Engineering, Quality Assurance), Application Development (Web Application Development, Mobile Applications), Security (Block-chain services, Cyber-security & Risk management), Cloud Computing (Server-less Applications, Internet of Things) and Software Defined Everything (Big Data, Business Intelligence).\nHTML Pro is Digitally Transforming businesses offering Digital Marketing (Search Engine Optimization (SEO) / Link Building, Pay Per Click Marketing & Display Ads (PPC), Facebook and Instagram Ads with Re-Marketing Methodology, Landing Page / Funnels for enhanced conversions, Social Media Marketing, Online Brand Reputation Management, & Marketing, Content Marketing, Email Marketing), Web Design / Development (Wordpress, Shopify, Joomla, Drupal, Magento, Blogger, Bitrix, Squarespace, Prestashop, Wix, Lightspeed, Big-Commerce, Open-Cart, CrateJoy (Subscription Box), Weebly, Subbly, MIVA Merchant & many others) and Design to Website Services (Conversion to Design files into .Sketch/AI/EPS/PSD/PNG/TIFF/XDHTML Frameworks i.e. Responsive HTML, Bootstrap, Email Template, SASS, LESS, Foundation Zurb, & Others).\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2013","locations":[{"headquarters":true,"address":"19TH W 34th St, Suite 1018","locality":"New York","region":"NY","postal_code":"10001","country":"United States","phone":"347.308.5764 Ext. 2"},{"headquarters":false,"address":"","locality":"Lahore","region":"","postal_code":"","country":"Pakistan","phone":""}]}