{"id":"54269","name":"Netkata Software House","tagline":"We deliver effective web applications.","profile":"/profile/netkata-software-house","website":"http://netkata.com","directory":"web-developers","page":"28","verified":"","description":"Netkata is a digital solution partner for innovative companies and startups. We provide digital product strategy, UX and service design, and deliver custom web applications and websites to grow our client's business.\nTechnology \nWe code high-quality responsive and easily maintainable web solutions, with continuous integration and contiuous deployment — utilising React (JavaScript), Laravel (PHP) and WordPress. We assure tech support with 24/7 SLA available.\nThe N Team\nOur team of 45 designers, product owners, and web developers works in Scrum agile methodology, use Slack and JIRA Agile. Established in 2008, we deliver globally, from offices in Berlin, Oslo, Warsaw and Lublin, Poland. We mentor startups and organize startup accelerators, including The Founder Institute Berlin, Warsaw and Dublin, and WeWork Labs.\nOur Project Management.\nWe ensure project success by providing a collaborative team environment (Jira + Slack) on every project and an agile Scrum workflow to deliver quality work in quick turn-around timeframes. Our clients get full access to work progress, and can see task completion and work done, and comments from our team. For every project there's a Product Owner on our end, responsible for delivering quality work on time and in budget. Our clients get regular work-time reports on a weekly basis.\nHow we approach pricing?\nWe value transparency, so when a client asks for a fixed price quote or an estimate for T&M project (we typically work in time&materials based projects), we provide the estimate as a specific breakdown of the projects scope, with separate costs for each work item and it's elements (analysis, wireframes, design, frontend, backend, testing). \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"Nowy Świat 5 / 11","locality":"Warsaw","region":"MZ","postal_code":"00-496","country":"Poland","phone":"+48505034253"},{"headquarters":false,"address":"Ochotnicza 10 / 2","locality":"Lublin","region":"","postal_code":"20-012","country":"Poland","phone":""}]}