{"id":"56011","name":"SevenAtoms","tagline":"Attract Leads. Grow Your Business","profile":"/profile/sevenatoms","website":"http://www.sevenatoms.com","directory":"seo-firms","page":"19","verified":"","description":"SevenAtoms is a digital marketing agency in San Francisco that helps businesses market their products and services online to achieve tangible, bottom-line results. We use cutting edge strategies in inbound marketing, SEO, PPC, social media, and content marketing to grow our client’s businesses, and we are especially adept at integrating these channels so that they work together to drive maximum performance. \nWe are a HubSpot certified agency and a Google partner which means that our team has all the necessary skills, experience and best practices to take on even the most demanding digital marketing campaigns. We have worked with clients in diverse industry segments including B2B Services, SaaS, Technology, E-commerce, Law, Financial Services and Health Care. \nAt SevenAtoms, we have one goal and one goal only: to generate more leads for your business that convert into loyal customers. In order to accomplish this, we work to elevate your digital marketing strategy by creating high-performance PPC and inbound campaigns, generating compelling yet SEO friendly content, developing converion-optimized web and landing pages, marketing your brand through social media channels, and monitoring and reporting your web analytics. \nToday, digital marketing is all about making connections with real people and our services are structured with this in mind. We create experiences and content that are informative and helpful to users, which both encourages them to share the content and increases their receptiveness to your brand. Amazing content sparks conversation and we want people to be talking about you. \n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2012","locations":[{"headquarters":true,"address":"28 2nd Street 3rd Floor","locality":"San Francisco","region":"CA","postal_code":"94105","country":"United States","phone":"+1.415.513.0435"}]}