{"id":"5773","name":"Minimum Inc.","tagline":"Mobile Design, UX and Development","profile":"/profile/minimum","website":"http://minimuminc.com","directory":"directory/mobile-application-developers","page":"20","verified":"","description":"MINIMUM INC. IS A DIGITAL PRODUCT AGENCY\nWe connect human behavior with intuitive design and meticulous engineering to create gorgeous products that people love.\nHOW WE CAN HELP YOU\nWe help startups, brands and agencies create products  people actually use — over, and over, and over. In order to do so we provide the following services:\nProduct and UX Strategy\nUser Experience Design\nInteraction- and UI Design\nRapid Prototyping\nMobile, Web and Cross-platform Development\nHOW DO WE WORK WITH YOU\nWe believe that a good product simplifies an existing behaviour instead of forcing a new one, and that design is only beautiful when it works.\nWe use a highly effective blend of user-centered design, lean startup and agile methodologies to power all aspects of our product creation cycle.\nEach project is handled by a nimble cross-disciplinary team led by one of the partners who becomes the face of the project and works directly with you.\nWE HELP ENTREPRENEURS AND 'INTRAPRENEURS' ALIKE TO MAKE THEIR PRODUCT TEAMS MORE EFFECTIVE\nWe take care of all UX, design and engineering aspects of your product, so you can focus on a million other things in your business. We've been founders ourselves, and know both sides of the deal.\n\"Having Minimum is the closest thing that a client can get to having a professional CTO onboard...\" (Full review)\n\"I truly worked together with Minimum, iterating and learning from them. They aren't simply designers, but are capable of participating in long-term product strategy.\"(Full review)\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Centennial Circuit","locality":"Byron Bay","region":"","postal_code":"2481","country":"Australia","phone":"+61 452 586 624"},{"headquarters":false,"address":"","locality":"Los Angeles","region":"","postal_code":"","country":"United States","phone":"310.844.1195"},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"Russia","phone":""}]}