{"id":"58004","name":"Nearshore Romania","tagline":"Custom Software Development","profile":"/profile/nearshore-romania","website":"http://www.nearshore-romania.com","directory":"it-services","page":"255","verified":"","description":"Nearshore-Romania provides software development outsourcing services with expertise in multiple industries. We play with cutting-edge technologies to build innovative products and support business transformations.\nWe engage our software engineering know-how to make your business processes run smoothly and efficiently. Be it complex or standard, we have your software solution covered through every stage from requirements to development, implementation, and maintenance.\nJava, .NET, web & mobile apps, next to Cloud and DevOps technologies are bricks we gracefully put into place, coordinated by Agile development processes. The result is tailor-made software that enables companies efficiently implement their business growth vision.\nWe believe in building long-term business relationships based on mutual trust and respect.  In this spirit, we have flexible business frameworks for a win-win collaboration. To salute various needs of customers from different cultures, we propose various alternatives of delivering software services.\nRomanian programmers are appreciated all over the world for the great work they are doing as a result of excellent theoretical background, programming skills and creativity. In our Software Development Center we constantly invest in „upgrading“ our software engineers whose technical competences are certified by giant players on the market (Microsoft, IBM, Oracle, ISTQB).\nAfter 20+ years of experience in the field, we own an appreciable portfolio of state-of-the-art Cloud solutions, Liferay Portals, Oracle EBS applications, DevOps environments, enterprise web & mobile apps or Lotus Notes collaborative platforms.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"1994","locations":[{"headquarters":true,"address":"2A Reconstructiei St.","locality":"Sibiu","region":"SB","postal_code":"550129","country":"Romania","phone":"+40 (269) 231037"}]}