{"id":"5834","name":"Manipal Digital Systems Pvt. Ltd.","tagline":"Stand Apart....","profile":"/profile/manipal-digital-systems","website":"http://www.manipalsystems.com","directory":"web-designers","page":"333","verified":"","description":"Manipal Digital Systems Pvt. Ltd. is a distinguished & distinct Pre-press & Pre-Media service enterprise with inexhaustible interest in delivering nothing less than the best.\nAt Manipal Digital Systems (MDS), we work with clients and partners around the world and across diverse markets to provide premedia services, content publishing services & creative production solutions ranging from imaging, design, animation & programming services to more complex projects that require design support, and fully integrated publishing workflows and cross-media technology. In a nutshell, we provide high-quality, cost-effective, 24/7/365 service to our customers. Built with people of passion and perseverance MDS, as it is fondly known as, is also a part of $1 billion dollar Manipal Group which has a distinct record of successfully running one of the oldest & profitable line of presses. MDS has varied expertise in iPad/IPhone/Android as well as Mac applications. Whether its apps for children or for business professionals, we can design the perfect app for your target audience. Apps designed by MDS stretch from simple single platform affairs to complex multiplatform management systems. We offer a complete mobile application development lifecycle to help you design, develop, test and deliver your mobile applications to your target audience. Our R&D team is currently exploring the market of hand-helds beyond mobile phones where Mobile Apps and Gaming can be used for branding, education and Customer engagement.... Our capabilities include: • Complete mobile application development lifecycle from understanding the requirements to delivering a complete application, including registering it with the relevant Applications Store. • Multi-platform development or porting including Iphone, Ipad, Android and J2ME. • Comprehensive testing of multi-platform mobile application by taking into consideration multiple mobile networks, carriers and devices. MDS\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2006","locations":[{"headquarters":true,"address":"","locality":"Manipal","region":"KA","postal_code":"576104","country":"India","phone":"+91- 820 257 1151-55 Extn:5563"}]}