{"id":"58745","name":"Evinent GmbH","tagline":"We create great web applications","profile":"/profile/evinent-gmbh","website":"http://evinent.com","directory":"web-developers","page":"113","verified":"","description":"Evinent GmbH is a German-Ukrainian company specializing in developing platforms for mobile devices and delivering B2B and B2C solutions without compromising on outstanding user experience\nWe are an ever-growing team of highly qualified software engineers that focuses on delivering bespoke software development and ongoing technical support to more than 20 successful clients.\nAt Evinent, we take pride in transparency and detailed planning throughout the entire process, our aim being to completely fulfil our customers’ needs and boost their business success\nWe are a group of highly-skilled developers who share a common passion for the work we deliver. Our vision for software development starts with a thorough analyze of our customer’s needs that allows us to integrate the functionality of coding into a solid architecture that will ultimately result in business success.\nWe start every project by understating the core of a business’ operations in order to be able to find the perfect solution for your needs. At Evinent, we believe that strong communication is key when it comes to software development, so we are always in touch with our clients throughout the process.\nOur technology stack\nC#/.NET Core\njavascript, Angular\nASP.NET MVC, WCF, Web API\nHTML5, CSS3, Bootstrap, PostgreSQL\nMsSql Server, Elasticsearch, MongoDB, Ionic, SalesForce, Electron\nKatalon, Selenium WebDriwer \nOur services\nSolutions for healthcare\nSolutions for search\nB2B/B2C development\nUI/UX design\nQuality Assurance\nTechnical support and Documentation\nDeployment and Integration\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"Undisclosed","locations":[{"headquarters":true,"address":"","locality":"Munich","region":"","postal_code":"","country":"Germany","phone":"+491701493615"}]}