{"id":"59275","name":"Perrit BV","tagline":"Helping our Partners to be at their best!","profile":"/profile/perrit-bv","website":"http://www.perrit.eu","directory":"it-services","page":"242","verified":"","description":"At Perrit we deliver hybrid cloud business solutions, ranging from reliable process automation for release, deploy, provisioning and billing scenarios to enterprise grade Portfolio Management. Public and private companies across all industries rely on Perrit’s hosted service offerings including: Dynamics CRM, Dynamics NAV, Dynamics AX, SharePoint Server, Visual Studio, BizTalk, ODIN and a broad variety of ISV solutions.\nPerrit has unparalleled experience building and operating innovative cloud services that are widely used. This first-hand experience gives us rich insight on what it takes to efficiently run Cloud Services for your customers. We then bring you these insights as Application Lifecycle Management and Service Management Solutions so you can benefit from our learnings.\nMetering, Billing and Invoicing solutions are a core component of our Service Portfolio. Wheter based on commercial solutions like ODIN or home grown solutions, we can help you implement, streamline and expand these solutions.\nOur experience with the System Center based Microsoft Cloud OS solutions and other Hybrid Cloud Platforms is ensuring optimum service delivery towards your customers and fully protection of your assets from emerging threats.\nOur solutions allow your customers to easily extend their on-premises infrastructure to the data center of your choice thus creating the hybrid IT that their business requires. It is customizable with extensible interfaces so that you can provide high-value differentiated services to your customers thereby further growing your business.\nPerrit’s Cloud solution also helps you enhance your bottom line by providing tools to automate your agile processes and simplify operations and monitoring.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1996","locations":[{"headquarters":true,"address":"Sherwood Rangers 29","locality":"Hengelo","region":"OV","postal_code":"","country":"Netherlands","phone":"+31 74 750 12 20"}]}