{"id":"6068","name":"APPEK Mobile Apps","tagline":"We build apps that get featured on reddit!","profile":"/profile/appek-mobile-apps","website":"https://appekapps.com","directory":"directory/mobile-application-developers","page":"9","verified":"","description":"We make awesome apps from start to finish. We build dominant apps that generate lots of installs, rank in app stores, and get featured in the press.\nWe do not compromise. We build award-winning native mobile apps on IOS, Android, Windows Phone, and Blackberry. We also build gorgeous responsive design web apps that are mobile-friendly, rank high on Google, and convert like Hell.\nOur track record of building A-list apps that get lots of downloads and mentioned in the press speaks for itself:\nOur clients have generated millions of downloads. Our apps have gone viral on Reddit many times and our apps have been featured everywhere, including CNN, MTV, Fast Company Design, Venture Beat, Gizmodo, Wired, TechCrunch, Forbes, E! Entertainment Television, MacWorld, Mashable, Optimizely, Product Hunt, and many more. Our apps have generated millions upon millions of dollars in venture capital, while others have been acquired. We have a track record of building apps for funded start-ups, passionate entrepreneurs with ideas, and large, enterprise businesses.\nWe've built some extraordinary apps, including French Girls App, Beditations, ReferLocal, GiveGab, and others. Check out our case studies to learn more.\nProcess matters. Big time. That’s why we keep it simple, yet deliver big on results. We follow a 4-Step Process focused on delivering exceptional mobile app development (1) Strategy, (2) Design, (3) Development, and (4) Support.\nWe'd love the opportunity to build a world class mobile app or responsive design website for you.\nContact us at 877-217-2452 or learn more here!\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"62 South Main Street","locality":"Wilkes Barre","region":"PA","postal_code":"18701","country":"United States","phone":"877.217.2452"},{"headquarters":false,"address":"11 Ocean Limited Way, Suite 140","locality":"Moncton","region":"NB","postal_code":"E1C 0H1","country":"Canada","phone":"877.217.2452"},{"headquarters":false,"address":"112 W 34th St, Suite 1555","locality":"New York","region":"NY","postal_code":"10120","country":"United States","phone":"877.217.2452"}]}