{"id":"61845","name":"Distillery","tagline":"Business clarity. Software craft.","profile":"/profile/distillery","website":"https://distillery.com","directory":"directory/mobile-application-developers","page":"28","verified":"","description":"Discover, design, and develop business-defining software and digital experiences.\n \nDistillery is a full-service software design and development company. We've built iOS mobile apps featured by Apple, Android apps with millions of downloads and have taken startups to large successful exits. Distillery is a certified partner of Microsoft, IBM, PubNub, Oracle, and Google Cloud.\n \nWe offer a range of services for companies of every scale, from startups to enterprises. For startups, we can create a prototype to validate your idea, build a technical roadmap so you know how your product can be built, and put together everything you need to get funding or take your next step. When you’re ready, we can take your product from idea to launch and support you in every step of building your product and your company.\nFor enterprises, we can help you develop custom line-of-business apps or internal applications, either as outsourced efforts or by contributing talented engineers to your own efforts.\n \nFor companies of all sizes, we can stay with you post-launch, providing a wide array of support and resources to ensure your product and business gain traction. Whatever you need, we’re here for you, whether that’s the occasional check-up, feature expansion, or a brand new version.\nOur mission is to assist companies in building outstanding applications that serve their customers. We believe that the best way to create successful products is to create successful companies.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"2012","locations":[{"headquarters":true,"address":"301 Arizona Ave, Suite #250","locality":"Santa Monica","region":"CA","postal_code":"90401","country":"United States","phone":"310-776-6234"},{"headquarters":false,"address":"Nekrasovskiy pereulok, 75","locality":"Taganrog","region":"ROS","postal_code":"347922","country":"Russia","phone":""},{"headquarters":false,"address":"ulitsa Suvorova, 91","locality":"Rostov","region":"ROS","postal_code":"344022","country":"Russia","phone":""},{"headquarters":false,"address":"Shpalernaya ulitsa 2/4","locality":"Saint Petersburg","region":"LEN","postal_code":"191187","country":"Russia","phone":""},{"headquarters":false,"address":"Av. 24 de Septiembre 1536, 4th Floor","locality":"Córdoba","region":"X","postal_code":"X5004","country":"Argentina","phone":""},{"headquarters":false,"address":"Av. Paseo de la Reforma 296, 40th Floor","locality":"Ciudad de México","region":"DIF","postal_code":"06600","country":"Mexico","phone":""}]}