{"id":"6238","name":"Bayinteractive, Inc.","tagline":"Killer Apps for Mobile, Web and Devices","profile":"/profile/bayinteractive","website":"http://www.bayinteractive.com","directory":"directory/mobile-application-developers","page":"101","verified":"","description":"Bayinteractive is a full-service app development studio based in San Francisco. We offer complete custom development services for mobile and tablet applications, including strategy, design, development, testing, deployment and maintenance. Every member of our twenty person team is dedicated to ensuring that solutions developed are of the highest quality and scalability, and are designed to accommodate future needs of our clients.\nUsing a simple but consistently effective project process, we combine the best practices of agile development with vast user interface experience to deliver exceptionally successful applications. We service funded startups, leading brands, top-tier agencies, and Fortune 500 companies such as Symantec, McAfee, EMC, PG&E, McCann/WorldGroup, Broadcom, NuCompass, and Avery Dennison.\nCapabilities: * All major mobile platforms – iOS (iPhone & iPad), Android, BlackBerry, Windows Phone * Native apps, Web apps, and Hybrids (Sencha, JQMobile, JQTouch, PhoneGap) * Back-end development or integration with existing web services * Location/GPS detection and geo-coding, including check-ins and geo-fencing * Social/Business networks integration such as Facebook, Twitter, Salesforce, Google+ * Augmented reality through camera overlays and bar code/QR code scanning * Image Recognition and Barcode scanning * Accelerometer driven user input * Credit Card payment hardware integration * Video & Audio Streaming * Peer-To-Peer Bluetooth communication * Application usage analytics integration * Ad serving integration and custom implementations * Application publication through platform stores or Enterprise deployment\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2002","locations":[{"headquarters":true,"address":"575 Sutter St","locality":"San Francisco","region":"CA","postal_code":"94102","country":"United States","phone":"415.529.5000"}]}