{"id":"62444","name":"Human Interfaces","tagline":"Full-service, global-friendly UX/UI consultancy","profile":"/profile/human-interfaces","website":"http://www.humaninterfaces.net","directory":"web-designers","page":"1265","verified":"","description":"We are a full-service UX consultancy located in the innovative tech hub of Austin, Texas, and we are global-friendly. Our team of highly specialized researchers holds advanced degrees in UX, Human Factors, and HCI, and is well-versed in developing custom research solutions for any UX application - from hardware design to emerging technologies. We hope that you will join our extensive list of valued clients - from start-ups to Fortune 500 companies.\nAt Human Interfaces, we measure our success by the value that we are able to provide to you - 95% of our business is repeat and referral clients. Our goal is to deliver actionable advice and data-driven insights that increase user engagement, improve brand perception, ensure customer loyalty and satisfaction, and increase product adoption, usage (and profit). Whether you need to extend your teams’ bandwidth to focus on more strategic efforts or outsource all UX work to a team of highly specialized researchers, we can develop a custom solution that works within your budget and time constraints.\nNot only do we have the expertise to address even the most complex usability challenges, our state-of-the art research facilities were designed to cover any and all testing requirements. Our lab spaces are outfitted with high-zoom and remote-controlled cameras, HD video in observation rooms, 2D and 3D eye tracking capabilities, a direct screen capture of computers and mobile devices, and multiple recording and live-streaming options (so that you can watch or participate from anywhere in the world!).\nYou can rest assured that Human Interfaces' rigorous research approach will deliver accurate and timely results to support your strategic decisions in meaningful ways. Leave it to us to ask the right questions, to the right audience, using the right methods - we have been doing it for 15 years!\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2001","locations":[{"headquarters":true,"address":"8500 Bluffstone Cove","locality":"Austin","region":"TX","postal_code":"78759","country":"United States","phone":"512.340.0354"}]}