{"id":"63545","name":"Simple Idea LTD","tagline":"We build tech products for clients and partners.","profile":"/profile/simple-idea","website":"http://www.simpleidea.us","directory":"directory/mobile-application-developers","page":"97","verified":"","description":"At Simple Idea, we develop hardware and software that helps C Level Executives, reach their business goals and ultimately develop their business. \nWith over 15 years experience in complex technology design and development, I currently hold the title of CEO at Simple Idea LTD. Over the years, we have established ourselves in the technology industry and have shown true passion for growing businesses. \nWe have used this experience and expertise to help clients across a broad range of industries to turn their ideas into successful products. The Industries we work across include Big Data and Analytics, High Tech, Medicine, Lifestyle, etc. \nI am open to any inquiries or questions, feel free to reach out. \nWHAT WE DO: At Simple Idea, we are focused on Product Design and Development. We construct innovative hardware and software and have become an expert in it’s integration.  \nHOW IT HELPS: As a full stack Product Design & Development company, our services cover all aspects of the design process from concept creation to product commercialisation. We transform ideas into reality. \nHOW IT WORKS: We take on complex projects from an idea stage to building a prototype, manufacturing and distributing a product. We consult companies, entrepreneurs, venture funds and tech incubators and provide them with comprehensive design and technology. We have gained experience from the work we have done on various projects involving many startups boards, allowing us to assist others in seeing the wider picture of the project and not only the tech behind it.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2001","locations":[{"headquarters":true,"address":"Giborey israel 24","locality":"Netanya","region":"","postal_code":"","country":"Israel","phone":"+972-52-6826262"}]}