{"id":"6360","name":"Peoples Innovation","tagline":"Leading Software Development Company","profile":"/profile/peoples-innovation","website":"http://www.peoplesinnovation.com","directory":"directory/mobile-application-developers","page":"244","verified":"","description":"Welcome to Peoples Innovation\nThe creative web design Company that offers web solutions across the Mumbai, Uk, US, Canada & Europe. Peoples Innovation is one of the leading professional web design and graphic design Company in Mumbai, based in India. We provide many different services including Web design, Website development, Flash web design, Search engine optimization, E-commerce, 2D & 3D Animations, DI works, VFX, Content Management System, Brochure and Logo design.\nWe are a strong, experienced, motivated and highly professional team of web designers, website developers and internet marketing (SEO) executives in Mumbai. We are using the latest technology in website development; we are committed to providing website design solutions and web application services at a very affordable price. We believe in long-term relationships with our clients and it reflects in our work.\nWe design and build fresh, dynamic websites for organisations of all sizes. We can ensure that your online business strategy and designs are highly effective and tightly integrates with your day-to-day processes. Our leaders are seasoned professionals who have developed strong skills in analysing and designing precise and user friendly solutions for our clients. Peoples Innovation always makes sure that absolutely none of our clients leave unsatisfied. From e-commerce website development to the simplest logo design, Peoples Innovation works as per clients needs.\nThe whole process can be done over the phone and via email, but if you need to see someone face to face we can send one of our experienced designers out to you, to ensure that you only have to take the minimum amount of time out of your schedule.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2008","locations":[{"headquarters":true,"address":"165 Satra Plaza, Sectore 19D Vashi,","locality":"Navi Mumbai","region":"MH","postal_code":"400703","country":"India","phone":"+91.9930074475"}]}