{"id":"6427","name":"Custom Software Lab","tagline":"Custom Software & Web Development Company","profile":"/profile/custom-software-lab","website":"http://www.customsoftwarelab.com","directory":"directory/mobile-application-developers","page":"63","verified":"","description":"Custom Software Lab is made out of talented custom software developers and web designers that aim to provide customized and usable web and software solutions which maximize our client’s ROI. Our goals are simple; to visualize, to execute and to deliver a exceptional products to all our clients! We are a fully integrated web and custom software development company at your service.\n \nCustom Software Lab is a full service custom design and development company with a multitude of services, our range of in-house design and development services include Custom and Web Development, Custom Software, E-commerce Solutions, Custom Shopping Carts, Rich Internet Applications, Mobile Application Development, Website Marketing and White-label Development services.\n \nOur core technologies include PHP, Microsoft .NET, JAVA, C++, Adobe Air / Flex, iPhone, Android and Blackberry mobile platforms.\n \nWe create websites and custom software with a design that's both functional and appealing. We create systems that work magic and are easy to manage. Our goal is your success as that is how we measure our value to our clients. Backed by the industries only Lifetime Warranty, our clients have the piece of mind and reliability that they expect. Your success is our success. Visit us at Customsoftwarelab.com\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2001","locations":[{"headquarters":true,"address":"3030 NW Expressway Suite 200","locality":"Oklahoma City","region":"OK","postal_code":"73112","country":"United States","phone":"888.278.8125"},{"headquarters":false,"address":"9330 LBJ Freeway Suite 900","locality":"Dallas","region":"TX","postal_code":"75243","country":"United States","phone":""}]}