{"id":"6742","name":"Support One, Inc.","tagline":"We provide SAP software solutions and support","profile":"/profile/support-one","website":"http://www.supportone.us","directory":"it-services","page":"76","verified":"","description":"Providing the small to midsize business market with SAP certified solutions focused exclusively on SAP®Business One and SAP®Business ByDesign. Along with SAP’s premier business management solutions we also provide our team of U.S. based support. We don’t outsource our support, instead our customers work with the same team from the business discovery process through implementation and remain your support team for continuous development.\nWe have the tools, the people and the experience to bring you the best solution. Our team will provide customized solutions that provide real-time information that optimizes every business process by streamlining operations in order to help your business RUN BETTER. We are committed to our customers growth and optimization through the use of their SAP solutions. We strive to keep them informed and establish a relationship that is dependable with services and predictable with costs. We focus exclusively on SAP®Business One and SAP Business ByDesign, SAP’s premier business management solutions for small and midsized companies. Support One is a leader in providing sales, consulting, implementation, hotline support, integration and software development services. With our deep subject matter expertise in manufacturing, distribution, retail, healthcare and more, we are ready to assist you in deploying the appropriate SAP® Solution. Some of our accomplishments are: •Support One received SAP’s “Software Solution Partner of the Year” award in 2009 •Support One was named Global Solution Partner of the Year – North American Region in 2009 •Support One, Inc. achieved Gold Level status with SAP in 2011\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"","locality":"Golden","region":"CO","postal_code":"80401","country":"United States","phone":"+1.888.349.6046"}]}