{"id":"68224","name":"ManekTech","tagline":"Microsoft Gold Certified Partner","profile":"/profile/manektech","website":"http://www.manektech.com","directory":"directory/mobile-application-developers","page":"26","verified":"","description":"ManekTech has been recognised by Microsoft for offering best-in-class solutions to customers, recently announcing its achievement of Microsoft Certified Partner Gold status as a Application Development. ManekTech is a full services Mobile Apps and Software Development company, a company of humble beginnings, began with a handful of professionals who set out to bring reliable, cost effective solutions, to a growing technology world.\n Our customers value our technical expertise and business savvy, and this is why we have clients in the United States (USA), the United Kingdom (UK), Netherlands, Greece, Spain, Saudi Arabia, Sweden, Australia and South Africa.  Throughout out eight-year story, we have successfully established business relationships with over 300 companies globally, and we have completed over 2,000 projects. \nManektech, one stop destination for all your technical solutions.  Not only do we have an incredible team of technical experts, we work on so many different types of projects, that we always have someone in the company who can provide tribal knowledge and guidance from prior project experience.  Our development experience includes platforms Microsoft.net, Android, iOS, PHP, WordPress, Shopify, DotNetNuke (DNN), IOT, Angular JS, Magento, Ionic, Node JS and Larvel. \nASP.Net Desktop App Development\nASP.Net Web App Development\nASP.Net Enterprise Solutions\nCustom Web Application Development  \nCustom Software Development\nWeb Application Development\nEnterprise mobile application development\nM-Commerce app development\nManekTech aims to deliver the right solution to the client on a much stipulated time. We have dedicated and professional group of people who are always on their toes to give you best. Our grip on latest technology will address the perfect solution of client’s need. \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2011","locations":[{"headquarters":true,"address":"4th Floor, Timber Point, Beside Kotak Mahindra Bank, Near Prahaladnagar Garden, Prahaladnagar Road,","locality":"Ahmedabad","region":"GJ","postal_code":"380015","country":"India","phone":"918511428441"},{"headquarters":false,"address":"Suite 1 -454, 7558 W. Thunderbird Road,","locality":"Phoenix","region":"AZ","postal_code":"85381","country":"United States","phone":"+1-623-845-2747"}]}