{"id":"68624","name":"Tatiana Designs Inc","tagline":"We help businesses to get more paying customers","profile":"/profile/tatiana-designs","website":"http://tatianadesigns.com","directory":"web-designers","page":"134","verified":"","description":"Tatiana Designs Search Engine Marketing is an internet marketing firm built to over-deliver for every client it accepts. They have developed a specialized team of SEO strategist, visual designers, social media mavens, conversion optimizers, and coders. By pioneering new methods, they have found success where others have failed. Tatiana Designs is about being transparent with customers and getting results.\nWhile they don’t guarantee rankings, they excel at delivering substantial value for their clients and promise professional services backed by results.\nWe collaborate with clients who have:\nA healthy as well as an active business already. Our services are for companies that are up & running currently and are ready to ramp things up to the next level.\nA steady flow of leads and customers. This means that you’re getting consistent traffic and making sales already. You do not have to be a household name … You just need to be PRESENT in your market.\nA good, solid product as well as a good reputation. Everything we do together will certainly not only be bringing you more earnings and also sales, but we’ll be doing it in such a way that develops MASSIVE a good reputation in your market.\nOur clients a healthy, active business. Our services are for companies that are up and running currently, are ready to ramp things up to the next level. A steady flow of leads & customers. This means that you’re getting consistent traffic and making sales already. You do not have to be a famous name. You just need to be PRESENT in your market. A good, solid product, a good reputation. All we do together will be bringing you more earnings & sales, develop MASSIVE good reputation in a market.\nOur clients: https://nordicsaga.com, www.east-west-tours.com, https://siberianhealt...\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"2 - 9","founded":"2008","locations":[{"headquarters":true,"address":"","locality":"Seattle","region":"WA","postal_code":"98101","country":"United States","phone":""}]}