{"id":"70325","name":"Pyrite Technologies","tagline":"SEO and Social Media Marketing Services","profile":"/profile/pyrite-technologies","website":"https://www.pyritetechnologies.com","directory":"seo-firms","page":"48","verified":"","description":"We believe in constantly learning and strive to master all trends in the dynamically changing world of internet marketing. Our unfailing dedication to our work and providing the best service possible is what sets us apart.\n \n \nOUR SERVICES\nPyrite Technologies offers a wide range of services that get you on the map and help you stay there, building an online presence that endures. Whether you want to create a new presence or build upon your existing image, we have you covered either way! We help you formulate practical visibility goals and reach them by inbound marketing and content development strategies.\nSearch Engine Optimization\nSocial Media (Organic & Ads)\nContent Marketing\nInbound Marketing\nConversion Optimization\nEcommerce SEO\nOnline Reputation Management\nPower Link Building\nBranding\nVideo Marketing \nYouTube SEO\nWordPress Development\nGoogle AMP, Structured Data, Schema, Apps\nC-Level Training\nPyrite Technologies is ACORE – Adaptable, Consistent, Open, Reliable and Efficient. We believe in constantly learning and updating ourselves on the dynamic world of internet media, because in our trade, if you’re not adaptable to change, you can’t get anywhere. Our greatest reward is customer satisfaction, which we hope to achieve by consistently delivering results and maximizing outputs. We also believe that the best results come out of a collaborative open forum, so our customers are more than welcome to get involved in working with us.\n \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2012","locations":[{"headquarters":true,"address":"Plot No. 1-98/8/2/1, Block A, 2nd Floor, Eternal Samyuktha Towers, Vittal Rao Nagar","locality":"Hyderabad","region":"","postal_code":"500081","country":"India","phone":"+91.9985219503"},{"headquarters":false,"address":"111 North Market Street, Suite 300","locality":"San Jose","region":"CA","postal_code":"95113","country":"United States","phone":""}]}