{"id":"7080","name":"Jade Global","tagline":"Technology Partner to the Digital Enterprise","profile":"/profile/jade-global","website":"http://www.jadeglobal.com","directory":"it-services","page":"77","verified":"","description":"Jade Global provides enterprise business application implementations, integrations, software product engineering, Cloud services, technology advisory, testing, and managed services. We are headquartered in San Jose, California with U.S offices in Philadelphia, Los Angeles, and San Diego. Jade Global is an Oracle Platinum Cloud Select Partner, Salesforce Silver Partner and ServiceNow Silver Partner.\nOur additional partnerships with Dell Boomi, NetSuite, Microsoft, Zuora, and Tableau allow us to design robust solutions for a variety of industries and client needs.\nJade Global is committed to our customers’ long-term business growth and success. We create value through a portfolio of IT services delivered by highly skilled and experienced consultants. Clients rely on our trustworthy advice to derive value from software investments and gain business efficiencies by leveraging our ability and knowledge of best practices. Being the right size gives us the extraordinary flexibility to pass on cost benefits to our clients. Jade Global is well-positioned to be your strategic IT services partner for enterprise business application implementations and software product engineering.\nJade is a member of the Oracle Cloud Excellence Implementor (CEI) Program and has been recognized as one of the fastest-growing companies in North America by Inc. 5000.\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"2003","locations":[{"headquarters":true,"address":"1731 Technology Drive, Suite 350","locality":"San Jose","region":"CA","postal_code":"95110","country":"United States","phone":"408-899-7200"},{"headquarters":false,"address":"1140 Welsh Road, Suite 250","locality":"North Wales","region":"PA","postal_code":"19454","country":"United States","phone":"215-692-8223"},{"headquarters":false,"address":"Nyati Tech Park, 7th floor, Digambar Nagar Wadgaon Sheri","locality":"Kalyan","region":"","postal_code":"411014","country":"India","phone":"+91-20-66128200"},{"headquarters":false,"address":"PSR Prime Tower Unit No.503, 5th Floor, Sy.No.126, Beside DLF","locality":"Cyber City, Gashibowli Hyderabad","region":"","postal_code":"500032","country":"India","phone":"+91-040-67206600"}]}