{"id":"7086","name":"Lightspeed mobile labs","tagline":"We help in Cost reduction with quality","profile":"/profile/lightspeed-mobile-labs","website":"http://www.lightspeedml.com","directory":"directory/mobile-application-developers","page":"124","verified":"","description":"We lightspeedml are a company situated in Fremont, CA with an offshore development center in Bangalore, India. Our expertise in Mobile Application Solutions has been prominent for the past 6 years, with many industry leading individuals. lightspeedml offers mobile application development services for Android and iPhone/iOS platforms.\nWe have accumulated enough experience in cross-platform development to offer fast and efficient approach to porting Android applications to iPhone, Windows Mobile, Blackberry and J2ME phones Core Strength 1) Experienced Management team with background in mobile and enterprise technology 2) Expertise in IP, Framework and tool development 3) Multi-faceted services including Mobile Application Development, Server development, and QA services 4) Fully fledged Android & iPhone Lab 5) GPS Navigation and Travel Guides 6) GPS tracking and dispatching 7) enterprises solution 8) Social media apps and Games 9) web Development 10) Embedded services Key Achievements 1) developed and deploy Android TV solutions in APAC 2) developed multi-portal dynamic Caller ID solutions for Android 3) implement internet based location aware advertisement terminals based on Android platform 4) One of the first company to develop fully customized Contact Manager Skill sets we offer 1.Java, EJB, Servlets, JSP Websphere, Weblogic, RPG/ILE, i Series, PHP, Perl. Grails 2.Microsoft .Net, ASP, SOAP, XML, SOA. 3.MS-SQL Server, Oracle, Sybase, DB2 . 4.IPhone, Android, Blackberry,j2ME,Symbian,Palm OS ,Wap 5.I have a team of 22 member strong (dev + QA) on .Net, ASP, PHP, (CMS) Joomla, Drupal, Magento, and Java programmers.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2006","locations":[{"headquarters":true,"address":"44790 S. Grimmer Blvd, Ste 202,","locality":"Fremont","region":"CA","postal_code":"94538","country":"United States","phone":"510.943.5090"}]}