{"id":"7095","name":"NaviSite","tagline":"A Time Warner Cable Company","profile":"/profile/navisite","website":"http://www.navisite.com","directory":"it-services","page":"113","verified":"","description":"NaviSite, a Time Warner Cable Company, is a leading worldwide provider of enterprise-class, cloud-enabled hosting, managed applications and services. NaviSite provides a full suite of reliable and scalable managed services, including Application Services, industry-leading enterprise hosting, and managed cloud services for enterprises looking to outsource IT infrastructure and lower their capital and operational costs.\nEnterprise customers depend on NaviSite for customized solutions, delivered through a global footprint of state-of-the-art data centers. For more information about NaviSite’s services, please visit www.navisite.com. \nNaviSite Managed Cloud Services (MCS) improves enterprise IT efficiency and agility with on-demand provisioning and usage of elastic IT services. Whether supporting seasonal computing demand spikes, creating robust and cost-effective software testing and development environments, or building full application lifecycle management for mission critical enterprise applications, NaviSite MCS is the premier cost-effective enterprise-class cloud computing service. \nNaviSite’s cloud-enabled enterprise infrastructure and application expertise offers an unparalleled ability to deploy in highly complex environments with customizable and scalable solutions.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"1997","locations":[{"headquarters":true,"address":"400 Minuteman Road","locality":"Andover","region":"MA","postal_code":"01810","country":"United States","phone":"877.485.9251"},{"headquarters":false,"address":"5th Floor, DST House, St Mark’s Hill Surbiton,","locality":"Surrey","region":"","postal_code":"KT6 4QD","country":"United Kingdom","phone":"+44 (0)800-612-2933"},{"headquarters":false,"address":"Vipul Orchid Plaza Golf Course Road, Sector 54, Suncity,","locality":"Gurgaon","region":"HR","postal_code":"122002","country":"India","phone":"+91 124 4913300"}]}