{"id":"7099","name":"Ataway","tagline":"People. Process. Systems.","profile":"/profile/ataway","website":"http://www.ataway.com","directory":"it-services","page":"371","verified":"","description":"We are your ERP and business process experts.\nAtaway was founded by PeopleSoft Finance consultants more than 15 years ago. Expertise in the product was our key differentiator early on, which helped us build our reputation as a team of global application experts.\nThis expertise became a cornerstone of our ability to cover a wider scope of increasingly complex projects, while building the necessary infrastructure to support these projects at the same time.\nIn order to better serve our customers, Ataway has now extended its scope to not only PeopleSoft Finance, but also to the entire Oracle ERP family (PeopleSoft, Campus Solutions, eBusiness, Oracle Cloud). We now cover all back office processes, including Finance, Human Resources, Payroll, Customer Relationship Management, Supply Chain Management and Procurement.\nFrom an infrastructure standpoint, Ataway is now present in 12 countries around the world with more than 440 consultants.\nOur three Service Centers in Shanghai, Mexico and Buenos Aires enable us to provide offshore solutions for the most recurring ERP needs: Application Maintenance, Functional and Technical Support, Upgrade, Application Hosting, Training, Offshore Development and Testing. We are also currently investing in Europe, where we plan to set up a new center to better serve our customers.\nOver the past 15 years, Ataway has focused its efforts on developing the teams and tools necessary to better serve our customers’ ERP and back office needs.\nWith our product expertise remaining at the core of how we define ourselves, Ataway continues to deliver more value to our customers.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"250 - 999","founded":"2000","locations":[{"headquarters":true,"address":"6111 Bollinger Canyon Road Suite 455","locality":"San Ramon","region":"CA","postal_code":"94583","country":"United States","phone":"+1.925.241.7716"},{"headquarters":false,"address":"","locality":"Shanghai","region":"31","postal_code":"200000","country":"China","phone":""}]}