{"id":"71186","name":"Revolve","tagline":"Health-care software development","profile":"/profile/revolve","website":"http://revolve.pro","directory":"directory/mobile-application-developers","page":"77","verified":"","description":"Who we are?\nRevolve provides qualified full-stack, dedicated and self-managing software development teams for life-science and health-care projects. We believe that we are a good fit for projects where data privacy, security and high quality is required. Revolve is a founding member of SoDA – Software Development Association Poland.\n \nWhat we do?\nWe design, build and supervise the development of digital products. We use design sprints methodology to fine-tune the business idea. We provide dedicated development teams to build, develop and maintenance tech products. Finally, we are offering CTO consultancy and project management throughout the whole development process from the planning of the architecture design and choice of technology, through development to product launch and maintenance. \n \nFull-stack developers with opinions\nWhat do we mean by that? We appreciate honesty and open feedback and we build relationships based on trust and quality.\n \nWhy us?\nRevolve has a strong and young dedicated and creative culture. We are really good at speaking English, and we have extensive experience working with international tech companies and startups. We have developed several MVPs and digital products for customers in Germany, Denmark, Sweden, UK, Poland and the U.S.\n \nWhy Katowice?\nKatowice is a UNESCO City of Music. It is a vibrant place with fantastic infrastructure and great to live in. The city is the capital of a metropolis of over 40 cities that have merged, with a population of over 2 million. Two international airports both with less than 1-hour drive support our office located in quiet southern part of the city. We are also supported by several big universities.\n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2015","locations":[{"headquarters":true,"address":"Porcelanowa 19","locality":"Katowice","region":"SL","postal_code":"40-246","country":"Poland","phone":"+48 695 400 481"}]}