{"id":"7164","name":"Cornerstone Consulting","tagline":"Technology and World Class Service","profile":"/profile/cornerstone-consulting","website":"http://www.cornerstoneconsultinginc.com","directory":"it-services","page":"140","verified":"","description":"For more than 25 years, Cornerstone has provided innovative, powerful and streamlined ERP business management software solutions to numerous small and midsized businesses. Cornerstone is also renowned as a premier provider of Sage ERP Software customer service and support to businesses in and around the Tampa Bay Area of Florida. Cornerstone Consulting Inc.\nis a reseller of Comgine’s (http://www.Comgine.com) integrated e-commerce applications as well as a leading provider of Sage Software and SAP Business One business management software solutions to small and mid-market organizations. Founded in 1983, Cornerstone Consulting, Inc. is a privately-owned company that provides a full suite of information technology for numerous small and mid-sized business clients in North America, Europe, South America, the Caribbean and Canada. Cornerstone provides clients with the ability to make faster business decisions, experience profitable growth and outperform the competition through the use of integrated, unified, streamlined, simple-to-use, scalable and customizable software. Our products and services support accounting, operations, customer relationship management, human resources, and the specific needs of the wholesale distribution, pharmaceutical, nutraceutical and manufacturing industries. Cornerstone’s services include: system integration for LAN, WAN, VPN, wireless and Internet networks, Custom Programming, EDI, Barcodes and Scanning, RFID, E-commerce, Website Design and Hosting, Security, Networks, Remote Monitoring, VOIP, as well as Custom Web Application Development.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"1983","locations":[{"headquarters":true,"address":"5550 West Executive Drive Suite 240","locality":"Tampa","region":"FL","postal_code":"33609","country":"United States","phone":"+1.813.321.1300"}]}