{"id":"7195","name":"Genius Business Solutions","tagline":"Transforming Business With Genius Solutions","profile":"/profile/genius-business-solutions","website":"http://www.geniusbsi.com","directory":"directory/mobile-application-developers","page":"159","verified":"","description":"Genius BSI consists of a group of senior business management software solutions consultants, specialized in working on business management software implementations  for past 10+ years. The Company has earned expertise in business consulting in Supply Chain Management ( SAP SCM EWM, SPP,APO) , Business Process Reengineering and Business management software implementations (SAP Business One, SAP SCM, SAP ECC) while serving local, national and global customers.\nConsulting and IT Services from Genius BSI focus on defining, optimizing and aligning our client's IT initiatives with Business strategy. We believe that business and technology work hand-in-hand. A proper understanding of this synthesis motivates every engagement, enabling us to deliver technology solutions that give our customers a decisive competitive advan age with a long term positive financial performance.\nWe are experts at making technology drive business-process efficiencies. Our ultimate goal is to become a trusted business advisor in a long-term, mutually beneficial relationship with our customers by delivering integrated IT solutions for effective  business management.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"3403 76th St","locality":"Moline","region":"IL","postal_code":"61265","country":"United States","phone":"309.269.2551"},{"headquarters":false,"address":"17-18 Omkar Industrial Premises Pradhikaran , Midc , Bhosari","locality":"Pune","region":"","postal_code":"411026","country":"India","phone":"9850092484"},{"headquarters":false,"address":"","locality":"Davenport","region":"IA","postal_code":"52722","country":"United States","phone":""}]}