{"id":"7230","name":"Robocom","tagline":"Supply Chain Management Software Configured to Fit","profile":"/profile/robocom","website":"http://www.robocom.com","directory":"it-services","page":"204","verified":"","description":"Since the early 1980’s, Robocom has focused on developing and implementing supply chain execution software solutions. Our systems include warehouse management, labor management, voice picking, delivery tracking, enterprise transportation software for LTL and TL businesses and enterprise resource planning software for distributors. Robocom is focused on the needs of business leaders responsible for the day-to-day results in warehousing, distribution, transportation and trucking operations.\nOur professionals are experts at solving supply chain execution problems through the application of our supply chain software solutions.\n \nYour cost of operations - the bottom line cost of your supply chain operation  – is our primary concern.  Our products improve accuracy, increase productivity, reduce transportation costs and provide essential information to Supply Chain Managers and Executives. \nTake a closer look at Robocom and you will find a company driven to help you implement solutions that reduce your costs by meeting the exact needs of your Supply Chain.  Our state of the art software products have a modular and configurable structure.  That means we can implement different combinations of products; and within each module we can configure existing software to fit your exact requirements.  Supply Chain Software designed to fit your requirements and deliver maximum benefits.\nWe are known for our flexibility and our ability to meet exact requirements.  We have the people and skills to deliver software that fits your requirements in a timely manner, and at a cost that generates an impressive payback.  We have been in business since 1981 and we employ over forty supply chain software professionals.  Our future is bright – we are profitable and financially sound, well positioned to grow through acquisition and dedication to our customers.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"50 - 249","founded":"1982","locations":[{"headquarters":true,"address":"1111 Broadhollow Road, #100","locality":"Farmingdale","region":"NY","postal_code":"11735","country":"United States","phone":"631.753.2180"},{"headquarters":false,"address":"455 Cochrane Drive, #20","locality":"Markham","region":"ON","postal_code":"L3R 9R3","country":"Canada","phone":""}]}