{"id":"7305","name":"Outsourcing Programming Services","tagline":"A Company Providing Complete ITO Services India","profile":"/profile/outsourcing-programming-services","website":"http://www.outsourcingprogrammingservices.com","directory":"directory/mobile-application-developers","page":"111","verified":"","description":"Outsourcing Programming Services, established in 1992 delivers software development and technology consulting across USA, Canada, UK, EU, Middle East and Australia.\nSuccessful delivery of more than 5000 projects to small and medium size businesses and fortune 500 companies spread across more than 50 countries worldwide, has established OPS as a well-known name in the outsourcing circles. We have a proven track record, and our endless pursuit towards developing and delivering perfect quality solutions has earned us a loyal clientele.\nService Offering: \nCustom Web Design & Development\neCommerce Development & CMS Customization\nMobile Application Development – Android, iPhone, Windows Phone\nEnterprise Solutions by Microsoft Dynamics CRM, NAV, and AX\nSharePoint Development - Portals and Collaboration\nBusiness Intelligence (BI) & Enterprise Mobility\nCustom Software Application Development\nWe have evolved, since our inception in 1992, into a company that is known for operational excellence, reliable service delivery, best client support and convenient pricing options. Members of STPI, GESIA and GCCI we empower our clients from industries like construction, healthcare, automotive, government organizations, media and publishing etc., to tap market opportunities and drive business growth through complete IT support.\nFor more information, please email us at info@outsourcingprogrammingservices.com.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"1992","locations":[{"headquarters":true,"address":"401, Hi-Tech House, Near Gurukul Tower, Gurukul, Ahmedabad","locality":"Ahmedabad","region":"GJ","postal_code":"380052","country":"India","phone":"+91.794.000.3266"}]}