{"id":"7409","name":"FMT Consultants, LLC","tagline":"Providing Powerful Business Technology Solutions","profile":"/profile/fmt-consultants","website":"http://www.fmtconsultants.com","directory":"it-services","page":"95","verified":"","description":"FMT Consultants, LLC is a leading provider of integrated business solutions and information technology services throughout the US and Canada with a significant presence in San Diego County, Orange County and Los Angeles County.\nFMT Consultants offers service delivery in the following areas:\nAccounting and ERP Solutions, utilizing Microsoft Dynamics GP and SAP Business ByDesign\nBusiness Intelligence\nCustomer Relationship Management Systems, utilizing Microsoft Dynamics CRM\nCustom .NET Development and Integration Services\nCollaboration and Workflow Solutions, Corporate Intranets and Line of Business Applications utilizing Microsoft SharePoint\nEcommerce\nExchange: Planning, Implementation, Migration\nVirtualization: Server, Desktop, Application, VDI\nSystem Center: Planning, Design, Implementation\nCloud Services: Windows Azure, Dynamics CRM, Windows Intune, Office 365\nServer, storage and networking solutions\nSince 1995, FMT Consultants has been working with clients to architect and deliver high-quality, affordable technology solutions that help them run their businesses better. As an authorized Microsoft Dynamics GP Gold Partner, Microsoft Dynamics CRM Silver Partner, SAP Partner and Dell Partner, FMT Consultants provides clients with the products and support they require for continued growth. FMT’s expertise includes analyzing, designing, implementing, developing and integrating multiple software and hardware systems, as necessary, to optimize client’s business processes and achieve their goals. In addition to doing project-based work, FMT provides support services for numerous clients in a variety of industries in order to assist them with their ongoing, day-to-day solution needs.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1995","locations":[{"headquarters":true,"address":"5451 Avenida Encinas, Suite A","locality":"Carlsbad","region":"CA","postal_code":"92008","country":"United States","phone":"760.930.6400"}]}