{"id":"7446","name":"Zensar Technologies","tagline":"Your Transformation Partner","profile":"/profile/zensar-technologies","website":"http://www.zensar.com","directory":"it-services","page":"11","verified":"","description":"Zensar Technologies (Zensar) is a globally renowned software services company that specializes in providing a complete range of software services and solutions. Zensar is ranked amongst India's Top 20 Software Services Companies by the National Association of Software and Services Companies (NASSCOM), and is also recognized by the Department of Scientific and Industrial Research (DSIR) for its robust in-house Research and Development practices.\nOur software services range from the traditional to the transformational – Enterprise Product Implementation and Hosting, Business Intelligence and Data Warehousing, Collaboration and Knowledge Management Services, Business Process Outsourcing and Optimization, Remote Infrastructure Management and Testing, and the entire range of Software Application Planning, Portfolio Building, Development, Migration and Support.\nZensar is the world's first enterprise-wide SEI CMM Level 5 Company and enjoys a strong presence in the United States, Europe, Africa, Middle East and Asia-Pacific regions. To service global customers, Zensar has delivery centers in Pune, Hyderabad and Bangalore in India, China, Japan and the UK. With 7000+ associates, 400+ customers and 14 nationalities operating in more than 20 global locations, Zensar helps transform Global Corporations.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"1,000 - 9,999","founded":"1991","locations":[{"headquarters":true,"address":"","locality":"Pune","region":"MH","postal_code":"411014","country":"India","phone":"+91.20.66074000"},{"headquarters":false,"address":"","locality":"Hyderabad","region":"","postal_code":"","country":"India","phone":""},{"headquarters":false,"address":"","locality":"Kalyan","region":"MH","postal_code":"","country":"India","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":""}]}