{"id":"75182","name":"Avra Software","tagline":"IT Simply Works","profile":"/profile/avra-software","website":"http://avra.pl","directory":"web-developers","page":"41","verified":"","description":"Avra Software is a team of experts who’s working everyday for the success of your business. using the available tools and technologies, we provide  and implement solutions and IT systems for clients.\n \nAvra in numbers:\n15 years on the market\n65  specialists on site in our HQ\n10 years - our clients stay with us for a long time\n100% satisfied clients\n30 certificates- Oracle, Scrum, Java, Mule, ISTQB\nSCRUM - we are agile software house\n \nWe started as a one-person comapny, and now we are working in 65- person team. But our main goal - doing good IT - remain the same.\nWe specialise in the network systems which make the information management and processing easier. We also implement the data exchange modules between the existing systems. Whenever you need to connect a number of the legacy and the new IT systems, our experience will be useful in such operations.\n \nWhat we offer:\n-CUSTOM SOFTWARE DEVELOPMENT We implement full service systems. Every time we start with analysis, then  we model processes. With this knowledge, we design and implement web dedicated systems (full size and mobile), so that they are perfectly tailored to your business.\n \n-VERTICAL SYSTEM INTEGRATION Do you need to integrate old systems with the new ones? We combine the old systems with the new interfaces and we provide the full interoperability. We love the challenge.\n \n-SERVICING AND SYSTEM MAINTENANCE If you need a high availability hosting with an accessibility guarantee for end users, you have found the right place.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"50 - 249","founded":"2004","locations":[{"headquarters":true,"address":"Powstańców Śląskich 7a","locality":"Wrocław","region":"DO","postal_code":"53-332","country":"Poland","phone":"+48.603.431.529"}]}