{"id":"7584","name":"Kogi Mobile","tagline":"Custom Mobile App Development House","profile":"/profile/kogi-mobile","website":"https://www.kogimobile.com","directory":"directory/mobile-application-developers","page":"27","verified":"","description":"Kogi Mobile is a mobile application development house based in Miami, Florida. We specializes in building native mobile applications and web apps (HTML 5) for iOS, Android operating systems. All our development work is done by our in-house, end-to-end mobile app developers and not a single line of code is outsourced. \nThe business founded in February 2011 currently has over 20 mobile specialists, the majority are developers supported by project managers, designers and QA personnel. We have experienced teams of iOS, Android, HTML 5 and back end developers who have developed 100s of Mobile apps and mobile web sites whilst working within the Kogi business. We have developed apps and sites for every market sector. The majority of our work is for blue chip, Fortune 500 companies.\nWithout great processes and project management you cannot achieve great results and quality products and services. We have a team of experienced project managers, QA and support staff who have already worked on over 100 projects within the business. We work using agile techniques, providing iterative releases and updates for our customers throughout the project lifecycle.\nMany customers still overlook the requirement for support for mobile applications and sites. If a product is not standalone, i.e. it is dynamic with feeds then something can go wrong. When this happens the developer is often called to investigate the changes, after the project has been signed off. Also clients often want small changes or UI fixes to their apps or sites after consumer feedback for small releases. We offer monthly ongoing support for a small fee which includes development time as well as daily health checks of how your site is or application is functioning.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"400 NW 26th Street","locality":"Miami","region":"FL","postal_code":"33127","country":"United States","phone":"786.374.2303"},{"headquarters":false,"address":"158 Roebling Street","locality":"Brooklyn NY","region":"NY","postal_code":"11211","country":"United States","phone":"347.480.1042"},{"headquarters":false,"address":"Cra 40 # 10-44","locality":"Medellin","region":"ANT","postal_code":"","country":"Colombia","phone":"+57 (4) 581-0555"},{"headquarters":false,"address":"333 Las Olas Way, CU1","locality":"Fort Lauderdale","region":"FL","postal_code":"33301","country":"United States","phone":"786.374.2303"}]}