{"id":"77871","name":"IntelligentBee","tagline":"Web And Mobile Development, Technical Support","profile":"/profile/intelligentbee","website":"http://intelligentbee.com","directory":"directory/mobile-application-developers","page":"36","verified":"","description":"Born from the need of a custom software development company that gathers full-stack dedicated developers and skilled technical support associates, IntelligentBee is fully integrating into your existing teams or culture, acting as your own extension and delivering flawless implementation for your ideas. Our development shop is among premium JS companies on the US market and our developers are experts in NodeJS, ReactJS, PHP/Symfony, Go Lang, HTML5 and CSS3, iOS and Android.\nWe successfully completed lots of projects and we continue to be there for our clients long after the project is done, offering outsourced customer support and maintenance. We treat every project as our own and we feel responsible for its success.\nWe differentiate ourselves by providing full-stack development and customer support teams who are managed, trained, self-sufficient and swiftly align to our client's business objectives, that they can hire either by project or as an extension to their existing team.\nWe provide 24/7 Outsourced Technical and Customer Support Tailored For Your Business Needs, prioritizing your customers’ happiness in providing your product support. With our chat and email support services, you can be available every day, all the time.\nWe closely monitor the response time (SLA) and support health score (SHS) having as final scope to satisfy business requirements and drive customer loyalty.\nOur Mission is to improve the quality of online by creating and maintaining web and mobile apps and offering outsourced customer support that delivers significant value to their customers.\nWe do that by providing both strategic and tactical knowledge with qualified teams executing against a proven process and using the latest technology available. Tell us about your project, be it software or customer support. We'll be in touch right away. costi@intelligentbee.com\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2010","locations":[{"headquarters":true,"address":"Str. Vasile Lupu, 78, bloc N4 (Newton)","locality":"Iasi","region":"IS","postal_code":"700350","country":"Romania","phone":"+40 745 769760"}]}