{"id":"78167","name":"OrangeMantra","tagline":"Digital Transformation Services","profile":"/profile/orangemantra","website":"https://www.orangemantra.com","directory":"directory/mobile-application-developers","page":"34","verified":"","description":"OrangeMantra has come a long way since its inception almost two decades ago, and stands as a reliable digital transformation consulting partner for enterprises, small businesses, and startups. Our service portfolio is a diverse one, encompassing a wide range of digital transformation services comprising the following:\n \nWeb development\nMobile app development\nE-commerce development\nEnterprise application development\nBig data and analytics\nProduct engineering\nSoftware engineering for cloud platforms, and more\n \nOver the years, we have served a global clientele from varied industry verticals including healthcare, automotive, e-commerce, retail, manufacturing, public sector, media and publishing, and more. A successful track record along with a team of experts with versatile skills and experience make us capable of delivering value-adding services for the clients. Further, we follow a proven methodology that focuses on agile approach to deliver projects within timelines and up to the satisfaction levels of the clients. We are also acclaimed for the top-notch solutions that propel business growth and offer value for money.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2001","locations":[{"headquarters":true,"address":"650, 6th Floor, Tower A Spaze iTechPark, (Above Shoppers Stop) Sector-49, Sohna Road","locality":"Gurgaon","region":"","postal_code":"122018","country":"India","phone":"+91-9870289050"},{"headquarters":false,"address":"1201 Orange St. Suite,814 Wilmington,","locality":"Delaware","region":"DE","postal_code":"19801","country":"United States","phone":"16808001190"},{"headquarters":false,"address":"30 Stratton Tce,","locality":"Wynnum","region":"QLD","postal_code":"4178","country":"Australia","phone":""}]}