{"id":"7916","name":"M-Files","tagline":"Simply Easy Document Management","profile":"/profile/m-files","website":"http://www.m-files.com","directory":"it-services","page":"192","verified":"","description":"M-Files Corporation (formerly Motive Systems) develops M-Files, an award-winning enterprise content management system (ECM) and M-Files Cloud Vault, which runs on the Windows Azure platform. M-Files is easy to deploy, learn and use, and has enabled thousands of companies and organizations of all sizes in over 90 countries to make dramatic gains in efficiency and productivity by improving the way they organize and manage their business documents, information and processes.\nM-Files is available in 24 languages and is in use at customers such as AstraZeneca, the United Nations Environmental Program, Securitas, EADS, Flybe Airlines and Parker Hannifin.\nOther electronic document management software (EDMS) exists to help you meet your needs, but only M-Files has the features and functions that exceed all expectations. Offering a host of innovative features, M-Files allows users to customize how vital electronic documents are stored and control how crucial digital information is collected, updated, and corrected. The ability to seamlessly integrate into Windows applications makes M-Files a stand-out EDMS, instantly recognizable and extremely easy to use. Meta-tagging capabilities and the use of a single virtual data repository lets you store documents quickly and efficiently, minimizing wasted disk-space and data redundancy.\nOur outstanding customer service and exceptional technical support assist you in optimizing the use of your electronic management systems, taking control of data disarray and eliminating confusion. We urge you to contact us with any of your EDMS-related questions. Our customer and support services will help you also in all M-Color questions.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"2 - 9","founded":"1990","locations":[{"headquarters":true,"address":"5050 Quorum Dr., Suite 600","locality":"Dallas","region":"TX","postal_code":"75254","country":"United States","phone":"972.516.4210"}]}