{"id":"79238","name":"Codedesign.org","tagline":"Codedesign - digital marketing agency","profile":"/profile/codedesignorg","website":"https://www.codedesign.org","directory":"seo-firms","page":"17","verified":"","description":"We’re a data-driven digital marketing agency focused on growing sales and businesses online. From custom web development to 360° online marketing, we create digital strategies designed to help brands define and achieve their most valuable business goals.\nOur bespoke approach is aimed at finding the best digital solution to fit each of our client’s unique brand identity and online customer journey. We use a combination of the main digital disciplines (Search Engine Optimization, Paid Search Marketing, Display Marketing and Remarking, Organic and Paid Social Media, Content Marketing, and Data Analytics) to build holistic strategies focused on building brand awareness and driving conversions.\nIn the last years since our company’s conception, we’ve helped create digital success stories for clients all over the world, including the US, UK, Portugal, Switzerland, and Kuwait. About: Codedesign is a team of data-obsessives and creative thinkers. We define ourselves as digital problem solvers. We’re a group of strong individuals, each coming from different academic, professional, and cultural backgrounds.\nEvery member of the team is a specialist in their own discipline, from Web Development to Performance Marketing. However, Codedesign is more than just the sum of it’s parts. We believe teamwork is the key to our success, both internally and for our clients. We strive to create a collaborative work environment and actively seek opportunities to learn from each other. We recognize that every one of us is able to bring a unique perspective to a challenge, which is why we always take on our client’s projects as a team, not individuals.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"AVENIDA INFANTE DOM HENRIQUE, 332 EDIFICIO 2 - 1º DTO","locality":"Lisbon","region":"Lisboa","postal_code":"1800-223","country":"Portugal","phone":"+351 212 416 641O"}]}