{"id":"7938","name":"SBS Group","tagline":"Working with clients, not just for them","profile":"/profile/sbs-group","website":"http://www.sbsgroupusa.com","directory":"it-services","page":"75","verified":"","description":"SBS Group keeps its clients ahead of their competition by combining business savvy, technical prowess, and common sense values to deliver integrated technology solutions to mid-market companies along the Eastern seaboard. SBS delivers its solutions and services with the industry's top technology partners including Microsoft, Acumatica, Deltek, IBM, Hewlett Packard, Citrix, Cognos and others.\nFocused on distribution, manufacturing, supply chain management, customer relationship management, financial management, project management and accounting solutions, SBS Group has over 25 years of working with clients, not just for them. The SBS team has earned an award-winning reputation having been recognized as a Microsoft Gold Partner, Microsoft President's Club Member, Microsoft Partner of the Year (Dynamics SL), Accounting Technology's Killer VAR, IBM Beacon Award recipient and Sage Software Leadership Academy member. The company is headquartered in Woodbridge, New Jersey and operates 35 other regional offices across the United States. More information about SBS Group can be found at www.sbsgroupusa.com.SBS focuses on providing business management solutions including Microsoft Dynamics AX, Microsoft Dynamics NAV, Microsoft Dynamics GP, Dynamics SL, and Acumatica ERP to businesses across the nation. Additionally, we offer Microsoft CRM (customer relationship management) solutions, managed services, disaster recovery planning, business continuity planning, business intelligence (SharePoint MOSS), and Fixed Asset Management Solutions (FAS).\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"1986","locations":[{"headquarters":true,"address":"1460 Route 9 N, Ste. 307","locality":"Woodbridge","region":"NJ","postal_code":"07095","country":"United States","phone":"+1.732.476.5900"}]}