{"id":"79599","name":"SAG IPL","tagline":"SAG IPL, Website & Mobile App Development Company","profile":"/profile/sag-ipl","website":"https://www.sagipl.com","directory":"directory/mobile-application-developers","page":"29","verified":"","description":"SAG IPL is an ISO 27001: 2003 certified Mobile and Website Development Company located in India. Since its inception in 2010, the company has been engaged in offering comprehensive mobile app development, web development and digital marketing services to its clients on the global level.\nThey provide offshore website and mobile app development solutions, delivered to the clients on a pre-decided time frame and in a reasonable budget. The company has a talented team of experts, working very hard and dedicatedly on clients’ projects to ensure 100% satisfaction. In addition, they have a dedicated customer service team to assist clients with all their needs and queries.\nOver the years, SAG IPL has managed to become one of the top IT companies in India through its constant determination to provide only the best and most affordable internet services to clients worldwide. They have built a solid reputation in the blockchain industry through a series of successful ICO and blockchain projects. Their blockchain team has a unique combination of expert developers, marketers and content writers who strive to make each new ICO/blockchain project a success for all their existing and potential clients.\nSAG IPL offers the following web & mobile app development services:\nMobile App Development: IOS (iPhone & iPad), Android, Blackberry, Windows and AR App Development.\nWeb Design: UX/UI Design and Development, Responsive web/mobile design\nWebsite Development: Web Application solutions on latest technologies like PHP, Laravel, Nodejs, Angularjs, etc., eCommerce website development, Python Web Application Development\nICO Development and Marketing: Blockchain Development, Exchange Development, Digital Wallet Development\nOur Certifications:\nISO 27001:2013\nCMMI Level 3\nIAOP\nMember of NASSCOM\nMember of DSCI\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2010","locations":[{"headquarters":true,"address":"B-9, Third Floor, Mahalaxmi Nagar,Behind WTP South Block, Malviya Nagar","locality":"Jaipur","region":"RJ","postal_code":"302017","country":"India","phone":"+917023472073"},{"headquarters":false,"address":"26 Grenville Walk","locality":"Lalor","region":"VIC","postal_code":"3075","country":"Australia","phone":"+61481363973"}]}