{"id":"8064","name":"Compunnel Software Group","tagline":"Software. Consulting. Solutions.","profile":"/profile/compunnel-software-group","website":"http://www.compunnel.com","directory":"directory/mobile-application-developers","page":"102","verified":"","description":"Compunnel Software Group has dedicated 22 years to envisioning and developing customized solutions designed to help our partners and clients get the most out of the latest technology. Founded in 1989, Compunnel has since grown to become a global leader in multiple venues including IT consulting and staffing, custom business application development, eLearning and enterprise applications.\nCompunnel has been recognized as one of the 50 fastest growing privately held companies in the United States by Inc. magazine. Compunnel is ISO 9001:2008 certified and is one of Microsoft's Gold Partners. Over the years, Compunnel has enjoyed a rich and varied industry experience. We have developed more than 5,000 websites, many robust business applications and software as well as technical eLearning courses. Our Clients, which include Fortune 500 companies and come from an arena of industries ranging from health care and manufacturing to retail, technology and finance, know they can rely on Compunnel to deliver customized and comprehensive solutions to complement your business and technical objectives. “Go Beyond” Approach Combining boundless innovation and the depth of our multidisciplinary team of professionals with our “go beyond” approach to service, Compunnel has the right resources to help companies of all sizes cultivate real business value at the right price. Headquartered in New Jersey, we also have a strong business presence in the UK and other parts of Europe as well as a state-of-the-art development facility in India, allowing us to leverage a generous repository of IT-skilled manpower and the consistent availability of external subject matter experts. Contact us to find out what our years of experience, proven track record and platform of innovative solutions can offer your business today, tomorrow and for decades to come.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$25 - $49 / hr","num_employees":"250 - 999","founded":"1989","locations":[{"headquarters":true,"address":"103 Morgan Lane Ste 202","locality":"Plainsboro","region":"NJ","postal_code":"08536","country":"United States","phone":"609.529.0441"}]}