{"id":"81307","name":"PLVision","tagline":"IoT, Embedded, SDN & NFV Software Development","profile":"/profile/plvision","website":"http://plvision.eu","directory":"it-services","page":"21","verified":"","description":"Founded in 2007, PLVision is a custom software development company, specializing in Networking Embedded Systems, SDN (Software Defined Networking), NFV (Network Function Virtualization) and IoT, with a track record of serving global businesses:\nSwitch silicon (ASIC) vendors\nNetworking and industrial equipment vendors\nNetwork software vendors\nSystem integrators\nWe can help you activate more addressable market by:\nadapting your products to specific use cases or custom deployments;\nexposing your hardware’s features through software;\nbroadening your product’s functionality and improving user experience;\nscaling your capabilities on brownfield integration projects.\nBy adapting their products to the SDN and IoT reality, our customers are able to gain and maintain their competitive edge. To accelerate that, they leverage our in-depth expertise in Layer 2, Layer 3 network protocols and open source NOSes as well as profound experience with most popular merchant switch silicons (Broadcom, Intel, Cavium/Marvell, Mellanox and Barefoot).\nKey Service Offerings\nComputer Networking:\nNOS development and integration (FBOSS, SONiC/SAI, OPX)\nSDN northbound interface implementation (OpenFlow, P4RT, NETCONF)\nNetwork software acceleration on NIC: OS and drivers, frameworks and technologies (OvS, DPDK, P4, SR-IOV);\nNetwork focused applications (VNFs, virtualized fabrics used in CORD/Trellis/ONOS; OpenStack).\nIndustrial Internet of Things:\nIoT networking and connectivity development (industrial protocols, edge computing applications development) for industrial use cases:\nRemote Asset Monitoring;\nProduction Line Tracking;\nSmart Farming;\nSmart Healthcare;\nSmart House and Building.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2007","locations":[{"headquarters":true,"address":"V. Velykoho Str., 2C","locality":"Lviv","region":"","postal_code":"79026","country":"Ukraine","phone":"+1 (415) 906 3593"},{"headquarters":false,"address":"ul Siewna 18","locality":"Kraków","region":"","postal_code":"31-231","country":"Poland","phone":"+48 12 396 6219"}]}