{"id":"81704","name":"ADAMAPP LTD","tagline":"From ideation to creation.","profile":"/profile/adamapp","website":"http://www.adamapp.com","directory":"directory/mobile-application-developers","page":"8","verified":"","description":"ADAMAPP LTD is a passionate, dynamic and award-winning mobile application development company based in London. We provide our full stack development service to world’s leading brands as Tesco Europe,Tesco Ireland, T-Mobile, McDonald’s, MetLife, Danone, Vodafone and Volkswagen. We have over 300 clients, released 400+ apps and more than 22 million users worldwide.\nSpecialised in retail mobile application, we aim to help our customers in brand awareness promoting, customer relationships managing and increasing profits in long term. With branches in UK, we offer competitve price and fast turnover for our top-tier UK retailer clients.\nWe are dedicating to deliver responsive, user-centered and profitable mobile applications to our customers in iOS, Android devices as well as in Apple TV and Apple Watch. We commit our promises to embody innovative business conceptions into mobile applications which are beneficial to our customers’ businesses and make them stand out of the crowd.\nWith skilled and flexible developer team of 70+ iOS, Android and backend developers, we provide whole lifecycle of mobile application development. That means Requirement gathering, Analysis, Architecture design, API design, Technical solution, Project planning, UX/UI design, Programming, Release app on App Store and Google Play as well as long-term technical support. One of our great advantage is our delicate use of parsing algorithm. Especially for those companies struggling with accessing data from backend, we are able to collect them directly from the website as our valued customer Tesco Ireland benefit from it.\nDo you consider creating your own mobile application?\nPlease contact : hello@adamapp.com for free consultation.\n \nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2011","locations":[{"headquarters":true,"address":"79 College Road Harrow","locality":"London","region":"","postal_code":"HA1 1BD","country":"United Kingdom","phone":"+44 0203 367 2329"},{"headquarters":false,"address":"Jaselská 6","locality":"Prague","region":"","postal_code":"16000","country":"Czech Republic","phone":"+420 776 538 277"},{"headquarters":false,"address":"600‑8500 Leslie Street Markham,","locality":"Toronto","region":"","postal_code":"ON L3T 7M8","country":"Canada","phone":""},{"headquarters":false,"address":"38B, Cherni vrah Blvd. 1407","locality":"Sofia","region":"","postal_code":"","country":"Bulgaria","phone":""}]}