{"id":"81900","name":"In'saneLab","tagline":"Let us make your website & mobile app work better","profile":"/profile/insanelab","website":"http://insanelab.com","directory":"directory/mobile-application-developers","page":"32","verified":"","description":"WE PROVIDE WEB & MOBILE SOLUTIONS. COMPETENTLY. \nWhat could you do to make your website work better, attract more attention, convert, and sell more stuff? Let’s find out!\n \nBusiness is done with human beings. We work as a natural extension of your team, not a faceless, outsourced entity. \nWe love lasting relationships – as do our Clients. That’s why the majority of them return to us with more work, more tasks, and new projects. Once we get to know your needs, it’ll be easier for us to work together. We’re proud to say that we come personally recommended to about 80% of our new business.\n \nWe’re based in both Philadelphia and Krakow – two major technology hubs on two different ends of the Earth.\nKrakow raised us professionally. As the IT capital of Poland, it’s the perfect place for learning, growing, and launching an interactive agency. With a rich, multicultural community, it allows us to care for our values in the most precious way we might imagine – by interacting with others.\nPhiladelphia, on the other hand, allows us to see how far we’ve come. The core of In’saneLab works both in Europe and the US. Our work stateside has also helped us discover how different the needs of our clients can be. We’re constantly gaining experience and drawing from the both ends of the spectrum – from both the corporate and the startup world.\nOh, and since we’re on two continents – that make us available to you 24/7.\n \n \n \n \nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2010","locations":[{"headquarters":true,"address":"Suite 2, 520 Evans Street","locality":"Bethlehem","region":"PA","postal_code":"18015","country":"United States","phone":"+1 (215) 422 3697"},{"headquarters":false,"address":"1050 Crown Pointe Parkway, Suite 500","locality":"Atlanta","region":"GA","postal_code":"30338","country":"United States","phone":"+1 (484) 635-6719\u0003\u0003"},{"headquarters":false,"address":"Henryka Sienkiewicza 9/7","locality":"Krakow","region":"ML","postal_code":"30-033","country":"Poland","phone":"+48794436375"}]}