{"id":"82771","name":"Acropolium","tagline":"Web software development company.","profile":"/profile/acropolium","website":"http://www.acropolium.com","directory":"web-developers","page":"86","verified":"","description":"For over 16 years we provide:1) Complex Software DevelopmentOur senior software developers team has a longstanding experience of a turn-key project development. Only an expert team is capable to implement complex and non-standard systems from scratch.\n2) ConsultingDue to a lingering technical know-how of both management staff and senior engineers, we offer full consulting lifecycle in IT sphere.3) AuditAudit is similar to a complex system examination. We provide report about product’s weak spots with further recommendations for system optimization.4) OutsourcingSometimes it is hard to find appropriate team for your project. For this case we suggest outsourcing of our existing teams that work like one organism.\nAt Acropolium we have built a wide range of B2B and B2C software solutions for such domains:\n- Startups development\nFull development lifecycle for startups beginning from idea research until project release and further support.  Building of MVP for the product, since this is the key strategy for fast and quantitative market testing.\n- Intranet projects\nDevelopment of corporate networks, internal company portals, or any corporate solutions from scratch.\n- Medicine and Healthcare\nPortals for calibration and accounting of medical devices; websites for clinics of various complexity; management systems for doctors and patients.\n- Hospitality industry\n Systems with a large volume of traffic, resource-intensive functionality, file system and storage load, and databases.\n- Talent Management\nPortals for job search, talent employment.\n \n- Digital Media\nWe create a web-interface that works in any browser and on any device - computer, tablet, or smartphone.\nREAD MORE...","min_project_size":"$100,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"2003","locations":[{"headquarters":true,"address":"93/3 Karla IV.","locality":"Ceske Budejovice","region":"JC","postal_code":"37001","country":"Czech Republic","phone":"+420 388 880 038"}]}