{"id":"83093","name":"Arck Interactive","tagline":"You Imagine. We Create.","profile":"/profile/arck-interactive","website":"http://www.arckinteractive.com","directory":"web-developers","page":"1","verified":"","description":"Arck Interactive is a boutique digital agency focused on helping organizations create innovative web and mobile platforms.\nSince 2009, we've provided product design, development, marketing, managed hosting, and strategic services to clients who range from early-stage technology startups to multinational financial enterprises.\n \nOur work powers Gatorade’s Athlete Reporting Platform, Infusionsoft/Keap's CRM, World Bank’s internal and external social networks, Botworx' AI Marketing Bot network, John Wiley & Son’s faculty network, University of Michigan’s Health Modeling Platform, Executive Network’s business intelligence platform and social CRM, an educational learning network for Loyola High School, a commercial social networking application called “The Vine”, and many others.\n \nWe are open-source enthusiasts. Our developers are key contributors to several popular development frameworks, including Elgg, a social networking framework used in many of our community projects.\nService Offerings\nWeb and Mobile Product Strategy\nPrototyping, Concept and MVP Development\nFull-Stack Web Application Development (Node, Express, Angular, React, Vue, Laravel/PHP, Codeignitor, Djanjo, YI, Elgg, etc.)\nUI / UX Design, Strategy\nMobile Product Design\niOS App Development\nAndroid App Development\nHybrid App Development (React Native, Xamarin, Ionic, etc.)\nManaged Cloud Hosting via ArckCloud (IaaS, PaaS, bare metal)\nAI / Bot Development\nQuality Assurance & Testing\nMobile Backend Engineering (Google App Engine, Firebase, Deployd, Firehose, Socket.IO, Atmosphere, etc.)\nVariation and A/B Testing\nWeb Site: https://www.arckinteractive.com\nREAD MORE...","min_project_size":"$50,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"605 SW Burnside Ave","locality":"Portland","region":"OR","postal_code":"97218","country":"United States","phone":"312-212-3867"}]}