{"id":"83433","name":"vaporware","tagline":"Custom Web App Design and Development Services","profile":"/profile/vaporware","website":"https://www.vaporware.net","directory":"directory/mobile-application-developers","page":"76","verified":"","description":"Vaporware is a software agency focused on helping companies scale their business through technology. We serve small to mid-size businesses that are over capacity and need to improve internal processes or enter new markets to get to the next level. Since 2013, we’ve planned, prototyped, and produced more than 30 custom apps for customers in a variety of industries. Recent projects include:\nPre-hire recruiting platform for emerging businesses\nNationwide staffing tool for retailers and retail service organizations\nLanguage training and student communication platform in the food industry\nMaintenance management software for multifamily residential properties\nCustomer portal for compliance-focused cloud hosting provider\nCapital investment evaluation tool for the healthcare industry\nSoftware for real-time military intelligence gathering\nMembership management app for emerging visual and performing artists\nWith a focus on simple user experiences and maximizing returns, Vaporware helps clients define their product visions through a lean approach to deliver the right product to end users -- without wasting time or money.\nVaporware serves customers across the United States from its Raleigh headquarters and its Los Angeles office. Visit our website to learn more about our team and capabilities.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"Undisclosed","num_employees":"2 - 9","founded":"2013","locations":[{"headquarters":true,"address":"400 W. Morgan St. Suite 204","locality":"Raleigh","region":"NC","postal_code":"27603","country":"United States","phone":"919-827-4061"},{"headquarters":false,"address":"200 Spectrum Center Drive Suite 300","locality":"Irvine","region":"CA","postal_code":"92618","country":"United States","phone":"(714) 610-4223"}]}