{"id":"83676","name":"Vertex Ray","tagline":"User Experience Solutions","profile":"/profile/vertex-ray","website":"http://vertexray.com","directory":"web-developers","page":"88","verified":"","description":"Vertex Ray is a company dedicated to develop and design User Experience projects. Under the mantra \"Creating Experience\"​, we develope innovative designs with advanced technology, easy to integrate, flexible and with great advantages and possibilities. \nWe are passionate technologists with more than 10 years of experience in complex web and mobile projects for different type of industries. This makes us the ideal team for your development project.\n \n+ 300.000 Hs Frontend Development\n+ 1M Users Interact with our developed interfaces\n+ 25 UX Specialists working in four countries\nWhat we do:\nWe develop our products based on the best usability practices and on Microsoft’s leading technologies.\nVertex Ray was founded in 2007, since then, we have had more than 10 years’ experience on UX with the Microsoft platform, attaining the following competency: Microsoft Silver Web Development.\nQuality is present every time we commit to new projects and it motivates our continued improvement of their development, using cutting-edge technologies that show excellent results for our customers on quality control checks.\nOur Services: \n•    UX Consulting and Development (User experience)\n•    Azure Consulting (Cloud computing)\n•    Mobile Development\n•    Web Development\n•    Outsourcing\n \nHow we do it:\nUX design is the process of solving a problem for the user, helping them achieve their goals with ease and, thus, provide them with a pleasant experience. \nWe have 6 steps process\n1 . Investigate\n2. Ideate\n3. Prototype\n4. Evaluate\n5. Produce\n6. Testing\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"2007","locations":[{"headquarters":true,"address":"","locality":"Montevideo","region":"","postal_code":"","country":"Uruguay","phone":"+598 (2) 900 4732"}]}