{"id":"86441","name":"FAB Web Studio","tagline":"Focus Action Business","profile":"/profile/fab-web-studio","website":"http://fabwebstudio.com","directory":"directory/mobile-application-developers","page":"289","verified":"","description":"FAB Web Studio:\nHaving its origin in early 2013, FAB Web Studio is an IT firm headquartered in Durrham, NC. We are an IT partner you can depend on to increase business efficiencies and help your business be more visible online. FAB Web Studio has a team of skilled, experienced, passionate and creative team members who work hard to deliver quality results to clients.\nOur passions towards work let us come across unrivaled and street flouting techniques to help our clients in rising above the tough competitions which directly leads to enhanced business profits. Since our institution as a web design company, we have been consistently performing as a preeminent service provider for our renowned global clients. We feel proud to say that all our present and prior clients completely rely on our services and heartily appreciate us for our valued efforts.\n“FAB means FABulous. We live with it.”\nFor us clients’ satisfaction is of prime interest and we strive hard to ensure that our clients are  satisfied with the solutions we provide. We believe in delivering the best of results and for us, the sky is the limit and that is why we have core working ethical values and we take delight in our integrity. We're committed to clients and are always ready to go that extra mile for them to exceed their expectations.\nWe, keep growing with our Clients.\nWe started with web designing, now FAB Web Studio has expertise in mobile apps development and hosting services. We have served 100+ clients around the globe on different technologies. Our team members are experts in web development in Shopify, PHP with CMS like Magento, Drupal, Wordpress, and many others, and in Mobile Apps Development including Android, iOS and React Native and many others.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2013","locations":[{"headquarters":true,"address":"200 Meredith Dr","locality":"Durham","region":"NC","postal_code":"27713","country":"United States","phone":"3236010510"},{"headquarters":false,"address":"Sco 44 2nd Floor, Sector 11","locality":"Panchkula","region":"HR","postal_code":"134107","country":"India","phone":"8847588619"}]}