{"id":"8703","name":"Trillium Software","tagline":"Be Certain, Be Trillium Certain.","profile":"/profile/trillium-software","website":"http://www.trilliumsoftware.com","directory":"it-services","page":"76","verified":"","description":"A Deep Commitment to Data Quality Integration: Trillium Software\nHarte-Hanks Trillium Software® helps organizations achieve enterprise-wide Total Data Quality by providing a full complement of technologies, vertical-specific solutions, and consulting services for global data profiling and enrichment, data cleansing, and data linking to improve the value of all types of data across most vertical industries.\nClients utilize the powerful profiling and cleansing capabilities of Trillium Software for e-business, customer relationship management (CRM), data governance, enterprise resource planning (ERP), supply chain management, data warehouse (DW), and other enterprise applications. With headquarters in Billerica, Massachusetts U.S.A., Trillium develops the Trillium Software System®, the market-leading data quality software platform, and leverages the deep experience and expertise of its employees for data quality consulting and solutions engagements. In addition, Trillium provides industry-specific data quality solutions for claims data management, foreign tax accounting, legal entity, regulatory capital optimization, Basel regulations, and other data quality-centric regulatory challenges.     \nTrillium Software is a business of Harte-Hanks, a worldwide direct and multichannel, targeted marketing services company that provides direct and digital marketing services to its clients. Harte-Hanks also offers regional shopper advertising opportunities, and its PennySaver.USA circular and SaverTime product discounts website to local, regional and international consumer and business-to-business marketers.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"250 - 999","founded":"2008","locations":[{"headquarters":true,"address":"1700 District Ave Suite 300","locality":"Burlington","region":"MA","postal_code":"01803","country":"United States","phone":"1 (978) 436-8900"}]}