{"id":"87062","name":"Imaginovation","tagline":"Imagination Turns to Innovation","profile":"/profile/imaginovation","website":"https://www.imaginovation.net","directory":"directory/mobile-application-developers","page":"19","verified":"","description":"Company Overview:\nAt Imaginovation, we provide custom enterprise-grade technology solutions to a variety of businesses in any industry, from funded startups to Fortune 500 companies.\nOur services include building custom websites, web applications, mobile apps, and emerging technologies such as AI development, IoT development, and blockchain development. \nThe company was founded by brother-in-law's Pete Peranzo and Michael Georgiou back in October 2011. Since then, we have helped many companies boost their productivity, customer base, sales, and profit with our client-centered development approach.\nClutch, a leading online B2B platform, has recently named Imaginovation as one of the Top Technology Company in North Carolina. Since 2011, we have grown every year, and have won several credible technology awards, such as AVA Digital Awards, The American Business Award, and NC Tech Award for our innovative services. We have also been featured in top publications such as Entrepreneur, VentureBeat, Goalcast, Business.com, and Foundr.\nTo read more on our story, check it out here - https://starterstory.com/how-to-start-app-developing-business\nOur Brand Personality:\nThe Imaginovation slogan \"Imagination turns to Innovation\" is a balance between business creatives who guide our clients to understanding the business initiatives and goals for what they are trying to achieve and the creative solutions being presented to them.\nThe innovation side represents the technical and execution side of the company, where our experienced coders and engineers have done the impossible for many clients, and essentially turn your idea and concept into a digital reality reflecting our service offerings. \nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2011","locations":[{"headquarters":true,"address":"1001 Winstead Dr. Suite 300","locality":"Cary","region":"NC","postal_code":"27513","country":"United States","phone":"919-568-1960"},{"headquarters":false,"address":"15720 Brixham Hill Avenue, Suite 300","locality":"Charlotte","region":"NC","postal_code":"28277","country":"United States","phone":"704-612-2513"},{"headquarters":false,"address":"8801 Fast Park Dr. Suite 301","locality":"Raleigh","region":"NC","postal_code":"27617","country":"United States","phone":"919-568-1256"}]}