{"id":"8709","name":"Dynamics HR Management","tagline":"HR Management in Microsoft Dynamics 365","profile":"/profile/dynamics-hr-management","website":"http://www.dynamics-hr-management.com","directory":"it-services","page":"398","verified":"","description":"Field of activity\nDynamics HR Management is the complete solution for HR Management based on the Microsoft Dynamics 365 business platform.\nThe entire employee life cycle is supported. From recruiting, staff administration to talent management - all seamlessly integrated.\n\nContinuity\nxRM1 Business Solutions has a long tradition. It all started in 2004 with the idea to extend Microsoft CRM by adding project management functionality. The background to the idea was the wish for integrated working across departments between Sales, Service, Marketing and Project Management. Many other solutions have since been launched and are being continually enhanced.\nWith a focus on becoming market leader\nIn order to keep satisfying well the expectations of customers on the worldwide market, xRM1 concentrates solely on the development of business solutions based on Microsoft CRM.\nSuccess needs services\nxRM1 Business Solutions is complimented by xRM1 partners. The team of xRM1 partners supports local Microsoft CRM partners and their customers in launching the Business Solutions of xRM1. The services on offer are available worldwide and can be realized on site or online.\nInternational\nThe solutions of xRM1 Business Solutions are available in many languages. Launch support is provided by xRM1partners in 42 countries. We are native speakers of German, English, French, Spanish, Mandarin and Russian. Support is available 5 x 24h in all time zones.\nStockholders\nxRM1 Business Solutions is a brand of the itara group of companies.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":"347.410.9202"}]}