{"id":"8722","name":"Brainshark","tagline":"Transform the way businesspeople create and share","profile":"/profile/brainshark","website":"http://www.brainshark.com","directory":"it-services","page":"225","verified":"","description":"Brainshark was founded in 1999 with one vision:  to transform the way businesspeople create and share content. The goal was to democratize the use of multimedia, making it possible for anyone, unencumbered by time, cost or technical barriers, to produce powerful business communications.\nBy making it easy to create an immersive, interactive communications experience including audio and visual components, Brainshark was dedicated to helping organizations improve the reach and results of their messages.\nFrom this vision, the Brainshark platform was born – enabling the average businessperson with only basic tools, like PowerPoint and the phone, to add their voice to static content and create high-impact, video presentations. Before the ideas of user-generated content, software-as-a-service and online video became standard practice, Brainshark was already pioneering these concepts to enhance business communications.\nInspiration\nInitially, Brainshark began by addressing a pressing need in the corporate training industry.  Organizations were spending months of time and tens of thousands of dollars in computer-based course development.  Brainshark Founder and CEO Joe Gustafson knew he could provide a better way, by allowing organizations to empower their subject matter experts to create eLearning content within minutes…at a fraction of the previous cost.\nBrainshark soon encountered a groundswell of demand from other business areas that needed to rapidly create, share and track their business communications. Business professionals from sales, marketing, channels and HR functions soon began using Brainshark to create content that their audiences could consume at their convenience – anytime, anywhere and from any device.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"250 - 999","founded":"1999","locations":[{"headquarters":true,"address":"130 Turner St,","locality":"Waltham","region":"MA","postal_code":"02453","country":"United States","phone":"866.276.7427"}]}