{"id":"8819","name":"Contivio","tagline":"Click. Connect. Contact!","profile":"/profile/contivio","website":"http://www.contivio.com","directory":"it-services","page":"371","verified":"","description":"Contivio is a global provider of advanced contact centers and integration and automation solutions. Contivio's ability to rapidly deliver comprehensive solutions stems from our versatile suite of products – a number of which are patent protected – and has positioned us as respected leader in our fields of expertise.\n\nOur flagship Contivio Contact Center in the Cloud product has revolutionized the concept of contact center solutions. If you have access to MicrosoftTM Internet Explorer and a headset (can also be driven from any VoIP phone), you can be up and running with an enterprise level contact center within minutes…including integration to your back office systems! Contivio provides inbound and outbound multi-channel (voice, email, fax, SMS and voice mail) capability with automatic dialer, interactive voice response, real time statistics, configurable reporting, workforce management, voice recording and much more. Our patent protected Angels middleware enables Contivio to be integrated with any backend or CRM system (single or multiple) within minutes (Microsoft Dynamics, SugarCRM, RightNow, NetSuite, Leads360, Zoho, Google, Oracle, SAP, SalesForce.com, Siebel, Onyx, Sage SalesLogix, Goldmine or any other …)!\nContivio’s' unique suite of AngelsTM are an intelligent group of patented software “robots” that learn how humans use software applications such as CRM & ERP then extend the applications integration and automation capabilities. The Angels are used to create and publish web-service of target applications within minutes, automate the accomplishment of certain tasks such as screen-popping caller details in contact centers, collaborate to provide unified views composed of multiple applications and integrate with workflow engines to accommodate the demands of large and complex business process.\nContivio.com is distributed globally within Amazon Web Services an\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$50 - $99 / hr","num_employees":"10 - 49","founded":"2000","locations":[{"headquarters":true,"address":"2151 Michelson Dr #263","locality":"Irvine","region":"CA","postal_code":"92612","country":"United States","phone":"800.282.8105"}]}