{"id":"8829","name":"deNuvem","tagline":"A Cloud Technology Company","profile":"/profile/denuvem","website":"http://www.denuvem.com","directory":"it-services","page":"148","verified":"","description":"deNuvem means “of cloud” in Portuguese, which is appropriate for us as we focus solely on Microsoft® cloud technology. We help businesses, schools, and local governments by evaluating their current technology and finding out if implementing a cloud solution can save them time or money or give them new functionality.\nOur main offerings not only provide solutions to core technology needs such as e-mail, document management, collaboration, and contact relationship management but also include the necessary training for your users to help ensure the solution is a success.\n\nFor Business\nThink your business doesn’t have the same technology needs as global corporations? Think again. Even companies with only a handful of employees need a way to efficiently and effectively manage their leads and sales process, communicate online with each other and clients, and collaborate on projects. And they need to do so without a lot of overhead, and often with a limited number of dedicated IT staff. Microsoft’s Office 365 and Dynamics CRM can help you reduce infrastructure needs by taking advantage of Microsoft servers and best-in-class security,  and provide you with a predictable monthly cost, automatic upgrades, and the ability to adjust your licenses according to business needs.  Even better, you will be able to create a single experience for users from their sales, service, and marketing tools to productivity solutions and help increase productivity by giving them virtually anywhere access to the tolls and information they depend on.\n \nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"2 - 9","founded":"2010","locations":[{"headquarters":true,"address":"2133 Upton Dr. Ste. 126-235","locality":"Virginia Beach","region":"VA","postal_code":"23454","country":"United States","phone":"757-346-2523"}]}