{"id":"88992","name":"Sculpt","tagline":"Your B2B Social Media Agency for Reach & Revenue","profile":"/profile/sculpt","website":"http://wearesculpt.com","directory":"agencies","page":"3","verified":"","description":"Here's who we help and how:\nIn-House Marketers at B2B + Education Firms \nPaid Social Campaigns for Leads & Sales\nSocial Strategy & Management for Brand Awareness & Advocacy\nHubSpot and Drift partner agency ⚡️\nRead on...\nB2B marketers often have big goals and small teams, so we build social media strategies and customer acquisition systems that help them grow better (and faster). 🚀\n75% of B2B buyers use social media to make purchase decisions today. \nAre you making it easy to buy?\nAt Sculpt, we believe in doing B2B social the right way.\nThe way that fills the top of the funnel, empowers your employee and customer advocates, nurtures prospects, and brings a clearly definable ROI)\nIf you’re looking for an agile team of specialists that can….\nSteer your customer acquisition strategy? We’ll launch multi-channel paid campaigns that convert fans and visitors into buyers.\nClose more opportunities? We'll leverage marketing automation to connect the dots between your social and sales team.\nMake social media work smarter for your brand? We’ll transform your content strategy, and train your team to execute it.\nCreate content that’ll make your prospects take notice? We’ll re-tool your funnel with scroll-stopping assets and chatbots that nurture leads.\nLearn more about how we win fans, stop thumbs, define brands, and drive growth at wearesculpt.com.\nStill reading? \nYou seem nice.\nHere's our story: Sculpt is a social media agency with Hustle & Heart. We launched in 2012 with a mission to help the brands in our backyard connect with their human customers more humanly.\nEnough about us, what's your story?\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2012","locations":[{"headquarters":true,"address":"Sculpt 105 E College Street","locality":"Iowa City","region":"IA","postal_code":"52240","country":"United States","phone":"7077285780"}]}