{"id":"9076","name":"Prodware","tagline":"Creates, Integrates and Hosts IT solutions","profile":"/profile/prodware","website":"http://www.prodware-group.com","directory":"it-services","page":"255","verified":"","description":"Founded in 1989, PRODWARE creates, integrates and hosts IT solutions for businesses. Prodware is active in a sector where success requires a combination of strong IT expertise and industry know-how.\nPRODWARE serves more than 17,500 active clients and is a key player and partner for the installation and management of global IT solutions and applications.\n\nProdware operates in 16 countries and has forged strong strategic alliances with leading integrators and VARs to consolidate its position as a market leader. Prodware uses its size, market presence and alliances to support its\ncustomers’ aspirations for international expansion.\nProdware's managers are qualified in the fields of management science and computer sciences and right from the start attested their willingness to assist business managers by providing advice and service backed up by the added value of their professional backgrounds.\nKeeping up with the pace of technological change, Prodware teams are always ready to provide true global services to meet your requirements regardless of company size and needs.\nThe Prodware group offers the following services:\n    Auditing: Flow Management, Information System, Organization…\n    Consulting:  Specification, Change Management, Definition of the Targeted Systems Integrator (S.I) etc.\n    Integration: Installation, Configuration…\n    Training: Prodware is an authorized training center for Microsoft and other leading software vendors.\n    Specific Development: Application Development, Internet Websites…\n    Support: Hotline and Remote Maintenance and Assistance.\nProdware meets the expectations of its customers and guarantees consistently top quality service delivered by highly qualified and certified personnel.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"250 - 999","founded":"1989","locations":[{"headquarters":true,"address":"45, quai de la Seine","locality":"Paris","region":"","postal_code":"75927","country":"France","phone":"09 79 99 90 00"}]}