{"id":"9183","name":"COGEP","tagline":"Maintenance Software Specialist","profile":"/profile/cogep","website":"http://www.cogep.com","directory":"it-services","page":"82","verified":"","description":"We provide in-depth expertise and world-class computerized management tools, supporting companies in activities related to planning, organization and control of the maintenance of strategic assets, (production equipment, vehicles, real estate and technological equipment), inventories and purchases.\nBacked by experience in the field, along with implementations throughout North America, COGEP has earned the reputation as a company that listens to its customers and offers top-quality products and services.\nSince it designs the software, COGEP is constantly adapting and improving its product based on customer needs and market demands. Customers benefit from our approach and have immediate access to improvements through their service contracts at no extra cost.\nWhether it is through COGEP or our network of partners, our objectiveis to provide software users with comprehensive support, from decision-making, implementation, to ongoing optimization of the solution.\nOur team is comprised of engineers, technicians, computer analysts and managers. These professionals, men and women in the field, are attuned to your exact needs; they know your environment and limits.\nOur software is currently used by a wide range of customers who use it in one or more of the following situations:\nProduction equipment: mines and steel, pulp and paper plants, saw mills, agri-food sector, manufacturers, water and waste treatment plants, petrochemical plants, etc.\nBuilding sector: government and municipal buildings, private buildings, shopping centres, office buildings, hospitals, etc.\nTransportation: truck, bus, train or taxi fleets, municipal service vehicles, specialized heavy equipment, etc.\nTechnological equipment: computing equipment, computerized amusement systems, production robots, specialized medical equipment, etc\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1989","locations":[{"headquarters":true,"address":"825, boul. Lebourgneuf, bureau 400","locality":"Quebec","region":"QC","postal_code":"G2J 0B9","country":"Canada","phone":"1-877-424-2503"}]}