{"id":"9206","name":"ITRM","tagline":"Doing IT Differently","profile":"/profile/itrm","website":"http://www.itrm.co.uk","directory":"it-services","page":"247","verified":"","description":"ITRM is a privately owned IT services company who provide technical solutions for all your business needs. Formed in 1999, we take a dynamic approach to delivering the best possible service to our customers. Our objective from the outset has been to build strong relationships with clients based upon honesty and diligence. Our solutions will both support and transform your business.\nIT Support and Consultancy\n\nBy taking the time to understand the needs of your business we are able to provide bespoke IT managed services and consultancy projects tailored to your requirements and budget. We utilise industry leading technologies to ensure our services are delivered to the highest standards.\nNetwork Cabling\nWe offer comprehensive design and installation services for both copper and fibre optic infrastructure. From small office networks to large multi-site implementations, our technical designers and engineers have the knowledge and experience to maximise the performance of your cabling infrastructure.\nVoice and Data\nA full range of Internet and telephony services are available to suit your business needs. We offer impartial, unbiased advice on all aspects of business communications, specialising in reducing operational spend and delivering the right solution.\nWeb Design and Development\nWe specialise in providing high quality custom web and intranet software solutions, along with search engine optimisation, allowing you to maximise your presence on the web. We also provide logo and print design, allowing you to give your organisation a unique identity.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"1999","locations":[{"headquarters":true,"address":"Thames House St Johns Road","locality":"Sidcup","region":"KEN","postal_code":"DA14 4HD","country":"United Kingdom","phone":"44 (0) 20 8308 3300"}]}