{"id":"9214","name":"ITWorx","tagline":"Helping Decission Makers...","profile":"/profile/itworx","website":"http://www.itworx.com","directory":"it-services","page":"236","verified":"","description":"ITWorx is a global software professional services organization. Headquartered in Egypt, the company offers Portals, Business Intelligence, Enterprise Application Integration, and Application Development Outsourcing services to Global 2000 companies. ITWorx serves Governments, Financial Services firms, Educational institutions, Telecommunication operators, and Media companies in North America, Europe, and the Middle East.\n\nITWorx has partnered with Magic Quadrant technology vendors - Microsoft, Vignette, IBM, Oracle, MicroStrategy, Informatica, Ounce Labs, and Intel - as well as SAP-Microsoft solution provider ERP-Link. We leverage these partnerships, our global delivery model capability, our ISO 9001:2000 and CMMI level 3 certified processes, and model-driven development tools to extend our customers IT organization; augmenting it with agile, high quality, productive capabilities, technology competences, and vertical industry know-how.\nAcross industry verticals and service practices, ITWorx has developed specific competences in security, usability, productivity, and enterprise manageability to ensure that its customers spend less on keeping their applications up and running, and more on getting ahead of the competition.\nITWorx engagement model is based on forging long term strategic partnership relationships with its customers. It has thus since 1994 amassed a list of industry-leading Fortune 500 repeat customers the likes of United Technologies, Microsoft, Vodafone, and Mellon Bank.\nITWorx is privately held, with financial backing from the EuroMena Fund, Venture Capital Bank and Proparco.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1994","locations":[{"headquarters":true,"address":"Nasr City, Free Zone, Area 7B, Block J","locality":"Cairo","region":"","postal_code":"","country":"Egypt","phone":"+20 2 2673 6111"},{"headquarters":false,"address":"406 Farmington Avenue","locality":"Farmington","region":"CT","postal_code":"06032","country":"United States","phone":"860.676.7878"}]}