{"id":"9219","name":"Kynetix","tagline":"Transforming commodity markets","profile":"/profile/kynetix","website":"https://www.kynetix.com","directory":"it-services","page":"574","verified":"","description":"Our purpose is to bring the benefits of digitisation to commodities markets. Using the experience gained through working with the world’s leading commodity exchanges, start-ups, plus our enterprise agile software skills, we provide flexible, fast-to-market solutions for clients powered by our modular software Sentinel.\n\nWe have a simple purpose: to design, develop and deliver agile, high-payback business information systems for our Financial Services clients on time and on budget. We have 3 practices that focus on solutions for the Microsoft platform: Custom Development using Microsoft .NET, SQL Server and Windows Azure, CRM using Microsoft Dynamics CRM and Collaboration and Workflow using Microsoft SharePoint. Our 4th practice, Mobile Solutions, designs and develops mobile solutions for Apple, Microsoft and Android devices.\nWe help you deliver high-payback business solutions in short timeframes. We create our total software solutions through a combination of Microsoft technologies and best-in-class Agile methodologies, offering the most advanced options with the minimum of fuss and hassle.\nOur services are all associated with software and applications development, and are all designed to help you get things done better, faster and more cost-effectively. We run internal best practice initiatives every year to ensure that we improve our capabilities so that our clients get better sytems faster.\nKynetix is a Microsoft Gold Certified Partner. Services include Technology Consulting, Application Development and Systems Integration.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"1996","locations":[{"headquarters":true,"address":"1 Paris Garden","locality":"London","region":"","postal_code":"SE1 8ND","country":"United Kingdom","phone":"+44 (0)20 7836 1800"}]}