{"id":"92496","name":"Ideo Agency","tagline":"Internet Software House & Interactive Agency","profile":"/profile/ideo-agency","website":"https://www.ideoagency.com","directory":"directory/mobile-application-developers","page":"69","verified":"","description":"Our team has over 200 passionates who are real experts in their domains. Thanks to them, our projects are completed successfully and meet all customers' requirements. Our clients are willing to honestly recommend our services.\n \nWe are a full-service Software House.Our expertise and competencies enable us to execute even the most complex projects. We implement both simple websites and complex web applications e.g. intranet, e-commerce / B2B platforms, Document Management systems, e-learning platforms, loyalty programs, and many others. The majority of them are bespoke applications created from scratch. Our experience and knowledge enable us to design and create effective tools for your business. Thanks to the professional approach we build long-term relationships with our customers. \n \nWe are an Interactive Agency with 20 years of expertise.We analyze Customers and Internet users’ needs to create attractive and effective solutions. We offer a diverse range of services relating to all stages of planning, creation, and promotion of Internet solutions. Our projects are creative and useful instrumental in building our clients’ image. By combining creativity with the experience we help clients achieve their business potential and contribute to the development of their companies.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1999","locations":[{"headquarters":true,"address":"Nad Przyrwą 13","locality":"Rzeszów","region":"","postal_code":"35-234","country":"Poland","phone":"+48 17 860 21 86"},{"headquarters":false,"address":"Bukowińska 8/511","locality":"Warszawa","region":"","postal_code":"02-703","country":"Poland","phone":"+48 22 24 41 777"},{"headquarters":false,"address":"Nedre Storgate 37","locality":"Drammen","region":"","postal_code":"3015","country":"Norway","phone":"+47 91 716 109"}]}