{"id":"9262","name":"Sana Software","tagline":"Takes Care of your Online Business","profile":"/profile/sana-software","website":"http://www.sana-software.com","directory":"it-services","page":"234","verified":"","description":"As a Microsoft Partner with a Gold certification for Web Development and Silver certification for ISV, Sana Software delivers outstanding e-Business products for Microsoft Dynamics NAV and AX. Sana Commerce, which is Certified for Microsoft Dynamics (CfMD), offers a seamlessly integrated e-Commerce platform based on the business logic of Microsoft Dynamics and can be used as an online retail web store (B2C) as well as a Sales Portal (B2B).\nThe iPad ordering app offers full freedom in mobile order taking for sales agents.\nSana Commerce comes with a pre-deployed and well-designed Starter Site which enables your online business to be up-and-running in a few days. Standard features of this Starter Site include front-end content management, faceted search and quick order & order list mode. We deliver a fully documented Software Development Kit (SDK) to Microsoft Certified Professionals (MCP) partners that enables developers to comply with virtually any requirement or necessity to customize your web store.\nFrom our headquarters in Rotterdam, the Netherlands, and our sales office in the USA we support and extend a worldwide partner network of Sana Commerce resellers. Having 20 years of e-Commerce experience, Sana Software may offer a complete set of additional services and partnerships which are essential to successfully run your online business, such as advice on Search Engine Optimization (SEO), online marketing, hosting, online payment providers and graphic design.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"1992","locations":[{"headquarters":true,"address":"Van Nelleweg 1","locality":"Rotterdam","region":"","postal_code":"3044","country":"Netherlands","phone":"+31 10 243 6010"},{"headquarters":false,"address":"228 East 45th Street Suite9E","locality":"New York","region":"NY","postal_code":"10017","country":"United States","phone":"(646) 362-0432"}]}