{"id":"92765","name":"Régens Plc","tagline":"Coded for your Success","profile":"/profile/r%C3%A9gens-plc","website":"http://www.regenseurope.com","directory":"directory/mobile-application-developers","page":"258","verified":"","description":"Régens is an innovative tech company with deep experience and high-level expertise in business and e-governmental services. We provide professional business and software solutions with the latest technologies for global companies and SMEs with high expectations of digital transformation. We focus on improving the client's IT strategy to accelerate revenue growth and to increase market share.\nBespoke software development\nWe provide software solutions that are tailored and optimized for your ever-changing workflow and meet your specific requirements.\nWeb and mobile development\nOur portal and mobile app solutions allow you to build a comprehensive online presence with extended features.\nArtificial intelligence development\nAs the result of its continuous research activities, we started providing AI solutions in the domains of speech recognition, image recognition and text analysis.\nCloud and IT services\nOur cloud services follow international trends and support our partners’ business growth by cost-effective and highly scalable solutions.\nSystem integration\nWe are able to merge many different systems and components as one ensuring that each integrated subsystem functions as required.\nSystem and software audit\nWe evaluate your systems and programs to resolve any deficiencies and guarantee optimally configured, secure and well performing systems.\nDevelopment outsourcing\nWe deliver high-quality, top-talent and flexible software development, IT and consulting outsourcing services.\nLogistics and financial software solutions\nWe offer complex, highly customizable and easy-to-integrate software solutions to manage logistics and financial processes as simply as possible.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"10 - 49","founded":"1993","locations":[{"headquarters":true,"address":"19/D. Prielle Kornélia Street","locality":"Budapest","region":"BU","postal_code":"H-1117","country":"Hungary","phone":"+36.1.205.3090"}]}