{"id":"9307","name":"To-Increase","tagline":"Your Growth. Our Goal.","profile":"/profile/increase","website":"http://www.to-increase.com","directory":"it-services","page":"234","verified":"","description":"As a leading ISV for Microsoft Dynamics AX and Microsoft Dynamics NAV, To-Increase develops end-to-\n\nend solutions for construction, discrete manufacturing, distribution, food & beverage manufacturing, and retail and wholesale verticals. We also reach all industries with business process modeling and business integration solutions. By putting business processes front and center, we enable customers and partners to translate unique requirements into standardized solutions that ensure cost-effective implementations, maintenance, and upgrades.\nMore than 1,600 customers across 44 countries know that our solutions can meet the majority of specialized requirements from the start and evolve with changing business needs and technologies. We work together with\nMicrosoft, industry analysts and associations, partners, and customers to ensure that our solutions\nare backed by shared, expert insight.\nIn July 2010, To-Increase was awarded the Microsoft Dynamics Outstanding ISV of the Year—our second consecutive win. In July 2012, we achieved five years of consecutive membership in the Microsoft Inner Circle and President's Club.\nTo-Increase sells solutions indirectly, through a highly trained global partner network. Along with innovative, cost-effective solutions that keep your business running smoothly, we provide customers and partners with training, support, and new releases that align with Microsoft product releases.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2005","locations":[{"headquarters":true,"address":"Kazemat 2","locality":"Veenendaal","region":"UT","postal_code":"3905","country":"Netherlands","phone":"+31(0)318 531 900"},{"headquarters":false,"address":"600 Cordwainer Drive","locality":"Norwell","region":"MA","postal_code":"02061","country":"United States","phone":"425.765.4831"}]}