{"id":"93157","name":"GoodFolk","tagline":"Discover. Design. Develop. Deploy. Do Good.","profile":"/profile/goodfolk","website":"https://goodfolk.agency","directory":"web-developers","page":"141","verified":"","description":"Work Hard, Give Hard. That's our mission.\nFrom websites for local businesses to custom web apps serving millions of customers, we plan, design, develop, and promote beautiful & intelligent digital products. We spend 90% of our time designing and building amazing digital products for some of the world’s top brands. For the other 10%, we use our superpowers to help the causes we care about.\nWe take the time to understand each client’s challenges, and then present a solution that is uniquely suited to them. Maybe you need to get a simple WordPress website up as fast as possible so that you can start selling your services. Maybe you need a complete overhaul of your existing brand and online presence. Or maybe you just need someone to help drive traffic to your website through intelligent SEO & SEM strategies.\nWe also believe that being a world-class digital agency means that we have a responsibility to make the world a better place. We’re also firm believers that when you talk the talk, you’ve also got to walk the walk. that means that every other Friday is a GoodFolk Friday - we don’t do any client work and we just focus on projects for our charitable partners. We come together as a company to work on one larger project (usually lasting a year or longer, such as a website redesign or building an app) and various smaller projects for causes we believe in. And there’s usually some pizza involved.\nREAD MORE...","min_project_size":"$5,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2015","locations":[{"headquarters":true,"address":"125 South Clark Street 17th Floor","locality":"Chicago","region":"IL","postal_code":"60603","country":"United States","phone":"+1.203.668.0654"},{"headquarters":false,"address":"142 Temple Street Suite 302","locality":"New Haven","region":"CT","postal_code":"06510","country":"United States","phone":""}]}