{"id":"9383","name":"Konsultnet Scandinavia","tagline":"Both brains and heart","profile":"/profile/konsultnet-scandinavia","website":"http://www.konsultnet.se","directory":"it-services","page":"255","verified":"","description":"Konsultnet is the IT Company with commitment and affection. We deliver superior Enterprise Resource Planning (ERP), Business Intelligence (BI) and Customer Relationship Management (CRM) solutions.\nVision: To be the best ERP supplier in the Industry with the most satisfied customers in the market.Business Conception: Each solution must be of value to the customer, regardless of the application, tool or service purchased.\nSerious commitments\nOur clients are in most cases medium and large companies and organizations. Our success goes back fifteen years and is built on long-term, mutually beneficial relationships. As our client you always get your service on time and according to the price we agreed on. We guarantee you a successful project.\nResults that can be measured\nEach solution we deliver must be of value to your business - regardless of software, tool or service. The value has to be described clearly, and must be something which can be measured by our clients. 97 percent of our customers would recommend us to another customer or a friend.\nWell-run and secure\nKonsultnet has been evaluated by Sweden's leading business and credit information agency UC and Soliditet, and has the highest credit rating. Konsultnet is self-funded and has no long-term liabilities.\nQuality and organization\nWe use the strategic performance management tool Balanced Scorecard. Each employee has their own scorecard, and every time we make a strategic decision based on BSC, it must affect our customers in a positive way.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2000","locations":[{"headquarters":true,"address":"Luntmakargatan 116","locality":"Stockholm","region":"","postal_code":"112 51","country":"Sweden","phone":"46(0)8-4100 69 00"}]}