{"id":"9390","name":"Phocas","tagline":"Keep It Simple. We really do.","profile":"/profile/phocas","website":"http://www.phocassoftware.com","directory":"it-services","page":"269","verified":"","description":"Our award-winning business intelligence software is primarily designed for manufacturing, distribution and retail companies – anyone who sells a wide range of products to a varied customer base. Most of our current users are in sales & marketing, management, finance, purchasing and IT.\n\nOur software provides them with the solid and dependable information they need to make the right decisions – without having to pester their IT department. By doing so, they can optimize their business performance.\nSo how is Phocas different to the rest of the business intelligence software on the market? It’s simple. Whereas other BI tools may only provide you with pre-designed dashboards and the answers to pre-defined queries, Phocas enables you to explore and display all your data with complete freedom. It helps you identify the questions you need to ask, discover the answers and extract the essential insight that would otherwise be hidden deep within your data.\nA few other points to note are\n    Our software is a pre-built framework that we tailor to fit your business and whichever systems you’re using.\n    Our software is easy to implement, so you can be up and running in as little as a few days. That’s why BARC says we’re the fastest to implement.\n    Our customers have reported that our software pays for itself within days\n    With such a logical and intuitive interface, the software can be used by IT and business executives alike from day one.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"1999","locations":[{"headquarters":true,"address":"20-20 House Middlemarch Business Park Siskin Drive","locality":"Coventry","region":"","postal_code":"CV3 4FJ","country":"United Kingdom","phone":"+44 1865 364 103"}]}