{"id":"94596","name":"InVooDoo","tagline":"Making Things Work","profile":"/profile/invoodoo","website":"http://www.invoodoo.com","directory":"directory/mobile-application-developers","page":"31","verified":"","description":"We're specialized on Product Design (UX/UI/IxD/HCI/HF/UxD/IA), Mobile (iOS/Android) and Web Development (Front-End and Back-End) Our product showcase http://invoodoo.com/showcase We put a huge emphasis on determining user needs through UX research to build UX/UI that solves user problem, fits market and is easy to use.\nOur specialization is in building social networks, streaming apps, tools, utilities, e-commerce apps, consumer-facing products and B2B solutions. Also, on product architect side, we facilitate ideation phase, and cover for the entire cycle of product development: from idea to execution where design and implementation are married into great products people love to use. We put together a development team to help you create complex products or solutions for your end-users and help you to get your big house! ––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––– InVooDoo is a global strategy and technology California-based and internationally recognized company that helps innovators bring products to market. From idea to launch and beyond, including Discovery, Ideation, Design, Prototype and Build, we combine product design and world class software engineering to help startups, companies and corporate ships reach their marketing and financial goals.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$100 - $149 / hr","num_employees":"10 - 49","founded":"2006","locations":[{"headquarters":true,"address":"828 Newport Circle","locality":"Redwood City","region":"CA","postal_code":"94065","country":"United States","phone":"16502858375"},{"headquarters":false,"address":"21 Mashinobudivnikiv 209","locality":"Kyiv","region":"","postal_code":"01100","country":"Ukraine","phone":""},{"headquarters":false,"address":"","locality":"","region":"","postal_code":"","country":"United States","phone":""}]}