{"id":"9581","name":"CivicActions","tagline":"Empowered","profile":"/profile/civicactions","website":"http://civicactions.com","directory":"web-developers","page":"127","verified":"","description":"We specialize in the development of high-end, community-driven websites for clients with a social mission.\nCivicActions supports the global movement of people and organizations building a sustainable future by providing Drupal, CiviCRM and mobile application development though our professional Scrum project management methodology.\nOur work is aligned with our values.\n\nOur team of nearly 40 engineers, strategists, designers and project managers are committed to creating a better world. We have deployed more than 100 Drupal and CiviCRM-powered websites since 2005 for progressive organizations including Amnesty International, Center for Reproductive Rights, Women's Funding Network and the Free Software Foundation. We are known as one of the largest and most-experienced Drupal development firms and we are committed to taking action in the world for positive, sustainable change.\nOur Project Managers are all certified ScrumMasters who understand how to get projects done.\nScrum is our secret sauce. Our renowned Agile project management methodology delivers functional components of your site on a weekly basis, with regular updates throughout the build process. The highest priority is early and continuous delivery of valuable work that meets our clients goals as fast as possible.\nOur team are active contributors within the Drupal community.\nCivicActions has been involved in local Drupal Community events literally since the beginning. We've planned, supported and sponsored DrupalCamps since the inception, and we've sponsored nearly every DrupalCon since 2006. Our team members currently participate in local Drupal User Groups around the world, spanning 8 countries.\nREAD MORE...","min_project_size":"$10,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"10 - 49","founded":"2004","locations":[{"headquarters":true,"address":"2625 Alcatraz Avenue, Suite 320","locality":"Berkeley","region":"CA","postal_code":"94705","country":"United States","phone":"510.408.7510"}]}