{"id":"96676","name":"Theory SF","tagline":"Every big idea began as a theory","profile":"/profile/theory-sf","website":"http://www.theorysf.com","directory":"web-designers","page":"25","verified":"","description":"Theory SF is creative agency founded with the belief that all brands have an eternal truth -a story to be told in a compelling and relevant way. From how the consumer is first approached by the brand identity to well-thought-out social executions to what the package looks like on the shelf. They all need to work in harmony to shape and form a lasting impression that demands a following.\nThe agency is led by two partners, although very little “leading” is actually needed here because the place is swimming with smart, ambitious, funny, hardworking, and extremely talented people. Because we’re still young, many folks we meet are a little surprised by the experience of our staff and the list of world-class brands we work with. This success may be attributed to our intense desire, from the day we launched, not to follow anyone’s prescribed rules or industry standards (an innovative, world-class creative agency can only stay that way by continually challenging the status quo).\nThat’s why it’s always difficult to answer the inevitable question that pops up during a courtship: “So who is Theory SF, and what do you do?” The truth is, we are different things to different people. Who we were a year ago is not who we are today. And who we are today will surely not be who we are a year from now.\nWe know it would be easier for everyone if we could fit into one of the traditional agency buckets (brand strategy, advertising, design, interactive, direct marketing, and so on), but there is nothing traditional about how we approach what we do. And these days, there is nothing traditional about how people connect with brands or consume information. That’s why our work, inevitably, goes much deeper than anyone discipline. It falls somewhere within the complex interplay that occurs between a product and a brand, between a brand and a consumer, and between a consumer and a culture.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2015","locations":[{"headquarters":true,"address":"500 Montgomery St","locality":"San Francisco","region":"CA","postal_code":"94111","country":"United States","phone":"4152358111"}]}