{"id":"96936","name":"Colibri Digital Marketing","tagline":"Accelerating Success for Visionary Brands","profile":"/profile/colibri-digital-marketing","website":"https://colibridigitalmarketing.com","directory":"web-designers","page":"55","verified":"","description":"Evolved to meet the digital marketing needs of visionary organizations, Colibri Digital Marketing is San Francisco’s first and only full-service, B Corp-certified digital marketing agency. We are forward-thinking digital marketing leaders who reflect the ever-growing need for business leadership that promotes and defends the triple bottom line of people, planet, and profit.\nWe use digital marketing best practices to position your change-making brand for success and build the relationships your company needs to thrive.\nPositioning your brand for success means understanding your vision, your industry, and your clients. We start with a thorough and detailed look at what your organization is trying to achieve, and creating a flexible and actionable digital marketing plan that allows you to be productive and measure results.\nEffective triple bottom line digital marketing always takes into consideration the results you are trying to get with the people involved in your business (clients, employees, vendors, stockholders, board members and more), the planet (the environmental impact your company is having, and, of course, the profits the fuel your business. Successful companies can be influencers for a better world, and that is why triple bottom line and B Corp-minded businesses choose Colibri Digital Marketing.\nWe believe in your vision, we extend your reach, and we get you the best triple bottom line results possible.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$150 - $199 / hr","num_employees":"2 - 9","founded":"2012","locations":[{"headquarters":true,"address":"1931 Buchanan St","locality":"San Francisco","region":"CA","postal_code":"94115","country":"United States","phone":"415-816-4817"}]}