{"id":"9705","name":"Palnar Transmedia Pvt Ltd","tagline":"Software Development","profile":"/profile/palnar-transmedia","website":"http://www.palnarindia.com","directory":"directory/mobile-application-developers","page":"373","verified":"","description":"Palnar Transmedia Pvt Ltd is a Software Consultancy and Development company located in India having subsidies in the US. We have our own office in Muenster which functions as a direct point of contact in Germany. We have a strong team of developers in PHP, Microsoft technologies, Mobile applications, SAP/ERP, Java and open source.\nWe also develop sophisticated software products for our German, Holland and American customers and territories in different programming languages like AI, BI, IOT, C + +, Java, VB, iOS, Android, Delphi, CAD, SAP R / 3 - ABAP / 4, PHP etc. Linux is also one of our strengths and we have several projects in open source platform already executed. We are also glad to inform you that Palnar Transmedia has a strong technological backup from our principal company in the US, Palnar Inc, USA. Palnar Inc. has been providing software development services in the US Market for more than a decade. Over the last eleven years we have proven our competencies in highly complex software projects for our clients in Germany, Switzerland, The Netherlands, USA and Kuwait. Together with our German client UTSCH AG, we have even created high-end software solutions for the automatic embossing machines to issue high-security vehicle license plates in several countries in the Middle East. With companies like UTSCH AG and Roche Diagnostics in Basel, Switzerland we have been working for more than five years. Such partnerships are examples for the reliability, quality and delivery consciousness assured by Palnar to its clients, be it a small JAVA development or a high-end embedded system. Our familiarity with foreign cultures including German language and respect for their business values and requirements help us to ensure a foolproof execution of the project related tasks starting from the basic conceptualization stage to the implementation level.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"$25 - $49 / hr","num_employees":"50 - 249","founded":"1998","locations":[{"headquarters":true,"address":"II Floor, Gayatri Building, Technopark","locality":"Trivandrum","region":"KL","postal_code":"695581","country":"India","phone":"+91 471 2527102"}]}