{"id":"98806","name":"OSVIN Web Solutions","tagline":"A Leading Mobile and Web App Development Agency","profile":"/profile/osvin-web-solutions","website":"http://www.osvin.com","directory":"directory/mobile-application-developers","page":"14","verified":"","description":"Founded in 2009, OSVIN is India's leading Mobile and Web App Development agency. Your success is our passion. Our multi-disciplinary expertise, built by delighting global clients across 100+ iOS, Android and Web based applications, ensures that you are ever geared up for everything that matters to you and your business.\nKey areas of our expertise to actualise your business goals: \nWebsite Development (Desktop and Mobile): E-Commerce, CMS, CRM, ERPMobile App Development: iPhone, iPad, Android, Hybrid (works on both iOS and Android platforms)Design: User Interface, User ExperienceInternet Marketing: Search Engine Optimisation, Social Media Optimisation, Online Reputation Management, E-mail Marketing, Google Adwords, Content MarketingCustom: Concepts and prototyping\nService Offerings:\nStrategic Prototyping & Concept DevelopmentiOS App DevelopmentAndroid App DevelopmentCross Platform App DevelopmentWeb App DevelopmentGame DevelopmentQuality Assurance & TestingMobile Backend EngineeringApp AnalyticsApp Indexing \nDomain Expertise\nOn Demand AppsSocial Networking AppsTaxi and Transportation AppsBluetooth Connectivity AppsDrone AppsPhoto Sharing AppsHealth and Fitness AppsFood And Restaurant AppsVideo Streaming AppsCoupons and Deals AppsTour and Travel AppsMusic AppsChurch and NGO AppsReal Estate AppsMarketplace Apps\nSince 2009, Corporations (Small, Medium and Large sized), across the planet, trust our demonstrated technical expertise in the co-creation of breakthrough solutions, for an ever-changing world. \nContact us for a free quote.\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"< $25 / hr","num_employees":"50 - 249","founded":"2009","locations":[{"headquarters":true,"address":"J-7, Rajiv Gandhi Information and Technology Park","locality":"Chandigarh","region":"CH","postal_code":"160101","country":"India","phone":"9735362707"}]}