{"id":"98997","name":"The SEO Works","tagline":"We'll get you more customers online","profile":"/profile/seo-works","website":"https://www.seoworks.co.uk","directory":"web-designers","page":"14","verified":"","description":"The SEO Works are an award-winning provider of digital marketing, websites and paid social for over 100 companies all across the UK. We help businesses measure, understand, and fulfil their online potential.\nOur expert team is made up of content managers, link builders, brand managers, web techies and experienced online marketers who work together to provide measurable results for our clients.\nWe pride ourselves on delivering top-quality results that are based on proven techniques and an intimate, dynamic knowledge of ethical online marketing practices.\nThe SEO Works is a certified Google Partner Specialist for search advertising (SEO) and Google Adwords (PPC), and are Bing Ads accredited professionals. We are also part of the exclusive Google elevator programme which focuses on helping SME’s.\nUK Search Awards - Best Local Campaign Winner\nDrum Search Awards - Best B2C SEO Campaign Winner\nSummit International Awards - Marketing Effectiveness Award Winner\nAVA Digital Awards - Platinum B2C Award\nEuropean Search Awards - Best Small SEO Agency (Top 6)\nChambers of Commerce Business Awards - Excellence in Professional Services\nhttps://www.seoworks.co.uk/\nREAD MORE...","min_project_size":"$1,000+","avg_hourly_rate":"Undisclosed","num_employees":"10 - 49","founded":"2009","locations":[{"headquarters":true,"address":"Metis 1, 1 Scotland Street","locality":"Sheffield","region":"SYK","postal_code":"S3 7AT","country":"United Kingdom","phone":"+44 0800 292 2410"},{"headquarters":false,"address":"4100 Park Approach, Thorpe Park","locality":"Leeds","region":"WYK","postal_code":"LS15 8GB","country":"United Kingdom","phone":"+44 0800 292 2410"},{"headquarters":false,"address":"The Old Truman Brewery, 91 Brick Lane","locality":"London","region":"","postal_code":"E1 6QL","country":"United Kingdom","phone":"+44 0800 292 2410"}]}