{"id":"99596","name":"Think Design","tagline":"A Strategic UI UX Consultancy","profile":"/profile/think-design","website":"https://think.design","directory":"web-developers","page":"42","verified":"","description":"We are driven by Insight, we drive results through Design.\nSince 2004, we have been powering mission critical initiatives of a few of the most renown organizations and brands, transforming businesses across industries and millions of users through our methods.\nThrough our teams spread across six global cities; and a vibrant ecosystem of clients, partners and leadership at each of our studios, we have the ability to be lean and efficient as well as massive and impactful. With capabilities spanning primary user research, consulting, design and technology, we work closely with top leadership and foundational teams to identify elements that constitute success, propose solutions and help build them.\nThrough our methodologies we built over years of practice, we bring a unique combination of Strategic, Creative and Technical expertise that is of immediate value to the people we work with. As a company founded by designers, our very DNA allows us to understand the explicit and comprehend the implicit: Everything that we do is driven by thought leadership and acquired sensibilities.\nOur associations with prestigious educational institutions, industry bodies and world renown organisations puts us within arm's reach of the greatest minds in this world; and it is our fundamental nature to give and gain learning that has made us a force to reckon with. Our relationship with our clients and lineup of some of the most prestigious international awards we have been winning are a testimony to our capabilities and our commitment to good design.\nREAD MORE...","min_project_size":"$25,000+","avg_hourly_rate":"$50 - $99 / hr","num_employees":"50 - 249","founded":"2004","locations":[{"headquarters":true,"address":"403 16th Street, Suite 301","locality":"Denver","region":"CO","postal_code":"80202","country":"United States","phone":"7203407242"},{"headquarters":false,"address":"A29, First Floor, Block B1 Extn, Mohan Cooperative Industrial Estate","locality":"New Delhi","region":"DL","postal_code":"110044","country":"India","phone":"+91-11-41318387"},{"headquarters":false,"address":"602, Jay Krishna Complex, Opp. YRF Studios, Fun Republic Lane, Off Andheri Link Road, Andheri West","locality":"Mumbai","region":"MH","postal_code":"400053","country":"India","phone":"+91-22-69979912"},{"headquarters":false,"address":"8-2-120/76, Ground Floor, Plot No. 89, Road No. 2, Banjarahills","locality":"Hyderabad","region":"AP","postal_code":"500034","country":"India","phone":"+91-40-23300089"},{"headquarters":false,"address":"42/1, 2nd Floor, 4th Cross, Near CMH Road Metro Station, Indiranagar 1st Stage","locality":"Bengaluru","region":"KA","postal_code":"560038","country":"India","phone":"+91-80-41172661"}]}