{"id":"9960","name":"PageSuite","tagline":"Security, Consistency and Innovation","profile":"/profile/pagesuite","website":"http://www.pagesuite.com","directory":"directory/mobile-application-developers","page":"97","verified":"","description":"Organic growth\nIn 2006 PageSuite launched our first digital page-turning software product, which is still the core component to so many of our products. Leveraging technological innovations, business referrals and industry knowledge has sustained our stable and continuous progression, attracting and retaining key clients and employees to grow with us.\nGlobal reach\nPageSuite operates from two offices, servicing our broad global publishing markets, with North and South America managed mainly from our Atlanta, Georgia, USA office, and the rest of the world from our UK HQ in Ashford, Kent, UK.\nWe have a strong presence with big brand national newspapers across the world – leading in UK, USA, Brazil, Caribbean and Southeast Asia, as well as an excellent regional newspaper base in UK, Ireland, USA and Canada. Within the magazine market, our core competency attracts large groups – leading in UK, USA and Dubai, looking for resourcefulness across volume and niche to medium sized B2B and B2C brands – leading in UK, USA, Canada and South Africa, focused on revenue generation.\nPrinciples\nSecurity, consistency and innovation are central to PageSuite, with a support and development infrastructure in place since company inception, providing all clients access to stable products, training and impactful growth.\nPageSuite operate two market principles; the first – providing strategic out-the-box solutions serving the majority of publishers, driven over the longer term by our second – custom developments for several large brands each year.\nWe strive to be market leaders across our core digital, mobile and tablet products in quality, market penetration and client success. Our second primary strength, the ability to create custom solutions, is focused on delivery to specification, through unique design and product development.\nREAD MORE...","min_project_size":"Undisclosed","avg_hourly_rate":"$150 - $199 / hr","num_employees":"50 - 249","founded":"2006","locations":[{"headquarters":true,"address":"Goldwell Court Goldwell Lane","locality":"Aldington","region":"KEN","postal_code":"TN25 7DX","country":"United Kingdom","phone":"44 (0) 1233 721030"}]}